[
  {
    "section": 1,
    "title": "Short title, commencement and extent",
    "description": "(1)This Act may be cited as the Code of Civil Procedure,1908.\n\n\n(2) It shall come into force on the first day of January, 1909.\n\n\n1[(3) It extends to the whole of India except-- \n\n\n2* * * * *\n\n\n(b) the State of Nagaland and the tribal areas :\n\n\nProvided that the State Government concerned may, by notification in the Official Gazette, extend the provisions of this Code or any of them to the whole or part of the State of Nagaland or such tribal areas, as the case may be, with such supplemental, incidental or consequential modifications as may be specified in the notification.\n\n\nExplanation.-- In this clause, \"tribal areas\" means the territories which, immediately before the 21st day of January, 1972, were included in the tribal areas of Assam as referred to in paragraph 20 of the Sixth Schedule to the Constitution.\n\n\n(4)In relation to the Amindivi Islands, and the East Godavari, West Godavari and Visakhapatnam Agencies in the State of Andhra Pradesh and the Union Territory of Lakshadweep, the application of this Code shall be without prejudice to the application of any rule or regulation for the time being in force in such Islands, Agencies or such Union Territory, as the case may be, relating to the application of this Code.]"
  },
  {
    "section": 2,
    "title": "Definitions",
    "description": "In this Act, unless there is anything repugnant in the subject or context, \n\n(1) \"Code\" includes rules;\n\n(2) \"decree\" means the formal expression of an adjudication which, so far as regards the Court\nexpressing it, conclusively determines the rights of the parties with regard to all or any of the matters in\ncontroversy in the suit and may be either preliminary or final. It shall be deemed to include the rejection\nof a plaint and the determination of any question within 1*** section 144, but shall not include \n\n(a) any adjudication from which an appeal lies as an appeal from an order, or\n\n(b) any order of dismissal for default.\n\nExplanation.A decree is preliminary when further proceedings have to be taken before the suit\ncan be completely disposed of. It is final when such adjudication completely disposes of the suit. It\nmay be partly preliminary and partly final;\n\n(3) \"decree-holder\" means any person in whose favour a decree has been passed or an order\ncapable of execution has been made;\n\n(4) \"district\" means the local limits of the jurisdiction of a principal Civil Court of original\njurisdiction (hereinafter called a District Court), and includes the local limits of the ordinary\noriginal civil jurisdiction of a High Court;\n\n\n[2(5) \"foreign Court\" means a Court situate outside India and not established or continued by the\nauthority of the Central Government;] \n\n(6) \"foreign judgment\" means the judgment of a foreign Court;\n\n(7) \"Government Pleader\" includes any officer appointed by the State Government to perform all\nor any of the functions expressly imposed by this Code on the Government Pleader and also any\npleader acting under the directions of the Government Pleader;\n\n(7A) \"High Court\" in relation to the Andaman and Nicobar Islands, means the High Court in\nCalcutta;\n\n(7B) \"India\", except in sections 1, 29, 43, 44, 4\n[44A,] 78, 79, 82, 83 and 87A, means the territory\nof India excluding the State of Jammu and Kashmir;]\n\n(8) \"Judge\" means the presiding officer of a Civil Court; \n\n(9) \"judgment\" means the statement given by the Judge of the grounds of a decree or order;\n\n(10) \"judgment-debtor\" means any person against whom a decree has been passed or an order capable\nof execution has been made;\n\n(11) \"legal representative\" means a person who in law represents the estate of a deceased person, and\nincludes any person who intermeddles with the estate of the deceased and where a party sues or issued in\na representative character the person on whom the estate devolves on the death of the party so suing or\nsued;\n\n(12) \"mesne profits\" of property means those profits which the person in wrongful possession of such\nproperty actually received or might with ordinary diligence have received therefrom, together with\ninterest on such profits, but shall not include profits due to improvements made by the person in wrongful\npossession;\n\n(13) \"movable property\" includes growing crops;\n\n(14) \"order\" means the formal expression of any decision of a Civil Court which is not a decree;\n\n(15) \"pleader\" means any person entitled to appear and plead for another in Court, and includes an\nadvocate, a vakil and an attorney of a High Court;\n\n(16) \"prescribed\" means prescribed by rules;\n\n(17) \"public officer\" means a person falling under any of the following descriptions, namely:\n\n(a) every Judge;\n\n(b) every member of 5\n[an All-India Service];\n\n(c) every commissioned or gazetted officer in the military 6\n[naval or air] forces of7\n[the Union]\n8\n*** while serving under the Government;\n\n(d) Every officer of a court of Justice whose duty it is, as such officer, to investigate or report on\nany matter of law or fact, or to make, authenticate or keep any document, or to take charge or dispose\nof any property, or to execute any judicial process, or to administer any oath, or to interpret, or to\npreserve order, in the Court, and every person especially authorised by a court of Justice to perform\nany of such duties;\n\n(e) every person who holds any office by virtue of which he is empowered to place or keep any\nperson in confinement;\n\n(f) every officer of the Government whose duty it is, as such officer, to prevent offences, to give\ninformation of offences, to bring offenders to justice, or to protect the public health, safety or\nconvenience;\n\n(g) every officer whose duty it is, as such officer, to take, receive, keep or expend any property on\nbehalf of the Government, or to make any survey, assessment or contract on behalf of the\nGovernment, or to execute any revenue process, or to investigate, or to report on, any matter affecting\nthe pecuniary interests of the Government, or to make, authenticate or keep any document relating to\nthe pecuniary interests of the Government, or to prevent the infraction of any law for the protection of\nthe pecuniary interests of the Government; and\n\n(h) every officer in the service or pay of the Government, or remunerated by fees or commission\nfor the performance of any public duty;\n\n(18) \"rules\" means rules and forms contained in the First Schedule or made under section 122 or\nsection 125;\n\n(19) \"share in a corporation\" shall be deemed to include stock, debenture stock, debentures or bonds;\nand\n\n(20) \"signed\", save in the case of a judgment or decree, includes stamped.\n\n9* * * * *"
  },
  {
    "section": 3,
    "title": "Subordination of Courts",
    "description": "For the purposes of this Code, the District Court is subordinate to the High Court, and every Civil Court of a grade inferior to that of a District Court and every Court of Small Causes is subordinate to the High Court and District Court."
  },
  {
    "section": 4,
    "title": "Savings",
    "description": "(1) In the absence of any specific provision to the Contrary, nothing in this Code shall be deemed to limit or otherwise affect any special or local law now in force or any special jurisdiction or power conferred, or any special form of procedure prescribed, by or under any other law for the time being in force.\n\n(2) In particular and without prejudice to the generality of the proposition contained in sub-section(1), nothing in this Code shall be deemed to limit or otherwise affect any remedy which a landholder or landlord may have under any law for the time being in force for the recovery of rent of agricultural land from the produce of such land."
  },
  {
    "section": 5,
    "title": "Application of the Code to Revenue Courts",
    "description": "(1) Where any Revenue Courts are governed by the provisions of this Code in those matters of procedure upon which any special enactment applicable to them is silent, the State Government 1 *** may, by notification in the Official Gazette, declare that any portions of those provisions which are not expressly made applicable by this Code shall not apply to those Courts, or shall only apply to them with such modifications as the State Government 2 * * * may prescribe.\n\n(2) \"Revenue Court\" in sub-section (1) means a Court having jurisdiction under any local law to entertain suits or other proceedings relating to the rent, revenue or profits of land used for agricultural purposes, but does not include a Civil Court having original jurisdiction under this Code to try such suits or proceedings as being suits or proceedings of a civil nature."
  },
  {
    "section": 6,
    "title": "Pecuniary jurisdiction",
    "description": "Save in so far as is otherwise expressly provided, nothing herein contained shall operate to give any Court jurisdiction over suits the amount or value of the subject-matter of which exceeds the pecuniary limits (if any) of its ordinary jurisdiction."
  },
  {
    "section": 7,
    "title": "Provincial Small Cause Courts",
    "description": "The following provisions shall not extend to Courts\nconstituted under the Provincial Small Cause Courts Act, 1887(9 of 1887) 1\n[or under the Berar Small\nCause Courts Law, 1905,] or to Courts exercising the jurisdiction of a Court of Small Causes 2[under the\nsaid Act or Law,] 3[or to Courts in 4[any part of India to which the said Act does not extend] exercising a\na corresponding jurisdiction that is to say.--\n\n\n(a) so much of the body of the Code as relates to]--\n\n\n(i) suits excepted from the cognizance of a Court of Small Causes;\n\n\n(ii) the execution of decrees in such suits;\n\n\n(iii) the execution of decrees against immovable property; and\n\n\n(b) the following sections, that is to say,--\n\n\nsection 9,\n\n\nsections 91 and 92,\n\n\nsections 94 and 95 5\n[so far as they authorize or relate to]--\n\n\n(i) orders for the attachment of immovable property,\n\n\n(ii) injunctions,\n\n\n\n(iii) the appointment of a receiver of immovable property, or\n\n\n(iv) the interlocutory orders to in clause (e) of section 94,] and sections 96 to 112 and 115."
  },
  {
    "section": 8,
    "title": "Presidency Small Cause Courts",
    "description": "Save as provided in sections 24, 38 to 41, 75, clauses (a), (b)\nand (c), 76,1[77, 157 and 158,] and by the Presidency Small Cause Courts Act, 1882 (15 of 1882), the\nprovisions in the body of this Code shall not extend to any suit or proceeding in any Court of Small\nCauses established in the towns of Calcutta, Madras and Bombay :\n2[Provided that-- \n \n\n1) the High Courts of Judicature at Fort William, Madras and Bombay, as the case may be, may\nfrom time to time, by notification in the Official Gazette, direct3\n that any such provisions not\ninconsistent with the express provisions of the Presidency Small Cause Courts Act, 1882 (15 of 1882),\nand with such modifications and adaptations as may be specified in the notification, shall extend to suits\nor proceedings or any class of suits or proceedings in such Court.\n\n(2) All rules heretofore made by any of the said High Courts under section 9 of the Presidency\nSmall Cause Courts Act, 1882 (15 of 1882) shall be deemed to have been validly made. ]"
  },
  {
    "section": 9,
    "title": "Courts to try all civil suits unless barred",
    "description": "The Courts shall (subject to the provisions herein\ncontained) have jurisdiction to try all suits of a civil nature excepting suits of which their cognizance is\neither expressly or impliedly barred.\n\n1[Explanation I].--A suit in which the right to property or to an office is contested is a suit of a civil\nnature, notwithstanding that such right may depend entirely on the decision of questions as to religious\nrites or ceremonies.\n\n2[Explanation II].--For the purposes of this section, it is immaterial whether or not any fees are attached\nto the office referred to in Explanation I or whether or not such office is attached to a particular place.]\n\n\n\nSTATE AMENDMENTS\n\nMaharashtra.--\n\nSection 9A of the Code of Civil Procedure, 1908, in its application to the State of Maharashtra\n(hereinafter referred to as \"the principal Act\"), shall be deleted.\n\n[Vide Maharashtra Act 61 of 2018, sec. 2.]\n\nNotwithstanding the deletion of section 9A of the principal Act,--\n\n(1) where consideration of a preliminary issue framed under section 9A is pending on the date of\ncommencement of the Code of Civil Procedure (Maharashtra Amendment) Act, 2018 (hereinafter, in this\nsection, referred to as \"the Amendment Act\"), the said issue shall be deemed to be an issue framed under\nOrder XIV of the principal Act and shall be decided by the Court, as it deems fit, along with all other\nissues, at the time of final disposal of the suit itself :\n\nProvided that, the evidence, if any, led by any party or parties to the suit, on the preliminary issue so\nframed under section 9A, shall be considered by the Court along with evidence, if any, led on other issues\nin the suit, at the time of final disposal of the suit itself ;\n\n(2) in all the cases, where a preliminary issue framed under section 9A has been decided, holding that\nthe Court has jurisdiction to entertain the suit, and a challenge to such decision is pending before a\nrevisional Court, on the date of commencement of the Amendment Act, such revisional proceedings shall\nstand abated : \n\nProvided that, where a decree in such suit is appealed from any error, defect or irregularity in the order\nupholding jurisdiction shall be treated as one of the ground of objection in the memorandum of appeal as\nif it had been included in such memorandum ;\n\n(3) in all cases, where a preliminary issue framed under section 9A has been decided, holding that the\nCourt has no jurisdiction to entertain the suit, and a challenge to such decision is pending before an\nappellate or revisional Court, on the date of commencement of the Amendment Act, such appellate or\nrevisional proceedings shall continue as if the Amendment Act has not been enacted and section 9A has\nnot been deleted :\n\nProvided that, in case the appellate or revisional Court, while partly allowing such appeal or revision,\nremands the matter to the trial Court for reconsideration of the preliminary issue so framed under\nsection 9A, upon receipt of these proceedings by the trial Court, all the provisions of the principal Act\nshall apply ;\n\n(4) in all cases, where an order granting an ad-interim relief has been passed under sub-section (2) of\nsection 9A prior to its deletion, such order shall be deemed to be an ad-interim order made under Order\nXXXIX of the principal Act and the Court shall, at the time of deciding the application in which such an\norder is made, either confirm or vacate or modify such order.\n\n[Vide Maharashtra Act 61 of 2018, sec. 3.]\n\nMaharashtra.--\n\nIn section 3 of the Code of Civil Procedure (Maharashtra Amendment) Act, 2018, for clause (1), the\nfollowing clause shall be substituted and shall be deemed to have been substituted with effect from 27th\nJune 2018, being the date of commencement of the said Act, namely:--\n\n\"(1) where consideration of a preliminary issue framed under section 9A is pending on the date of\ncommencement of the Code of Civil Procedure (Maharashtra Amendment) Act, 2018 (hereinafter, in this\nsection, referred to as \"the Amendment Act\"), the said issue shall be decided and disposed of by the Court\nunder section 9A, as if the said section 9A has not been deleted;\".\n\n[Vide Maharashtra Act 72 of 2018, sec. 2, (w.e.f. 27-6-2018.)]"
  },
  {
    "section": 10,
    "title": "Stay of suit",
    "description": "No Court shall proceed with the trial of any suit in which the matter in issue is also directly and substantially in issue in a previously instituted suit between the same parties, or between parties under whom they or any of them claim litigating under the same title where such suit is pending in the same or any other Court in 1[India] have jurisdiction to grant the relief claimed, or in any Court beyond the limits of 1[India] established or continued by 2[the Central Government 3* * *.] and having like jurisdiction, or before 4[the Supreme Court].\n\nExplanation.--The pendency of a suit in a foreign Court does not preclude the Courts in 1[India] from trying a suit founded on the same cause of action."
  },
  {
    "section": 11,
    "title": "Res judicata",
    "description": "No Court shall try any suit or issue in which the matter directly and substantially in issue has been directly and substantially in issue in a former suit between the same parties, or between parties under whom they or any of them claim, litigating under the same title, in a Court competent to try such subsequent suit or the suit in which such issue has been subsequently raised, and has been heard and finally decided by such Court.\n\nExplanation I.-- The expression former suit shall denote a suit which has been decided prior to a suit in question whether or not it was instituted prior thereto.\n\nExplanation II.-- For the purposes of this section, the competence of a Court shall be determined irrespective of any provisions as to a right of appeal from the decision of such Court.\n\nExplanation III.--The matter above referred to must in the former suit have been alleged by one party and either denied or admitted, expressly or impliedly, by the other.\n\nExplanation IV.-- Any matter which might and ought to have been made ground of defence or attack in such former suit shall be deemed to have been a matter directly and substantially in issue in such suit.\n\nExplanation V.-- Any relief claimed in the plaint, which is not expressly granted by the decree, shall for the purposes of this section, be deemed to have been refused.\n\nExplanation VI.-- Where persons litigate bona fide in respect of a public right or of a private right claimed in common for themselves and others, all persons interested in such right shall, for the purposes of this section, be deemed to claim under the persons so litigating .\n\n1[Explanation VII.-- The provisions of this section shall apply to a proceeding for the execution of a decree and references in this section to any suit, issue or former suit shall be construed as references, respectively, to a proceeding for the execution of the decree, question arising in such proceeding and a former proceeding for the execution of that decree.\n\nExplanation VIII.-- An issue heard and finally decided by a Court of limited jurisdiction, competent to decide such issue, shall operate as res judicata in a subsequent suit, notwithstanding that such Court of limited jurisdiction was not competent to try such subsequent suit or the suit in which such issue has been subsequently raised.]"
  },
  {
    "section": 12,
    "title": "Bar to further suit",
    "description": "Where a plaintiff is precluded by rules from instituting a further suit in respect of any particular cause of action, he shall not be entitled to institute a suit in respect of such cause of action in any Court to which this Code applies."
  },
  {
    "section": 13,
    "title": "When foreign judgment not conclusive",
    "description": "A foreign judgment shall be conclusive as to any matter thereby directly adjudicated upon between the same parties or between parties under whom they or any of them claim litigating under the same title except--\n\n(a) where it has not been pronounced by a Court of competent jurisdiction;\n\n(b) where it has not been given on the merits of the case;\n\n(c) where it appears on the face of the proceedings to be founded on an incorrect view of international law or a refusal to recognise the law of 1 [India] in cases in which such law is applicable;\n\n(d) where the proceedings in which the judgment was obtained are opposed to natural justice;\n\n(e) where it has been obtained by fraud;\n\n(f) where it sustains a claim founded on a breach of any law in force in 1 [India]."
  },
  {
    "section": 14,
    "title": "Presumption as to foreign judgments",
    "description": "The Court shall presume upon the production of any document purporting to be a certified copy of a foreign judgment, that such judgment was pronounced by a Court of competent jurisdiction, unless the contrary appears on the record; but such presumption may be displaced by proving want of jurisdiction."
  },
  {
    "section": 15,
    "title": "Court in which suits to be instituted",
    "description": "Every suit shall be instituted in the Court of the lowest grade competent to try it."
  },
  {
    "section": 16,
    "title": "Suits to be instituted where subject-matter situate",
    "description": "Subject to the pecuniary or other limitations prescribed by any law, suits\n\n(a) for the recovery of immovable property with or without rent or profits,\n\n(b) for the partition of immovable property,\n\n(c) for foreclosure, sale or redemption in the case of a mortgage of or charge upon immovable property,\n\n(d) or the determination of any other right to or interest in immovable property,\n\n(e) for compensation for wrong to immovable property,\n\n(f) for the recovery of movable property actually under distraint or attachment,\n\nshall be instituted in the Court within the local limits of whose jurisdiction the property is situate:\n\nProvided that a suit to obtain relief respecting, or compensation for wrong to, immovable property held by or on behalf of the defendant may, where the relief sought can be entirely obtained through his personal obedience, be instituted either in the Court within the local limits of whose jurisdiction the property is situate, or in the Court within the local limits of whose jurisdiction the defendant actually and voluntarily resides, or carries on business, or personally works for gain.\n\nExplanation.-- In this section \"property\" means property situate in 1[India]."
  },
  {
    "section": 17,
    "title": "Suits for immovable property situate within jurisdiction of different Courts",
    "description": "Where a suit is to obtain relief respecting, or compensation for wrong to, immovable property situate within the jurisdiction of different Courts. the suit may be instituted in any Court within the local limits of whose jurisdiction any portion of the property is situate :\n\nProvided that, in respect of the value of the subject-matter of the suit, the entire claim is cognizable by such Court."
  },
  {
    "section": 18,
    "title": "Place of institution of suit where local limits of jurisdiction of Courts are uncertain",
    "description": "(1) Where it is alleged to be uncertain within the local limits of the jurisdiction of which of two or more Courts any immovable property is situate, any one of those Courts may, if satisfied that there is ground for the alleged uncertainty, record a statement to that effect and thereupon proceed to entertain and dispose of any suit relating to that property, and its decree in the suit shall have the same effect as if the property were situate within the local limits of its jurisdiction:\n\nProvided that the suit is one with respect to which the Court is competent as regards the nature and value of the suit to exercise jurisdiction.\n\n(2) Where a statement has not been recorded under sub-section (1), and an objection is taken before an Appellate or Revisional Court that a decree or order in a suit relating to such property was made by a Court not having jurisdiction where the property is situate, the Appellate or Revisional Court shall not allow the objection unless in its opinion there was, at the time of the institution of the suit, no reasonable ground for uncertainty as to the court having jurisdiction with respect thereto and there has been a consequent failure of justice."
  },
  {
    "section": 19,
    "title": "Suits for compensation for wrongs to person or movables",
    "description": "Where a suit is for compensation for wrong done to the person or to movable property, if the wrong was done within the local limits of the jurisdiction of one Court and the defendant resides, or carries on business, or personally works for gain, within the local limits of the jurisdiction of another Court, the suit may be instituted at the option of the plaintiff in either of the said Courts.\n\nIllustrations\n\n(a) A, residing in Delhi, beats B in Calcutta. B may sue A either in Calcutta or in Delhi.\n\n(b) A, residing in Delhi, publishes in Calcutta statements defamatory of B. B may sue A either in Calcutta or in Delhi."
  },
  {
    "section": 20,
    "title": "Other suits to be instituted where defendants reside or cause of action arises",
    "description": "Subject to the limitations aforesaid, every suit shall be instituted in a Court within the local limits of whose jurisdiction\n\n(a) the defendant, or each of the defendants where there are more than one, at the time of the commencement of the suit, actually and voluntarily resides, or carries on business, or personally works for gain; or\n\n(b) any of the defendants, where there are more than one, at the time of the commencement of the suit, actually and voluntarily resides, or carries on business, or personally works for gain, provided that in such case either the leave of the Court is given, or the defendants who do not reside, or carry on business, or personally works for gain, as aforesaid, acquiesce in such institution; or\n\n(c)The cause of action, wholly or in part, arises.\n\n1**** *\n\n2[Explanation].-- A corporation shall be deemed to carry on business at its sole or principal office in 3 [India] or, in respect of any cause of action arising at any place where it has also a subordinate office, at such place.\n\nIllustrations\n\n(a) A is a tradesman in Calcutta, B carries on business in Delhi. B, by his agent in Calcutta, buys goods of A and requests A to deliver them to the East Indian Railway Company. A delivers the goods accordingly in Calcutta. A may sue B for the price of the goods either in Calcutta, where the cause of action has arisen, or in Delhi, where B carries on busines.\n\n(b) A resides at Simla, B at Calcutta and C at Delhi. A, B and C being together at Benaras, B and C make a joint promissory note payable on demand, and deliver it to A. A may sue B and C at Benaras, where the cause of action arose. He may also sue them at Calcutta, where B resides, or at Delhi, where C resides; but in each of these cases, if the non-resident defendant objects, the suit cannot proceed without the leave of the Court."
  },
  {
    "section": 21,
    "title": "Objections to jurisdiction",
    "description": "1[(1)] No objection as to the place of suing shall be allowed by any Appellate or Revisional Court unless such objection was taken in the Court of first instance at the earliest possible opportunity and in all cases where issues are settled at or before such settlement, and unless there has been a consequent failure of justice.\n\n2[(2) No objection as to the competence of a Court with reference to the pecuniary limits of its jurisdiction shall be allowed by any Appellate or Revisional Court unless such objection was taken in the Court of first instance at the earliest possible opportunity, and, in all cases where issues are settled, at or before such settlement, and unless there has been a consequent failure of justice.\n\n(3) No objection as to the competence of the executing Court with reference to the local limits of its jurisdiction shall be allowed by any Appellate or Revisional Court unless such objection was taken in the executing Court at the earliest possible opportunity, and unless there has been a consequent failure of justice.]"
  },
  {
    "section": "21A.",
    "title": "Baron suit to set aside decree on objection as to place of suing",
    "description": "1[21A. Bar on suit to set aside decree on objection as to place of suing.-- No suit shall lie challenging the validity of a decree passed in a former suit between the same parties, or between the parties under whom they or any of them claim, litigating under the same title, on any ground based on an objection as to the place of suing.\n\nExplanation.-- The expression former suit means a suit which has been decided prior to the decision in the suit in which the validity of the decree is questioned, whether or not the previously decided suit was instituted prior to the suit in which the validity of such decree is questioned.]"
  },
  {
    "section": 22,
    "title": "Power to transfer suits which may be instituted in more than one Court",
    "description": "Where a suit may be instituted in any one of two or more Courts and is instituted in one of such Courts, any defendant, after notice to the other parties, may, at the earliest possible opportunity and in all cases where issues are settled at or before such settlement, apply to have the suit transferred to another Court, and the Court to which such application is made, after considering the objections of the other parties (if any), shall determine in which of the several Courts having jurisdiction the suit shall proceed."
  },
  {
    "section": 23,
    "title": "To what Court application lies",
    "description": "(I) Where the several Courts having jurisdiction are subordinate to the same Appellate Court, an application under section 22 shall be made to the Appellate Court.\n\n(2) Where such Courts are subordinate to different Appellate Courts but to the same High Court, the application shall be made to the said High Court.\n\n(3) Where such Courts are subordinate to different High Courts, the application shall be made to the High Court within the local limits of whose jurisdiction the Court in which the suit is brought is situate."
  },
  {
    "section": 24,
    "title": "General power of transfer and withdrawal",
    "description": "(1) On the application of any of the parties and\nafter notice to the parties and after hearing such of them as desired to be heard, or of its own motion\nwithout such notice, the High Court or the District Court may at any stage\n\n(a) transfer any suit, appeal or other proceeding pending before it for trial or disposal to any\nCourt subordinate to it and competent to try or dispose of the same, or\n\n(b) withdraw any suit, appeal or other proceeding pending in any Court subordinate to it, and\n\n(i) try or dispose of the same; or\n\n(ii) transfer the same for trial or disposal to any Court subordinate to it and competent to\ntry or dispose of the same; or\n\n(iii) retransfer the same for trial or disposal to the Court from which it was withdrawn.\n\n(2) Where any suit or proceeding has been transferred or withdrawn under sub-section (1), the Court\nwhich 1[is thereafter to try or dispose of such suit or proceeding] may, subject to any special directions in the\ncase of an order of transfer, either retry it or proceed from the point at which it was transferred or\nwithdrawn.\n\n2[(3) For the purposes of this section,\n\n(a) Courts of Additional and Assistant Judges shall be deemed to be subordinate to the\nDistrict Court;\n\n(b) proceeding includes a proceeding for the execution of a decree or order].\n\n(4) The Court trying any suit transferred or withdrawn under this section from a Court of Small\nCauses shall, for the purposes of such suit, be deemed to be a Court of Small Causes.\n\n3[(5) A suit or proceeding may be transferred under this section from a Court which has no jurisdiction\nto try it.]"
  },
  {
    "section": 25,
    "title": "Power of Supreme Court to transfer suits, etc",
    "description": "1[25. Power of Supreme Court to transfer suits, etc.--(1) On the application of a party, and after notice to the parties, and after hearing such of them as desire to be heard, the Supreme Court may, at any stage, if satisfied that an order under this section is expedient for the ends of justice, direct that any suit, appeal or other proceeding be transferred from a High Court or other Civil Court in one State to a High Court or other Civil Court in another State.\n\n(2) Every application under this section shall be made by a motion which shall be supported by an affidavit.\n\n(3) The Court to which such suit, appeal or other proceeding is transferred shall, subject to any special directions in the order of transfer, either retry it or proceed from the stage at which it was transferred to it.\n\n(4) In dismissing any application under this section, the Supreme Court may, if it is of opinion that the application was frivolous or vexatious, order the applicant to pay by way of compensation to any person who has opposed the application such sum, not exceeding two thousand rupees, as it considers appropriate in the circumstances of the case.\n\n(5) The law applicable to any suit, appeal or other proceeding transferred under this section shall be the law which the Court in which the suit, appeal or other proceeding was originally instituted ought to have applied to such suit, appeal or proceeding.]"
  },
  {
    "section": 26,
    "title": "Institution of suits",
    "description": "1[(1)] Every suit shall be instituted by the presentation of a plaint or in such\nother manner as may be prescribed.\n\n2[(2) In every plaint, facts shall be proved by affidavit.]\n\n *[Provided that such an affidavit shall be in the form and manner as prescribed under Order VI of\nRule 15A.]"
  },
  {
    "section": 27,
    "title": "Summons to defendants",
    "description": "Where a suit has been duly instituted, a summons may be issued to\nthe defendant to appear and answer the claim and may be served in manner prescribed 1\n[on such day not\nbeyond thirty days from date of the institution of the suit.]"
  },
  {
    "section": 28,
    "title": "Service of summons where defendant resides in another State",
    "description": "(1) A summons may be sent for service in another State to such Court and in such manner as may be prescribed by rules in force in that State.\n\n(2) The Court to which such summons is sent shall, upon receipt thereof, proceed as if it had been issued by such Court and shall then return the summons to the Court of issue together with the record (if any) of its proceedings with regard thereto.\n\n1[(3) Where the language of the summons sent for service in another State is different from the language of the record referred to in sub-section (2), a translation of the record,—\n\n(a) in Hindi, where the language of the Court issuing the summons is Hindi, or\n\n(b) in Hindi or English where the language of such record is other than Hindi or English,\n\nshall also be sent together with the record sent under that sub-section.]"
  },
  {
    "section": 29,
    "title": "Service of foreign summonses",
    "description": "1[29. Service of foreign summonses.-- Summonses and other processes issued by\n\n\n(a) any Civil or Revenue Court established in any part of India to which the provisions of this\nCode do not extend, or\n\n\n(b) any Civil or Revenue Court established or continued by the authority of the Central\nGovernment outside India, or\n\n\n(c) any other Civil or Revenue Court outside India to which the Central Government has, by\nnotification in the Official Gazette, declared the provisions of this section to apply,\n\n\nmay be sent to the Courts in the territories to which this Code extends, and served as if they were\nsummonses issued by such Courts.]"
  },
  {
    "section": 30,
    "title": "Power to order discovery and the like",
    "description": "Subject to such conditions and limitations as may be\nprescribed, the Court may, at any time, either of its own motion or on the application of any party,—\n\n(a) make such orders as may be necessary or reasonable in all matters relating to the delivery and\nanswering of interrogatories, the admission of documents and facts, and the discovery, inspection,\nproduction, impounding and return of documents or other material objects producible as evidence;\n\n(b) issue summonses to persons whose attendance is required either to give evidence or to\nproduce documents or such other objects as aforesaid;\n\n(c) order any fact to be proved by affidavit."
  },
  {
    "section": 31,
    "title": "Summons to witness",
    "description": "The provisions in sections 27, 28 and 29 shall apply to summonses to give evidence or to produce documents or other material objects."
  },
  {
    "section": 32,
    "title": "Penalty for default",
    "description": "The Court may compel the attendance of any person to whom a summons\nhas been issued under section 30 and for that purpose may\n\n(a) issue a warrant for his arrest;\n\n(b) attach and sell his property; \n\n(c) impose a fine upon him 1\n[not exceeding five thousand rupees];\n\n(d) order him to furnish security for his appearance and in default commit him to the civil prison."
  },
  {
    "section": 33,
    "title": "Judgment and decree",
    "description": "The Court, after the case has been heard, shall pronounce judgment, and on such judgment a decree shall follow."
  },
  {
    "section": 34,
    "title": "Interest",
    "description": "(1) Where and in so far as a decree is for the payment of money, the Court may, in the decree, order interest at such rate as the Court deems reasonable to be paid on the principal sum adjudged, from the date of the suit to the date of the decree, in addition to any interest adjudged on such principal sum for any period prior to the institution of the suit, 1 [with further interest at such rate not exceeding six per cent. per annum as the Court deems reasonable on such principal sum], from the date of the decree to the date of payment, or to such earlier date as the Court thinks fit :\n\n2[Provided that where the liability in relation to the sum so adjudged had arisen out of a commercial transaction, the rate of such further interest may exceed six per cent. per annum, but shall not exceed the contractual rate of interest or where there is no contractual rate, the rate at which moneys are lent or advanced by nationalised banks in relation to commercial transactions.\n\nExplanation I.--In this Sub-section, \"nationalised bank\" means a corresponding new bank as defined in the Banking Companies (Acquisition and Transfer of Undertakings) Act, 1970 (5 of 1970).\n\nExplanation II.-- For the purposes of this section, a transaction is a commercial transaction, if it is connected with the industry, trade or business of the party incurring the liability.]\n\n(2) Where such a decree is silent with respect to the payment of further interest 3[on such principal sum] from the date of the decree to the date of payment or other earlier date, the Court shall be deemed to have refused such interest, and a separate suit therefor shall not lie."
  },
  {
    "section": 35,
    "title": "Costs",
    "description": "(1) Subject to such conditions and limitations as may be prescribed, and to the provisions of any\nlaw for the time being in force, the costs of an incident to all suits shall be in the discretion of the Court, and the\nCourt shall have full power to determine by whom or out of what property and to what extent such costs are to be\npaid, and to give all necessary directions for the purposes aforesaid. The fact that the Court has no jurisdiction to\ntry the suit shall be no bar to the exercise of such powers.\n\n(2) Where the Court directs that any costs shall not follow the event, the Court shall state its reasons in\nwriting.\n\n1* * * * * \n\n*[35. Costs.(1) In relation to any commercial dispute, the Court, notwithstanding anything contained in\nany other law for the time being in force or Rule, has the discretion to determine:\n\n\n(a) whether costs are payable by one party to another;\n\n\n(b) the quantum of those costs; and\n\n\n(c) when they are to be paid.\n\n\nExplanation.-- For the purpose of clause (a), the expression costs shall mean reasonable costs\nrelating to-- \n\n\n(i) the fees and expenses of the witnesses incurred;\n\n\n(ii) legal fees and expenses incurred;\n\n\n(iii) any other expenses incurred in connection with the proceedings.\n\n\n(2) If the Court decides to make an order for payment of costs, the general rule is that the unsuccessful\nparty shall be ordered to pay the costs of the successful party: \n\n\nProvided that the Court may make an order deviating from the general rule for reasons to be recorded in\nwriting.\n\n\nIllustration\n\n\nThe Plaintiff, in his suit, seeks a money decree for breach of contract, and damages. The Court holds that the\nPlaintiff is entitled to the money decree. However, it returns a finding that the claim for damages is frivolous and\nvexatious.\n\n\nIn such circumstances the Court may impose costs on the Plaintiff, despite the Plaintiff being the successful\nparty, for having raised frivolous claims for damages.\n\n\n(3) In making an order for the payment of costs, the Court shall have regard to the following circumstances,\nincluding--\n\n\n(a) the conduct of the parties;\n\n\n(b) whether a party has succeeded on part of its case, even if that party has not been wholly successful;\n\n\n(c) whether the party had made a frivolous counterclaim leading to delay in the disposal of the case;\n\n\n(d) whether any reasonable offer to settle is made by a party and unreasonably refused by the other party;\nand\n\n\n(e) whether the party had made a frivolous claim and instituted a vexatious proceeding wasting the time of\nthe Court.\n\n\n(4) The orders which the Court may make under this provision include an order that a party must pay--\n\n\n(a) a proportion of another partys costs;\n\n\n(b) a stated amount in respect of another partys costs;\n\n\n(c) costs from or until a certain date;\n\n\n(d) costs incurred before proceedings have begun;\n\n\n(e) costs relating to particular steps taken in the proceedings;\n\n\n(f) costs relating to a distinct part of the proceedings; and\n\n\n (g) interest on costs from or until a certain date.]\n\nSTATE AMENDMENTS\nJammu and Kashmir and Ladakh (UTs).--\n\n\nIn Section 35, in sub-section (1) omit \"Commercial\". \n[Vide the Jammu and Kashmir Reorganisation (Adaptation of Central Laws) Order, 2020, notification\nNo. S.O. 1123(E) dated (18-3-2020) and vide Union Territory of Ladakh Reorganisation (Adaptation of\nCentral Laws) Order, 2020, Notification No. S.O. 3774(E), dated (23-10-2020).]"
  },
  {
    "section": "35A.",
    "title": "Compensatory costs in respect of false or vexatious claims or defences",
    "description": "1[35A. Compensatory costs in respect of false or vexatious claims or defences.-- (1) If in any suit or other proceedings 2[including an execution proceeding but 3[excluding an appeal or a revision] any party objects to the claim or defence on the ground that the claim or defence or any part of it is, as against the objector, false or vexatious to the knowledge of the party by whom it has been put forward, and if thereafter, as against the objector, such claim or defence is disallowed, abandoned or withdrawn in whole or in part, the Court, 4[if it so thinks fit], may, after recording its reasons for holding such claim or defence to be false or vexatious, make an order for the payment to the object or by the party by whom such claim or defence has been put forward, of cost by way of compensation.\n\n*[(2) No Court shall make any such order for the payment of an amount exceeding 5[three thousand rupees] or exceeding the limits of its pecuniary jurisdiction, whichever amount is less:\n\nProvided that where the pecuniary limits of the jurisdiction of any Court excercising the jurisdiction of a Court of Small Causes under the Provincial Small Cause Courts Act, 1887 (9 of 1887), 6[or under a corresponding law in force in 7[any part of India to which the said Act does not extend]] and not being a Court constituted 8[under such Act or law], are less than two hundred and fifty rupees, the High Court may empower such Court to award as costs under this section any amount not exceeding two hundred and fifty rupees and not exceeding those limits by more than one hundred rupees :\n\nProvided, further, that the High Court may limit the amount which any Court or class of Courts is empowered to award as costs under this section.]\n\n(3) No person against whom an order has been made under this section shall, by reason thereof, be exempted from any criminal liability in respect of any claim or defence made by him.\n\n(4) The amount of any compensation awarded under this section in respect of a false or vexatious claim or defence shall be taken into account in any subsequent suit for damages or compensation in respect of such claim or defence.]\n\nSTATE AMENDMENTS\n\nJammu and Kashmir and Ladakh (UTs).--\n\nIn Section 35A, omit sub-section (2).\n\n[Vide the Jammu and Kashmir Reorganization (Adaptation of Central Laws) Order, 2020, notification No. S.O. 1123(E) dated (18-3-2020) and vide Union Territory of Ladakh Reorganisation (Adaptation of Central Laws) Order, 2020, Notification No. S.O. 3774(E), dated (23-10-2020).]"
  },
  {
    "section": "35B.",
    "title": "Costs for causing delay",
    "description": "1[35B. Costs for causing delay.-- (1) If, on any date fixed for the hearing of a suit or for taking any step therein, a party to the suit\n\n(a) fails to take the step which he was required by or under this Code to take on that date, or\n(b) obtains an adjournment for taking such step or for producing evidence or on any other ground, the Court may, for reasons to be recorded, make an order requiring such party to pay to the other party such costs as would, in the opinion of the Court, be reasonably sufficient to reimburse the other party in respect of the expenses incurred by him in attending the Court on that date, and payment of such costs, on the date next following the date of such order, shall be a condition precedent to the further prosecution of\n\n(a) the suit by the plaintiff, where the plaintiff was ordered to pay such costs,\n\n(b) the defence by the defendant, where the defendant was ordered to pay such costs.\n\nExplanation.-- Where separate defences have been raised by the defendant or groups of defendants, payment of such costs shall be a condition precedent to the further prosecution of the defence by such defendants or groups of defendants as have been ordered by the Court to pay such costs.\n\n(2) The costs, ordered to be paid under sub-section (1), shall not, if paid, be included in the costs awarded in the decree passed in the suit; but, if such costs are not paid, a separate order shall be drawn up indicating the amount of such costs and the names and addresses of the persons by whom such costs are payable and the order so drawn up shall be executable against such persons.]"
  },
  {
    "section": 36,
    "title": "Application to orders",
    "description": "1[36. Application to orders.-- The provisions of this Code relating to the execution of decrees (including provisions relating to payment under a decree) shall, so far as they are applicable, be deemed to apply to the execution of orders (including payment under an order).]"
  },
  {
    "section": 37,
    "title": "Definition of Court which passed a decree",
    "description": "The expression \"Court which passed a decree,\" or words to that effect, shall, in relation to the execution of decrees, unless there is anything repugnant in the subject or context, be deemed to include,\n\n(a) where the decree to be executed has been passed in the exercise of appellate jurisdiction, the Court of first instance, and\n\n(b) where the Court of first instance has ceased to exist or to have jurisdiction to execute it, the Court which, if the suit wherein the decree was passed was instituted at the time of making the application for the execution of the decree, would have jurisdiction to try such suit.\n\n1[Explanation.-- The Court of first instance does not cease to have jurisdiction to execute a decree merely on the ground that after the institution of the suit wherein the decree was passed or after the passing of the decree, any area has been transferred from the jurisdiction of that Court to the jurisdiction of any other Court; but, in every such case, such other Court shall also have jurisdiction to execute the decree, if at the time of making the application for execution of the decree it would have jurisdiction to try the said suit.]"
  },
  {
    "section": 38,
    "title": "Court by which decree may be executed",
    "description": "A decree may be executed either by the Court which passed it, or by the Court to which it is sent for execution."
  },
  {
    "section": 39,
    "title": "Transfer of decree",
    "description": "(1) The Court which passed a decree may, on the application of the decreeholder, send it for execution to another Court 1\n[of competent jurisdiction], \n\n(a) if the person against whom the decree is passed actually and voluntarily resides or carries on\nbusiness, or personally works for gain, within the local limits of the jurisdiction of such other Court, or\n\n(b) if such person has not property within the local limits of the jurisdiction of the Court which\npassed the decree sufficient to satisfy such decree and has property within the local limits of the\njurisdiction of such other Court, or\n\n(c) if the decree directs the sale or delivery of immovable property situate outside the local limits of\nthe jurisdiction of the Court which passed it, or\n\n(d) if the Court which passed the decree considers for any other reason, which it shall record in\nwriting, that the decree should be executed by such other Court.\n\n(2) The Court which passed a decree may of its own motion send it for execution to any subordinate\nCourt of competent jurisdiction.\n\n1[(3) For the purposes of this section, a Court shall be deemed to be a Court of competent jurisdiction if, at\nthe time of making the application for the transfer of decree to it, such Court would have jurisdiction to try the\nsuit in which such decree was passed.]\n\n2[(4) Nothing in this section shall be deemed to authorise the Court which passed a decree to execute\nsuch decree against any person or property outside the local limits of its jurisdiction.]"
  },
  {
    "section": 40,
    "title": "Transfer of decree to Court in another State",
    "description": "Where a decree is sent for execution in another State, it shall be sent to such Court and executed in such manner as may be prescribed by rules in force in that State."
  },
  {
    "section": 41,
    "title": "Result of execution proceedings to be certified",
    "description": "The Court to which a decree is sent for execution shall certify to the Court which passed it the fact of such execution, or where the former Court fails to execute the same the circumstances attending such failure."
  },
  {
    "section": 42,
    "title": "Powers of Court in executing transferred decree",
    "description": "1[(1)] The Court executing a decree sent to it shall\nhave the same powers in executing such decree as if it had been passed by itself. All persons is disobeying or\nobstructing the execution of the decree shall be punishable by such Court in the same manner as if it had passed\nthe decree. And its order in executing such decree shall be subject to the same rules in respect of appeal as\nif the decree had passed by itself.\n\n2[(2) Without prejudice to the generality of the provisions of sub-section (1), the powers of the Court\nunder that sub-section shall include the following powers of the Court which passed the decree, namely: --\n\n\n(a) power to send the decree for execution to another Court under section 39; \n\n(b) power to execute the decree against the legal representative of the deceased judgment-debtor\nunder section 50;\n\n(c) power to order attachment of a decree.\n\n(3) A Court passing an order in exercise of the powers specified in sub-section (2) shall send a copy\nthereof to the Court which passed the decree.\n\n(4) Nothing in this section shall be deemed to confer on the Court to which a decree is sent for\nexecution any of the following powers, namely:-- \n\n\n(a) power to order execution at the instance of the transferee of the decree ;\n\n(b) in the case of a decree passed against a firm, power to grant leave to execute such decree\nagainst any person, other than such a person as is referred to in clause (b),or clause (c), of sub-rule (1)\nof rule 50 of Order XXI.]"
  },
  {
    "section": 43,
    "title": "Execution of decrees passed by Civil Courts in places to which this Code does not extend",
    "description": "1[43. Execution of decrees passed by Civil Courts in places to which this Code does not extend.-- Any decree passed by any Civil Court established in any part of India to which the provisions of this Code do not extend, or by any Court established or continued by the authority of the Central Government outside India, may, if it cannot be executed within the jurisdiction of the Court by which it was passed, be executed in the manner herein provided within the jurisdiction of any Court in the territories to which this Code extends.]"
  },
  {
    "section": 44,
    "title": "Execution of decrees passed by Revenue Courts in places to which this Code does not extend",
    "description": "1[44. Execution of decrees passed by Revenue Courts in places to which this Code does not extend.-- The State Government may, by notification in the Official Gazette, declare that the decrees of any Revenue Court in any part of India to which the provisions of this Code do not extend, or any class of such decrees, may be executed in the State as if they had been passed by Courts in that State.]"
  },
  {
    "section": "44A.",
    "title": "Execution of decrees passed by Courts in reciprocating territory",
    "description": "1[44A. Execution of decrees passed by Courts in reciprocating territory.--(1) Where a certified\ncopy of a decree of any of the superior Courts of 2\n*** any reciprocating territory has been filed in a\nDistrict Court, the decree may be executed in 3\n[India] as if it had been passed by the District Court.\n\n(2) Together with the certified copy of the decree shall be filed a certificate from such superior Court\nstating the extent, if any, to which the decree has been satisfied or adjusted and such certificate shall, for the\npurposes of proceedings under this section, be conclusive proof of the extent of such satisfaction or\nadjustment.\n\n(3) The provisions of section 47 shall as from the filing of the certified copy of the decree apply to the\nproceedings of a District Court executing a decree under this section, and the District Court shall refuse\nexecution of any such decree, if it is shown to the satisfaction of the Court that the decree falls within any\nof the exceptions specified in clauses (a) to (f) of section 13.\n\n4[Explanation 1.-- \"Reciprocating territory\" means any country or territory outside India which the\nCentral Government may, by notification in the Official Gazette, declare to be a reciprocating territory for\nthe purposes of this section; and superior Courts, with reference to any such territory, means such\nCourts as may be specified in the said notification.\n\nExplanation 2.-- \"Decree\" with reference to a superior Court means any decree or judgment of such\nCourt under which a sum of money is payable, not being a sum payable in respect of taxes or other\ncharges of a like nature or in respect of a fine or other penalty, but shall in no case include an arbitration\naward, even if such an award is enforceable as a decree or judgment.]]"
  },
  {
    "section": 45,
    "title": "Execution of decrees outside India",
    "description": "1[45. Execution of decrees outside India.-- So much of the foregoing sections of this Part as empowers a Court to send a decree for execution to another Court shall be construed as empowering a Court in any State to send a decree for execution to any Court established 2 *** by the authority of the Central Government 3 [outside India] to which the State Government has by notification in the Official Gazette declared this section to apply.]"
  },
  {
    "section": 46,
    "title": "Precepts",
    "description": "(1) Upon the application of the decree-holder the Court which passed the decree may. whenever it thinks fit, issue a precept to any other Court which would be competent to execute such decree to attach any property belonging to the judgment-debtor and specified in the precept.\n\n(2) The Court to which a precept is sent shall proceed to attach the property in the manner prescribed in regard to the attachment of property in execution of a decree:\n\nProvided that no attachment under a precept shall continue for more than two months unless the period of attachment is extended by an order of the Court which passed the decree or unless before the determination of such attachment the decree has been transferred to the Court by which the attachment has been made and the decree-holder has applied for an order for the sale of such property."
  },
  {
    "section": 47,
    "title": "Questions to be determined by the Court executing decree",
    "description": "(1) All questions arising between the parties to the suit in which the decree was passed, or their representatives, and relating to the execution, discharge or satisfaction of the decree, shall be determined by the Court executing the decree and not by a separate suit.\n\n1* * * * *\n\n(3) Where a question arises as to whether any person is or is not the representative of a party, such question shall, for the purposes of this section, be determined by the Court.\n\n2[Explanation 1.-- For the purposes of this section, a plaintiff whose suit has been dismissed and a defendant against whom a suit has been dismissed are parties to the suit.\n\nExplanation II.-- (a) For the purposes of this section, a purchaser of property at a sale in execution of a decree shall be deemed to be a party to the suit in which the decree is passed; and\n\n(b) all questions relating to the delivery of possession of such property to such purchaser or his representative shall be deemed to be questions relating to the execution, discharge or satisfaction of the decree within the meaning of this section.]"
  },
  {
    "section": 48,
    "title": "[Repealed]",
    "description": "[Execution barred in certain cases.] Rep. by the Limitation Act, 1963 (36 of 1963), s. 28 (w.e.f.1-1- 1964)."
  },
  {
    "section": 49,
    "title": "Transferee",
    "description": "Every transferee of a decree shall hold the same subject to the equities (if any) which the judgment-debtor might have enforced against the original decree-holder."
  },
  {
    "section": 50,
    "title": "Legal representative",
    "description": "(1) Where a judgment-debtor dies before the decree has been fully satisfied,\nthe holder of the decree may apply to the Court which passed it to execute the same against the legal\nrepresentative of the deceased.\n\n(2) Where the decree is executed against such legal representative, he shall be liable only to the extent of\nthe property of the deceased which has come to his hands and has not been duly disposed of; and, for the\npurpose of ascertaining such liability, the Court executing the decree may, of its own motion or on the\napplication of the decree-holder, compel such legal representative to produce such accounts as it thinks\nfit."
  },
  {
    "section": 51,
    "title": "Powers of Court to enforce execution",
    "description": "Subject to such conditions and limitations as may be prescribed, the Court may, on the application of the decree-holder, order execution of the decree\n\n(a) by delivery of any property specifically decreed;\n\n(b) by attachment and sale or by the sale without attachment of any property;\n\n(c) by arrest and detention in prison 1[for such period not exceeding the period specified in section 58, where arrest and detention is permissible under that section];\n\n(d) by appointing a receiver; or\n\n(e) in such other manner as the nature of the relief granted may require :\n\n2[Provided that, where the decree is for the payment of money, execution by detention in prison shall not be ordered unless, after giving the judgment-debtor an opportunity of showing cause why he should not be committed to prison, the Court, for reasons recorded in writing, is satisfied--\n\n(a) that the judgment-debtor, with the object or effect of obstructing or delaying the execution of the decree,--\n\n(i) is likely to abscond or leave the local limits of the jurisdiction of the Court, or\n\n(ii) has, after the institution of the suit in which the decree was passed, dishonestly transferred, concealed, or removed any part of his property, or committed any other act of bad faith in relation to his property, or\n\n(b) that the judgment-debtor has, or has had since the date of the decree. the means to pay the amount of the decree or some substantial part thereof and refuses or neglects or has refused or neglected to pay the same, or\n\n(c) that the decree is for a sum for which the judgment-debtor was bound in a fiduciary capacity to account.\n\nExplanation. In the calculation of the means of the judgment-debtor for the purposes of clause (b), there shall be left out of account any property which, by or under any law or custom having the force of law for the time being in force, is exempt from attachment in execution of the decree.]"
  },
  {
    "section": 52,
    "title": "Enforcement of decree against legal representative",
    "description": "(1) Where a decree is passed against a party as the legal representative of a deceased person, and the decree is for the payment of money out of the property of the deceased, it may be executed by the attachment and sale of any such property.\n\n(2) Where no such property remains in the possession of the judgment-debtor and he fails to satisfy the Court that he has duly applied such property of the deceased as is proved to have come into his possession, the decree may be executed against the judgment-debtor to the extent of the property in respect of which he has failed so to satisfy the Court in the same manner as if the decree had been against him personally."
  },
  {
    "section": 53,
    "title": "Liability of ancestral property",
    "description": "For the purposes of section 50 and section 52, property in the hands of a son or other descendant which is liable under Hindu law for the payment of the debt of a deceased ancestor, in respect of which a decree has been passed, shall be deemed to be property of the deceased which has come to the hands of the son or other descendant as his legal representative."
  },
  {
    "section": 54,
    "title": "Partition of estate or separation of share",
    "description": "Where the decree is for the partition of an undivided estate assessed to the payment of revenue to the Government, or for the separate possession of a share of such an estate, the partition of the estate or the separation of the share shall be made by the Collector or any gazetted subordinate of the Collector deputed by him in this behalf, in accordance with the law (if any) for the time being in force relating to the partition, or the separate possession of shares, of such estates.\n\nSTATE AMENDMENTS\n\nKarnataka.--\n\nFor Section 54, the following Section shall be substituted, namely.--\n\n\"54. Partition of estate or separation of share.--Where the decree is for the partition of an undivided estate assessed to the payment of revenue to the Government, or for the separate possession of a share of such an estate, the partition of the estate or the separation of the share of such an estate shall be made by the Court in accordance with the law if any, for the time being in force relating to the partition or the separate possession of shares, and if necessary on the report of a revenue officer, not below the rank of Tahsildar or such other person as the Court may appoint as Commissioner in that behalf.\"\n\n[Vide Karnataka Act 36 of 1998, sec. 2.]"
  },
  {
    "section": 55,
    "title": "Arrest and detention",
    "description": "(1) A judgment-debtor may be arrested in execution of a decree at, any hour and on any day, and shall, as soon as practicable, be brought before the Court, and his detention may be in the civil prison of the district in which the Court ordering the detention is situate, or, where such civil prison does not afford suitable accommodation, in any other place which the State Government may appoint for the detention of persons ordered by the Courts of such district to be detained:\n\nProvided, firstly that, for the purpose of making an arrest under this section, no dwelling-house shall be entered after sunset and before sunrise:\n\nProvided, secondly, that no outer door of a dwelling-house shall be broken open unless such dwellinghouse is in the occupancy of the judgment-debtor and he refuses or in any way prevents access thereto, but when the officer authorized to make the arrest has duly gained access to any dwelling-house, he may break open the door of any room in which he has reason to believe the judgment-debtor is to be found:\n\nProvided, thirdly that, if the room is in the actual occupancy of a woman who is not the judgment-debtor and who according to the customs of the country does not appear in public, the officer authorized to make the arrest shall give notice to her that she is at liberty to withdraw, and, after allowing a reasonable time for her to withdraw and giving her reasonable facility for withdrawing, may enter the room for the purpose of making the arrest:\n\nProvided, fourthly, that, where the decree in execution of which a judgment-debtor is arrested, is a decree for the payment of money and the judgment-debtor pays the amount of the decree and the costs of the arrest to the officer arresting him, such officer shall at once release him.\n\n(2) The State Government may, by notification in the Official Gazette, declare that any person or class of persons whose arrest might be attended with danger or inconvenience to the public shall not be liable to arrest in execution of a decree otherwise than in accordance with such procedure as may be prescribed by the State Government in this behalf.\n\n(3) Where a judgment-debtor is arrested in execution of a decree for the payment of money and brought before the Court, the Court shall inform him that he may apply to be declared an insolvent, and that he 1 [may be discharged] if he has not committed any act of bad faith regarding the subject of the application and if he complies with the provisions of the law of insolvency for the time being in force.\n\n(4) Where a judgment-debtor expresses his intention to apply to be declared an insolvent and furnishes security, to the satisfaction of the Court, that he will within one month so apply, and that he will appear, when called upon, in any proceeding upon the application or upon the decree in execution of which he was arrested, the Court 2 [may release] him from arrest, and, if he fails so to apply and to appear, the Court may either direct the security to be realized or commit him to the civil prison in execution of the decree."
  },
  {
    "section": 56,
    "title": "Prohibition of arrest or detention of women in execution of decree for money",
    "description": "Notwithstanding anything in this Part, the Court shall not order the arrest or detention in the civil prison of a woman in execution of a decree for the payment of money."
  },
  {
    "section": 57,
    "title": "Subsistence-allowance",
    "description": "The State Government may fix scales, graduated according to rank, race and nationality, of monthly allowances payable for the subsistence of judgment-debtors."
  },
  {
    "section": 58,
    "title": "Detention and release",
    "description": "(1) Every person detained in the civil prison in execution of a decree shall be so detained,\n\n(a) where the decree is for the payment of a sum of money exceeding 1 [2 [five thousand rupees], for a period not exceeding three months, and,]\n\n3[(b) where the decree is for the payment of a sum of money exceeding two thousand rupees, but not exceeding five thousand rupees, for a period not exceeding six weeks.]\n\n4(1A) For the removal of doubts, it is hereby declared that no order for detention of the judgmentdebtor in civil prison in execution of a decree for the payment of money shall be made, where the total amount of the decree does not exceed 5 [two thousand rupees.]\n\n(2) A judgment-debtor released from detention under this section shall not merely by reason of his release be discharged from his debt, but he shall not be liable to be re-arrested under the decree in execution of which he was detained in the civil prison."
  },
  {
    "section": 59,
    "title": "Release on ground of illness",
    "description": "(1) At any time after a warrant for the arrest of a judgment-debtor has been issued the Court may cancel it on the ground of his serious illness.\n\n(2) Where a judgment-debtor has been arrested, the Court may release him if, in its opinion, he is not in a fit state of health to be detained in the civil prison.\n\n(3) Where a judgment-debtor has been committed to the civil prison, he may be released therefrom--\n\n(a) by the State Government, on the ground of the existence of any infectious or contagious disease, or\n\n(b) by the committing Court, or any Court to which that Court is subordinate, on the ground of his suffering from any serious illness.\n\n(4) A judgment-debtor released under this section may be re-arrested, but the period of his detention in civil prison shall not in the aggregate exceed that prescribed by section 58."
  },
  {
    "section": 60,
    "title": "Property liable to attachment and sale in execution of decree",
    "description": "1(1) The following property is liable to attachment and sale in execution of a decree, namely, lands, houses or other buildings, goods, money, bank-notes, cheques, bills of exchange, hundis, promissory notes, Government securities, bonds or other securities for money, debts, shares in a corporation and, save as hereinafter mentioned, all other saleable property, movable or immovable, belonging to the judgment-debtor, or over which, or the profits of which, he has a disposing power which he may exercise for his own benefit, whether the same be held in the name of the judgment-debtor or by another person in trust for him or on his behalf:\n\nProvided that the following particulars shall not be liable to such attachment or sale, namely:\n\n(a) the necessary wearing-apparel, cooking vessels, beds and bedding of the judgment-debtor, his wife and children, and such personal ornaments as, in accordance with religious usage, cannot be parted with by any woman;\n\n(b) tools of artisans, and, where the judgment-debtor is an agriculturist, his implements of husbandry and such cattle and seed-grain as may, in the opinion of the Court, be necessary to enable him to earn his livelihood as such, and such portion of agricultural produce or of any class of agricultural produce as may have been declared to be free from liability under the provisions of the next following section;\n\n(c) houses and other buildings (with the materials and the sites thereof and the land immediately appurtenant thereto and necessary for their enjoyment) belonging to 2 [an agriculturist or a labourer of a domestic servant] and occupied by him ;\n\n(d) books of account ;\n\n(e) a mere right to sue for damages ;\n\n(f) any right of personal service ;\n\n(g) stipends and gratuities allowed to pensioners of the Government 3 [or of a local authority or of any other employer], or payable out of any service family pension fund 4 notified in the Official Gazette by 5 [the Central Government or the State Government] in this behalf, and political pensions;\n\n6 [(h) the wages of labourers and domestic servants, whether payable in money or in kind;\n\n7 ***\n\n8 [(i) salary to the extent of 9 [the first 10 [one thousand rupees] and two third of the remainder] 11[in execution of any decree other than a decree for maintenance]:\n\n12[Provided that where any part of such portion of the salary as is liable to attachment has been under attachment, whether continuously or intermittently, for a total period of twenty-four months, such portion shall be exempt from attachment until the expiry of a further period of twelve months, and, where such attachment has been made in execution of one and the same decree, shall, after the attachment has continued for a total period of twenty-four months, be finally exempt from attachment in execution of that deeree.]]\n\n13[(ia) one-third of the salary in execution of any decree for maintenance;]\n\n13[(j) the pay and allowances of persons to whom the Air Force Act, 1950 (45 of 1950) or the Army Act, 1950 (46 of 1950), or the Navy Act, 1957 (62 of 1957), applies;]\n\n(k) all compulsory deposits and other sums in or derived from any fund to which the Provident Funds Act, 14[1925], (19 of 1925), for the time being applies in so far as they are declared by the said Act not to be liable to attachment;\n\n9[(ka) all deposits and other sums in or derived from any fund to which the Public Provident Fund Act, 1968 (23 of 1968), for the time being applies, in so far as they are declared by the said Act as not to be liable to attachment;\n\n(kb) all moneys payable under a policy of insurance on the life of the judgment debtor;\n\n(kc) the interest of a lessee of a residential of building to which the provisions of law for the time being in force relating to control of rents and accommodation apply;]\n\n15 [(1) any allowance forming part of the emoluments of any 16 [servant of the 17 [Government]] or of any servant of a railway company or local authority which the 18 [appropriate Government] may by notification in the Official Gazette declare to be exempt from attachment, and any subsistence grant or allowance made to 19 [any such servant] while under suspension;]\n\n(m) an expectancy of succession by survivorship or other merely contingent or possible right or interest;\n\n(n) a right to future maintenance;\n\n(o) any allowance declared by 20 [any Indian law] to be exempt from liability to attachment or sale in execution of a decree, and\n\n(p) where the judgment-debtor is a person liable for the payment of land-revenue, any movable property which, under any law for the time being applicable to him, is exempt from .sale for the recovery of an arrear of such revenue.\n\n21 [Explanation 1. The moneys payable in relation to the matters mentioned in clauses (g), (h), (i), (ia), (j), (l) and (o) are exempt from attachment or sale, whether before or after they are actually payable, and, in the case of salary, the attachable portion thereof is liable to attachment whether before or after it is actually payable.]\n\n22 [ 23 [Explanation II-- In clauses (i) and (ia)], \"salary\" means the total monthly emoluments, excluding any allowance declared exempt from attachment under the provisions of clause (1), derived by a person from his employment whether on duty or on leave.]\n\n24[Explanation 25[III] -- In clause (1) appropriate Government means--\n\n(i) as respects any 26[person] in the service of the Central Government, or any servant of 27[a Railway Administration] or of a cantonment authority or of the port authority of a major port, the Central Government;\n\n28* * * * *\n\n(iii) as respects any other 18 [servant of the 16 [Government]] or a servant of any other 29*** local authority, the State Government.]\n\n29[Explanation IV.-- For the purposes of this proviso, \" wages\" includes bonus, and \"abourer\" includes a skilled unskilled or semi-skilled labourer.\n\nExplanation V .-- For the purposes of this proviso, the expression agriculturist means a person who cultivates land personally and who depends for his livelihood mainly on the income from agricultural land, whether as owner, tenant, partner or agricultural labourer.\n\n30Explanation VI.-- For the purposes of Explanation V an agriculturist shall be deemded to cultivate land-personally, if he cultivates land\n\n(a) by his own labour, or\n\n(b) by the labour of any member of his family, or\n\n(c) by servants or labourers on wages payable in cash or in kind (not being as a share of the produce), or both.]\n\n29[(IA) Notwithstanding anything contained in any other law for the time being in force, an agreement by which a person agrees to waive the benefit of any exemption under this section shall be void.]\n\n(2) Nothing in this section shall be deemed 31 *** to exempt houses and other buildings (with the materials and the sites thereof and the lands immediately appurtenant thereto and necessary for their enjoyment) from attachment or sale in execution of decrees for rent of any such house, building, site or land 31***\n\n32* * * * *\n\nSTATE AMENDMENTS\n\nKerala.---\n\nIn clause (g) of the Proviso to sub-section (1) of section 60, after the words stipends and gratuities allowed by pensioners of the Government the words or of a local authority shall be inserted.\n\n[Vide Kerala Act 13 of 1957, sec. 3.]\n\nIn the proviso to sub section (1) of section 60 of the Code of Civil Procedure, 1908 (Central Act 5 of 1908), after clause (g), the following clause shall be inserted, namely: --\n\n\"(gg) all moneys payable to the beneficiaries under the Family Benefit Scheme for the employees of the Government of Kerala.\"\n\n[Vide Kerala Act 1 of 1988, sec. 2.]\n\nSTATE AMENDMENTS\n\nHimachal Pradesh.--\n\nAmendment in section 60. -- (1) In Section 60 sub-section (1):\n\n(i) at the end of clause (c), add the following:\n\nor compensation paid for such houses and buildings (including compensation for the materials and the sites and the land referred to above) acquired for a public purpose;\n\n(ii) after clause (c), the following clause shall be inserted, namely: --\n\n(cc) compensation paid for agricultural lands belonging to agriculturists and acquired for a public purpose;\n\n[Vide Himachal Pradesh Act 6 of 1956, sec. 2.]\n\nTamil Nadu\n\nAmendment of section 60, Central Act V of 1908.--In clause (g) of the proviso to sub-section (1) of section 60 of the Code of Civil Procedure, 1908, after the words \"stipends and gratuities allowed to pensioners of the Government\", the words \"or of a authority\" shall be inserted.\n\n[Vide Tamil Nadu Act XXXIV of 1950, s. 2]"
  },
  {
    "section": 61,
    "title": "Partial exemption of agricultural produce",
    "description": "The State Government 1\n*** may, by general or\nspecial order published in the Official Gazette, declare that such portion of agricultural produce, or of any\nclass of agricultural produce, as may appear to the State Government to be necessary for the purpose of\nproviding until the next harvest for the due cultivation of the land and for the support of the judgmentdebtor and his family, shall, in the case of all agriculturists or of any class of agriculturists, be exempted\nfrom liability to attachment or sale in execution of a decree."
  },
  {
    "section": 62,
    "title": "Seizure of property in dwelling-house",
    "description": "(I) No person executing any process under this Code directing or authorizing seizure of movable property shall enter any dwelling-house after sunset and before sunrise.\n\n(2) No outer door of a dwelling-house shall be broken open unless such dwelling-house is in the occupancy of the judgment-debtor and he refuses or in any way prevents access thereto, but when the person executing any such process has duly gained access to any dwelling-house, he may break open the door of any room in which he has reason to believe any such property to be.\n\n(3) Where a room in a dwelling-house is in the actual occupancy of a woman who, according to the customs of the country, does not appear in public, the person executing the process shall give notice to such woman that she is at liberty to withdraw; and, after allowing reasonable time for her to withdraw and giving her reasonable facility for withdrawing, he may enter such room for the purpose of seizing the property, using at the same time every precaution, consistent with these provisions, to prevent its clandestine removal."
  },
  {
    "section": 63,
    "title": "Property attached in execution of decrees of several Courts",
    "description": "(1) Where property not in the custody of any Court is under attachment in execution of decrees of more Courts than one, the Court which shall receive or realize such property and shall determine any claim thereto and any objection to the attachment thereof shall be the Court of highest grade, or, where there is no difference in grade between such Courts, the Court under whose decree the property was first attached.\n\n(2) Nothing in this section shall be deemed to invalidate any proceeding taken by a Court executing one of such decrees.\n\n1[Explanation.-- For the purposes of sub-section (2), \"proceeding taken by a Court\" does not include an order allowing, to a decree-holder who has purchased property at a sale held in execution of a decree, set off to the extent of the purchase price payable by him.]"
  },
  {
    "section": 64,
    "title": "Private alienation of property after attachment to be void",
    "description": "1[(1)] Where an attachment has been made, any private transfer or delivery of the property attached or of any interest therein and any payment to the judgment-debtor of any debt, dividend or other monies contrary to such attachment, shall be void as against all claims enforceable under the attachment.\n\n2[(2) Nothing in this section shall apply to any private transfer or delivery of the property attached or of any interest therein, made in pursuance of any contract for such transfer or delivery entered into and registered before the attachment.]\n\nExplanation.For the purpose of this section, claims enforceable under an attachment include claims for the rateable distribution of assets."
  },
  {
    "section": 65,
    "title": "Purchaser's title",
    "description": "Where immovable property is sold in execution of a decree and such sale has become absolute, the property shall be deemed to have vested in the purchaser from the time when the property is sold and not from the time when the sale becomes absolute."
  },
  {
    "section": 66,
    "title": "[Repealed]",
    "description": "[Suit against purchaser not maintainable on ground of purchase being on behalf of plaintiff.]--Rep. by Act, 1988\n(45 of 1988) , s. 7 (w.e.f. 19-5-1988)."
  },
  {
    "section": 67,
    "title": "Power for State Government to make rules as to sales of land in execution of decrees for payment of money",
    "description": "1[(1)] The State Government 2 *** may, by notification in the Official Gazette, make rules for any local area imposing conditions in respect of the sale of any class of interests in land in execution of decrees for the payment of money, where such interest are so uncertain or undetermined as, in the opinion of the State Government, to make it impossible to fix their value.\n\n3[(2) When on the date on which this Code came into operation in any local area, any special rules as to sale of land in execution of decrees were in force therein, the State Government may, by notification in the Official Gazette declare such rules to be in force, or may 2 *** by a like notification, modify the same.\n\nEvery notification issued in the exercise of the powers conferred by this sub-section shall set out the rules so continued or modified.]\n\n4[(3) Every rule made under this section shall be laid, as soon as may be after it is made, before the State Legislature.]"
  },
  {
    "section": 68,
    "title": "[Repealed]",
    "description": "[Power to prescribe rules for transferring to collector execution of certain decrees.] — Rep. by the Code of Civil Procedure (Amendment) Act, 1956 (66 of 1956), s. 7."
  },
  {
    "section": 69,
    "title": "[Repealed]",
    "description": "[Provisions of Third Schedule to apply.]— Rep. by s. 7 ibid. @/@"
  },
  {
    "section": 70,
    "title": "[Repealed]",
    "description": "[Rules of Procedure.] — Rep. by s. 7 ibid."
  },
  {
    "section": 71,
    "title": "[Repealed]",
    "description": "[Jurisdiction of Civil Courts barred.]— Rep. by s. 7 ibid."
  },
  {
    "section": 72,
    "title": "[Repealed]",
    "description": "[Collector to deemed to be acting judicially.] — Rep. by s. 7 ibid."
  },
  {
    "section": 73,
    "title": "Proceeds of execution sale to be rateably distributed among decree-holders",
    "description": "(1) Where assets are held by a Court and more persons than one have, before the receipt of such assets, made application to the Court for the execution of decrees for the payment of money passed against the same judgment-debtor and have not obtained satisfaction thereof, the assets, after deducting the costs of realization, shall be rateably distributed among all such persons :\n\nProvided as follows:—\n\n(a) where any property is sold subject to a mortgage or charge, the mortgage or incumbrancer shall not be entitled to share in any surplus arising from such sale;\n\n(b) where any property liable to be sold in execution of a decree is subject to a mortgage or charge, the Court may, with the consent of the mortgagee or incumbrancer, order that the property be sold free from the mortgage or charge, giving to the mortgagee or incumbrancer the same interest in the proceeds of the sale as he had in the property sold;\n\n(c) where any immovable property is sold in execution of a decree ordering its sale for the discharge of an in cumbrance thereon, the proceeds of sale shall be applied—\n\nFirst, in defraying the expenses of the sale;\n\nSecondly, in discharging the amount due under the decree;\n\nthirdly, in discharging the interest and principal monies due on subsequent incumbrances (if any); and\n\nfourthly, rateably among the holders of decrees for the payment of money against the judgement-debtor, who have, prior to the sale of the property, applied to the Court which passed the decree ordering such sale for execution of such decrees, and have no obtained satisfaction thereof.\n\n(2) Where all or any of the assets liable to be rateably distributed under this section are paid to a person not entitled to receive the same, any person so entitled may sue such person to compel him to refund the assets.\n\n(3) Nothing in this section affects any right of the Government."
  },
  {
    "section": 74,
    "title": "Resistance to execution",
    "description": "Where the Court is satisfied that the holder of a decree for the possession of immovable property or that the purchaser of immovable property sold in execution of a decree has been resisted or obstructed in obtaining possession of the property by the judgment-debtor or some person on his behalf and that such resistance or obstruction was without any just cause, the Court may, at the instance of the decree-holder or purchaser, order the judgment-debtor or such other person to be detained in the civil prison for a term which may extend to thirty days and may further direct that the decree-holder or purchaser be put into possession of the property."
  },
  {
    "section": 75,
    "title": "Power of Court to issue commissions",
    "description": "Subject to such conditions and limitations as may be prescribed, the Court may issue a commission\n\n(a) to examine any person;\n\n(b) to make a local investigation;\n\n(c) to examine or adjust accounts; or\n\n(d) to make a partition;\n\n1[(e) to hold a scientific, technical, or expert investigation;\n\n(f) to conduct sale of property which is subject to speedy and natural decay and which is in the custody of the Court pending the determination of the suit;\n\n(g) to perform any ministerial act.]"
  },
  {
    "section": 76,
    "title": "Commission to another Court",
    "description": "(1) A commission for the examination of any person may be issued to any Court (not being a High Court) situate in a State other than the State in which the Court of issue is situate and having jurisdiction in the place in which the person to be examined resides.\n\n(2) Every Court receiving a commission for the examination of any person under sub-section (1) shall examine him or cause him to be examined pursuant thereto, and the commission, when it has been duly executed, shall be returned together with the evidence taken under it to the Court from which it was issued, unless the order for issuing the commission has otherwise directed, in which case the commission shall be returned in terms of such order."
  },
  {
    "section": 77,
    "title": "Letter of request",
    "description": "In lieu of issuing a commission the Court may issue a letter of request to\nexamine a witness residing at any place not within 1\n[India]"
  },
  {
    "section": 78,
    "title": "Commissions issued by foreign Courts",
    "description": "1[78. Commissions issued by foreign Courts.-- Subject to such conditions and limitations as may be prescribed the provisions as to the execution and return of commissions for the examination of witnesses shall apply to commissions issued by or at the instance of\n\n(a) Courts situate in any part of India to which the provisions of this Code do not extend; or\n\n(b) Courts established or continued by the authority of the Central Government outside India; or\n\n(c) Courts of any State or country outside India.]"
  },
  {
    "section": 79,
    "title": "Suits by or against Government",
    "description": "1[79. Suits by or against Government.--In a suit by or against the Government, the authority to be named as plaintiff or defendant, as the case may be, shall be\n\n(a) in the case of a suit by or against the Central Government, 2[the Union of India], and\n\n(b) in the case of a suit by or against a State Government, the State.]"
  },
  {
    "section": 80,
    "title": "Notice",
    "description": "1 [(1)] 2 [ Save as otherwise provided in sub-section (2), no suits 3 [shall be instituted] against the Government (including the Government of the State of Jammu and Kashmir)] or against a public officer in respect of any act purporting to be done by such public officer in his official capacity, until the expiration of two months next after notice in writing has been 4 [delivered to, or left at the office of]\n\n(a) in the case of a suit against the Central Government, 5 [except where it relates to a railway] a Secretary to that Government;\n\n6[(b)] in the case of a suit against the Central Government where it relates to railway, the General Manager of that railway;\n\n7[(bb) in the case of a suit against the Government of the State of Jammu and Kashmir, the Chief Secretary to that Government or any other officer authorized by that Government in this behalf;]\n\n(c) in the case of a suit against 8[any other State Government], a Secretary to that Government or the Collector of the district; 9***\n\n10* * * * *\n\nand, in the case of a public officer, delivered to him or left at his office, stating the cause of action, the name, description and place of residence of the plaintiff and the relief which he claims; and the plaint shall contain a statement that such notice has been so delivered or left.\n\n11[(2) A suit to obtain an urgent or immediate relief against the Government (including the Government of the State of Jammu and Kashmir) or any public officer in respect of any act purporting to be done by such public officer in his official capacity, may be instituted, with the leave of the Court, without serving any notice as required by sub-section (I); but the Court shall not grant relief in the suit, whether interim or otherwise, except after giving to the Government or public officer, as the case may be , a reasonable opportunity of showing cause in respect of the relief prayed for in the suit:\n\nProvided that the Court shall, if it is satisfied, after hearing the parties, that no urgent or immediate relief need be granted in the suit, return the plaint for presentation to it after complying with the requirements of sub-section (1).\n\n(3) No suit instituted against the Government or against a public officer in respect of any act purporting to be done by such public officer in his official capacity shall be dismissed merely by reason of any error or defect in the notice referred to in sub-section (I), if in such notice\n\n(a) the name, description and the residence of the plaintiff had been so given as to enable the appropriate authority or the public officer to identify the person serving the notice and such notice had been delivered or left at the office of the appropriate authority specified in sub-section (1), and\n\n(b) the cause of action and the relief claimed by the plaintiff had been substantially indicated.]"
  },
  {
    "section": 81,
    "title": "Exemption from arrest and personal appearance",
    "description": "In a suit instituted against a public officer in respect of any act purporting to be done by him in his official capacity—\n\n(a) the defendant shall not be liable to arrest nor his property to attachment otherwise than in execution of a decree, and,\n\n(b) where the Court is satisfied that the defendant cannot absent himself from his duty without detriment to the public service, it shall exempt him from appearing in person.."
  },
  {
    "section": 82,
    "title": "Execution of decree",
    "description": "1[(I) Where, in a suit by or against the Government or by or against a public officer in respect of any act purporting to be done by him in his official capacity, a decree is passed against the Union of India or a State or, as the case may be, the public officer, such decree shall not be executed except in accordance with the provisions of sub-section (2).]\n\n(2) Execution shall not be issued on any such decree unless it remains unsatisfied for the period of three months computed from the date of 2 [such decree.]\n\n3[(3) The provisions of sub-sections (1) and (2) shall apply in relation to an order or award as they apply in relation to a decree, if the order or award —\n\n(a) is passed or made against 4 [the Union of India or a State or a public officer in respect of any such act as aforesaid, whether by a Court or by any other authority; and\n\n(b) is capable of being executed under the provisions of this Code or of any other law for the time being in force as if it were a decree.]"
  },
  {
    "section": 83,
    "title": "When aliens may sue",
    "description": "1Alien enemies residing in India with the permission of the Central Government, and alien friends, may sue in any Court otherwise competent to try the suit, as if they were citizens of India, but alien enemies residing in India without such permission, or residing in a foreign country, shall not sue in any such Court.\n\nExplanation.-- Every person residing in a foreign country, the Government of which is at war with India and carrying on business in that country without a licence in that behalf granted by the Central Government, shall, for the purpose of this section, be deemed to be an alien enemy residing in a foreign country."
  },
  {
    "section": 84,
    "title": "When foreign States may sue",
    "description": "A foreign State may sue in any competent Court:\n\nProvided that the object of the suit is to enforce a private right vested in the Ruler of such State or in any officer of such State in his public capacity."
  },
  {
    "section": 85,
    "title": "Persons specially appointed by Government to prosecute or defend on behalf of foreign Rulers",
    "description": "(1) The Central Government may, at the request of the Ruler of a foreign State or at the request of any person competent in the opinion of the Central Government to act on behalf of such Ruler, by order, appoint any persons to prosecute or defend any suit on behalf of such Ruler, and any persons so appointed shall be deemed to be the recognized agents by whom appearances, acts and applications under this Code may be made or done on behalf of such Ruler.\n\n(2) An appointment under this section may be made for the purpose of a specified suit or of several specified suits, or for the purpose of all such suits as it may from time to time be necessary to prosecute or defend on behalf of such Ruler.\n\n(3) A person appointed under this section may authorize or appoint any other persons to make appearances and applications and do acts in any such suit or suits as if he were himself a party thereto."
  },
  {
    "section": 86,
    "title": "Suits against foreign Rulers, Ambassadors and Envoys",
    "description": "(I) No. 1 *** foreign State may be sued in any Court otherwise competent to try the suit except with the consent of the Central Government certified in writing by a Secretary to that Government :\n\nProvided that a person may, as a tenant of immovable property, sue without such consent as aforesaid 2[a foreign State] from whom he holds or claims to hold the property.\n\n(2) Such consent may be given with respect to a specified suit or to several specified suits or with respect to all suits of any specified class or classes, and may specify, in the case of any suit or class of suits, the Court in which 3 [the foreign State] may be sued, but it shall not be given, unless it appears to the Central Government that 3 [the foreign State ]\n\n(a) has instituted a suit in the Court against the person desiring to sue 4 [it], or\n\n(b) by 5 [itself] or another, trades within the local limits of the jurisdiction of the Court, or\n\n(c) is in possession of immovable property situate within those limits and is to be sued with reference to such property or for money charged thereon, or\n\n(d) has expressly or impliedly waived the privilege accorded to 4 [it] by this section.\n\n6[(3) Except with the consent of the Central Government, certified in writing by a Secretary to that Government, no decree shall be executed against the property of any foreign State.]\n\n(4) The preceding provisions of this section shall apply in relation to\n\n7[(a) any ruler of a foreign State;]\n\n8[(aa)] any Ambassador or Envoy of a foreign State;\n\n(b) any High Commissioner of a Commonwealth country; and\n\n(c) any such member of the staff 9 [of the foreign State or the staff or retinue of the Ambassador] or Envoy of a foreign State or of the High Commissioner of a Commonwealth country as the Central Government may, by general or special order, specify in this behalf,\n\n10[as they apply in relation to a foreign State.]\n\n11[(5) The following persons shall not be arrested under this Code. namely:\n\n(a) any Ruler of a foreign State;\n\n(b) any Ambassador or Envoy of a foreign State;\n\n(c) any High Commissioner of a Commonwealth country ;\n\n(d) any such member of the staff of the foreign State or the staff or retinue of the Ruler, Ambassador or Envoy of a foreign State or of the High Commissioner of a Commonwealth country, as the Central Government may, by general or special order, specify in this behalf.\n\n(6) Where a request is made to the Central Government for the grant of any consent referred to in subsection (1), the Central Government shall, before refusing to accede to the request in whole or in part, give to the person making the request a reasonable opportunity of being heard.]"
  },
  {
    "section": 87,
    "title": "Style of foreign Rulers as parties to suits",
    "description": "The Ruler of a foreign State may sue, and shall be sued, in the name of his State:\n\nProvided that in giving the consent referred to in section 86, the Central Government may direct that the Ruler may be sued in the name of an agent or in any other name."
  },
  {
    "section": "87A.",
    "title": "Definitions of foreign State and Ruler",
    "description": "(1) In this Part,—\n\n(a)“foreign State” means any State outside India which has been recognised by the Central Government; and\n\n(b) “Ruler”, in relation to a foreign State, means the person who is for the time being recognized by the Central Government to be the head of that State.\n\n(2) Every Court shall take judicial notice of the fact—\n\n(a) that a State has or has not been recognized by the Central Government;\n\n(b) that a person has or has not been recognized by the Central Government to be the head of a State."
  },
  {
    "section": "87B.",
    "title": "Application of sections 85 and 86 to Rulers of former Indian States",
    "description": "1[(I) In the case of any suit by or against the Ruler of any former Indian State which is based wholly or in part upon a cause of action which arose before the commencement of the Constitution or any proceeding arising out of such suit, the provisions of section 85 and sub-sections (1) and (3) of section 86 shall apply in relation to such Ruler as they apply in relation to the Ruler of a foreign State.]\n\n(2) In this section\n\n(a) \"former Indian State\" means any such Indian State as the Central Government may, by notification in the Official Gazette, specify for the purposes of this section; 2 ***\n\n3[(b) \"Commencement of the Constitution\" means the 26th day of January, 1950; and\n\n(c) \"Ruler\", in relation to a former Indian State, has the same meaning as in article 363 of the Constitution.]"
  },
  {
    "section": 88,
    "title": "Where interpleader-suit may be instituted",
    "description": "Where two or more persons claim adversely to one another the same debts, sum of money or other property, movable or immovable, from another person, who claims no interest therein other than for charges or costs and who is ready to pay or deliver it to the rightful claimant, such other person may institute a suit of interpleader against all the claimants for the purpose of obtaining a decision as to the person to whom the payment or delivery shall be made and of obtaining indemnity for himself :\n\nProvided that where any suit is pending in which the rights of all parties can properly be decided, no such suit of interpleader shall be instituted."
  },
  {
    "section": 89,
    "title": "Settlement of disputes outside the Court",
    "description": "1[89. Settlement of disputes outisde the Court.--(1) Where it appears to the Court that there exist elements of a settlement which may be acceptable to the parties, the Court shall formulate the terms of settlement and give them to the parties for their observations and after receiving the observations of the parties, the Court may reformulate the terms of a possible settlement and refer the same for:--\n\n(a) arbitration;\n\n(b) conciliation;\n\n(c) judicial settlement including settlement through Lok Adalat: or\n\n(d) mediation.\n\n(2) Were a dispute has been referred--\n\n(a) for arbitration or conciliation, the provisions of the Arbitration and Conciliation Act, 1996 (26 of 1996) shall apply as if the proceedings for arbitration or conciliation were referred for settlement under the provisions of that Act;\n\n(b) to Lok Adalat, the Court shall refer the same to the Lok Adalat in accordance with the provisions of sub-section (1) of section 20 of the Legal Services Authority Act, 1987 (39 of 1987) and all other provisions of that Act shall .apply in respect of the dispute so referred to the Lok Adalat;\n\n(c) for judicial settlement, the Court shall refer the same to a suitable institution or person and such institution or person shall be deemed to be a Lok Adalat and all the provisions of the Legal Services Authority Act, 1987 (39 of 1987) shall apply as if the dispute were referred to a Lok Adalat under the provisions of that Act;\n\n(d) for mediation, the Court shall effect a compromise between the parties and shall follow such procedure as may be prescribed.]"
  },
  {
    "section": 90,
    "title": "Power to state case for opinion of Court",
    "description": "Where any persons agree in writing to state a case for the opinion of the Court, then the Court shall try and determine the same in the manner prescribed."
  },
  {
    "section": 91,
    "title": "Public nuisances and other wrongful acts affecting the public",
    "description": "1 ,2[(1) In the case of a public nuisance or other wrongful act affecting, or likely to affect, the public, a suit for a declaration and injunction or for such other relief as may be appropriate in the circumstances of the case, may be instituted,\n\n(a) by the Advocate-General, or\n\n(b) with the leave of the Court, by two or more persons, even though no special damage has been caused to such persons by reason of such public nuisance or other wrongful act.]\n\n(2) Nothing in this section shall be deemed to limit or otherwise affect any right of suit which may exist independently of its provisions."
  },
  {
    "section": 92,
    "title": "Public charities",
    "description": "1(1) In the case of any alleged breach of any express or constructive trust created for public purposes of a charitable or religious nature, or where the direction of the Court is deemed necessary for the administration of any such trust, the Advocate-General, or two or more persons having an interest in the trust and having obtained the 2 [leave of the Court], may institute a suit, whether contentious or not, in the principal Civil Court of original jurisdiction or in any other Court empowered in that behalf by the State Government within the local limits of whose jurisdiction the whole or any part of the subject-matter of the trust is situate to obtain a decree:\n\n(a) removing any trustee;\n\n(b) appointing a new trustee;\n\n(c) vesting any property in a trustee;\n\n3 [(cc) directing a trustee who has been removed or a person who has ceased to be a trustee, to deliver possession of any trust property in his possession to the person entitled to the possession of such property];\n\nd) directing accounts and inquiries;\n\n(e) declaring what proportion of the trust property or of the interest therein shall be allocated to any particular object of the trust;\n\n(f) authorizing the whole or any part of the trust property to be let, sold, mortgaged or exchanged;\n\n(g) settling a scheme; or\n\n(h) granting such further or other relief as the nature of the case may require.\n\n(2) Save as provided by the Religious Endowments Act, 1863 (XX of 1863), 4 [or by any corresponding law in force in 5 [the territories which, immediately before the 1st November, 1956, were comprised in Part B States]], no suit claiming any of the reliefs specified in sub-section (1) shall be instituted in respect of any such trust as is therein referred to except in conformity with the provisions of that sub-section.\n\n6[(3) The Court may alter the original purposes of an express or constructive trust created for public purposes of a charitable or religious nature and allow the property or income of such trust or any portion thereof to be applied cy pres in one or more of the following circumstances, namely :\n\n(a) where the original purposes of the trust, in whole or in part,\n\n(i) have been, as far as may be, fulfilled; or\n\n(ii) cannot be carried out at all, or cannot be carried out according to the directions given in the instrument creating the trust or, where there is no such instrument, according to the spirit of the trust; or\n\n(b) where the original purposes of the trust provide a use for a part only of the property available by virtue of the trust; or\n\n(c) where the property available by virtue of the trust and other property applicable for similar purposes can be more effectively used in conjunction with, and to that end can suitably be made applicable to any other purpose, regard being had to the spirit of the trust and its applicability to common purposes; or\n\n(d) where the original purposes, in whole or in part, were laid down by reference to an area which then was, but has since ceased to be, a unit for such purposes; or\n\n(e) where the original purposes, in whole or in part, have, since they were laid down,\n\n(i) been adequately provided for by other means, or\n\n(ii) ceased, as being useless or harmful to the community, of\n\n(iii) ceased to be, in law, charitable, or\n\n(iv) ceased in any other way to provide a suitable and effective method of using the property available by virtue of the trust, regard being had to the spirit of the trust.]"
  },
  {
    "section": 93,
    "title": "Exercise of powers of Advocate-General outside presidency-towns",
    "description": "The powers conferred by\nsections 91 and 92 on the Advocate-General may, outside the presidency-towns, be, with the previous\nsanction of the State Government, exercised also by the Collector or by such officer as the State\nGovernment may appoint in this behalf."
  },
  {
    "section": 94,
    "title": "Supplemental proceedings",
    "description": "In order to prevent the ends of justice from being defeated the Court may, if it is so prescribed,—\n\n(a) issue a warrant to arrest the defendant and bring him before the Court to show cause why he should not give security for his appearance, and if he fails to comply with any order for security commit him to the civil prison;\n\n(b) direct the defendant to furnish security to produce any property belonging to him and to place the same at the disposal of the Court or order the attachment of any property;\n\n(c) grant a temporary injunction and in case of disobedience commit the person guilty thereof to the civil prison and order that his property be attached and sold;\n\n(d) appoint a receiver of any property and enforce the performance of his duties by attaching and selling his property;\n\n(e) make such other interlocutory orders as may appear to the Court to be just and convenient."
  },
  {
    "section": 95,
    "title": "Compensation for obtaining arrest, attachment or injunction on insufficient ground",
    "description": "(1) Where, in any suit in which an arrest or attachment has been effected or a temporary injunction granted under the last preceding section,--\n\n(a) it appears to the Court that such arrest, attachment or injunction was applied for on insufficient grounds, or\n\n(b) the suit of the plaintiff fails and it appears to the Court that there was no reasonable or probable grounds for instituting the same,\n\nthe defendant may apply to the Court, and the Court may, upon such application, award against the plaintiff by its order such amount 1 [not exceeding fifty thousand rupees], as it deems a reasonable compensation to the defendant for the 2 [expense or injury (including injury to reputation) caused to him]:\n\nProvided that a Court shall not award, under this section, an amount exceeding the limits of its pecuniary jurisdiction.\n\n(2) An order determining any such application shall bar any suit for compensation in respect of such arrest, attachment or injunction."
  },
  {
    "section": 96,
    "title": "Appeal from original decree",
    "description": "(1) Save where otherwise expressly provided in the body of this Code or by any other law for the time being in force, an appeal shall lie from every decree passed by any Court exercising original jurisdiction to the Court authorized to hear appeals from the decisions of such Court.\n\n(2) An appeal may lie from an original decree passed ex parte.\n\n(3) No appeal shall lie from a decree passed by the Court with the consent of parties.\n\n1[(4) No appeal shall lie, except on a question of law, from a decree in any suit of the nature cognizable by Courts of Small Causes, when the amount or value of the subject-matter of the original suit does not exceed 2 [ten thousand rupees.]]"
  },
  {
    "section": 97,
    "title": "Appeal from final decree where no appeal from preliminary decree",
    "description": "Where any party aggrieved by a preliminary decree passed after the commencement of this Code does not appeal from such decree, he shall be precluded from disputing its correctness in any appeal which may be preferred from the final decree."
  },
  {
    "section": 98,
    "title": "Decision where appeal heard by two or more Judges",
    "description": "(1) Where an appeal is heard by a Bench of two or more Judges, the appeal shall be decided in accordance with the opinion of such Judges or of the majority (if any) of such Judges.\n\n(2) Where there is no such majority which concurs in a judgment varying or reversing the decree appealed from, such decree shall be confirmed:\n\nProvided that where the Bench hearing the appeal is 1[composed of two or other even number of Judges belonging to a Court consisting of more Judges than those constituting the Bench] and the Judges composing the Bench differ in opinion on a point of law, they may state the point of law upon which they differ and the appeal shall then be heard upon that point only by one or more of the other Judges, and such point shall be decided according to the opinion of the majority (if any) of the Judges who have heard the appeal, including those who first heard it.\n\n2[(3) Nothing in this section shall be deemed to alter or otherwise affect any provision of the letters to patent of any High Court.]"
  },
  {
    "section": 99,
    "title": "No decree to be reversed or modified for error or irregularity not affecting merits or jurisdiction",
    "description": "No decree shall be reversed or substantially varied, nor shall any case be remanded, in appeal on account of any misjoinder 1 [or non-joinder] of parties or causes of action or any error, defect or irregularity in any proceedings in the suit, not affecting the merits of the case or the jurisdiction of the Court :\n\n2[Provided that nothing in this section shall apply to non-joinder of a necessary party.]"
  },
  {
    "section": "99A.",
    "title": "No order under section 47 to be reversed or modified unless decision of the case is prejudicially affected",
    "description": "1[99A. No order under section 47 to be reversed or modified unless decision of the case is prejudicially affected.--Without prejudice to the generality of the provisions of section 99, no order under section 47 shall be reversed or substantially varied, on account of any error, defect or irregularity in any proceeding relating to such order, unless such error, defect or irregularity has prejudicially affected the decision of the case.]"
  },
  {
    "section": 100,
    "title": "Second appeal",
    "description": "1[100. Second appeal.--(1) Save as otherwise expressly provided in the body of this Code or by any other law for the time being in force, an appeal shall lie to the High Court from every decree passed in appeal by any Court subordinate to the High Court, if the High Court is satisfied that the case involves a substantial question of law.\n\n(2) An appeal may lie under this section from an appellate decree passed ex parte.\n\n(3) In an appeal under this section, the memorandum of appeal shall precisely state the substantial question of law involved in the appeal.\n\n(4) Where the High Court is satisfied that a substantial question of law is involved in any case, it shall formulate that question.\n\n(5) The appeal shall be heard on the question so formulated and the respondent shall, at the hearing of the appeal, be allowed to argue that the case does not involve such question:\n\nProvided that nothing in this sub-section shall be deemed to take away or abridge the power of the Court to hear, for reasons to be recorded, the appeal on any other substantial question of law, not formulated by it, if it is satisfied that the case involves such question.]\n\nSTATE AMENDMENT\n\nKerala.\n\nIn sub-section (1) of section 100 of the Principal Act, after clause (c), the following clause shall be added, namely:\n\n(d) the finding of the lower appellate court on any question of fact material to the right decision of the case on the merits being in conflict with the finding of the Court of first instance on such question.\n\n[Vide Kerala Act 13 of 1957 sec. 4.]"
  },
  {
    "section": "100A.",
    "title": "No further appeal in certain cases",
    "description": "1[100A. No further appeal in certain cases.--Notwithstanding anything contained in any Letters Patent for any High Court or in any instrument having the force of law or in any other law for the time being in force, where any appeal from an original or appellate decree or order is heard and decided by a Single Judge of a High Court, no further appeal shall lie from the judgment and decree of such Single Judge.]"
  },
  {
    "section": 101,
    "title": "Second appeal on no other grounds",
    "description": "No second appeal shall lie except on the ground mentioned in section 100."
  },
  {
    "section": 102,
    "title": "No second appeal in certain cases",
    "description": "1[102. No second appeal in certain cases.--No second appeal shall lie from any decree, when the subject matter of the original suit is for recovery of money not exceeding twenty-five thousand rupees.]"
  },
  {
    "section": 103,
    "title": "Power of High Court to determine issue of fact",
    "description": "1[103. Power of High Court to determine issue of fact.--In any second appeal, the High Court\nmay, if the evidence on the record is sufficient, determine any issue necessary for the disposal of the\nappeal,-- \n\n(a) which has not been determined by the lower Appellate Court or both by the Court of first\ninstance and the lower Appellate Court, or\n\n(b) which has been wrongly determined by such Court or Courts by reason of a decision on such\nquestion of law as is referred to in section 100.]"
  },
  {
    "section": 104,
    "title": "Orders from which appeal lies",
    "description": "(1) An appeal shall lie from the following orders, and save as otherwise expressly provided in the body of this Code or by any law for the time being in force, from no other orders:---\n\n1** * * *\n2[(ff) an order under section 35A;]\n\n3[(ffa) an order under section 91 or section 92 refusing leave to institute a suit of the nature referred to in section 91 or section 92, as the case may be;]\n\n(g) an order under section 95;\n\n(h) an order under any of the provisions of this Code imposing a fine or directing the arrest or detention in the civil prison of any person except where such arrest or detention is in execution of a decree;\n\n(i) any order made under rules from which an appeal is expressly allowed by rules:\n\n2[Provided that no appeal shall lie against any order specified in clause (ff) save on the ground that no order, or an order for the payment of a less amount, ought to have been made.]\n\n(2) No appeal shall lie from any order passed in appeal under this section."
  },
  {
    "section": 105,
    "title": "Other orders",
    "description": "(1) Save as otherwise expressly provided, no appeal shall lie from any order made by a Court in the exercise of its original or appellate jurisdiction; but where a decree is appealed from, any error, defect or irregularity in any order, affecting the decision of the case, may be set forth as a ground of objection in the memorandum of appeal.\n\n(2) Notwithstanding anything contained in sub-section (1), where any party aggrieved by an order of remand 1 *** from which an appeals lies does not appeal therefrom, he shall thereafter be precluded from disputing its correctness."
  },
  {
    "section": 106,
    "title": "What Courts to hear appeals",
    "description": "Where an appeal from any order is allowed it shall lie to the Court to which an appeal would lie from the decree in the suit in which such order was made, or where such order is made by a Court (not being a High Court) in the exercise of appellate jurisdiction, then to the High Court."
  },
  {
    "section": 107,
    "title": "Powers of Appellate Court",
    "description": "(1) Subject to such conditions and limitations as may be prescribed, an Appellate Court shall have power—\n\n(a) to determine a case finally;\n\n(b) to remand a case;\n\n(c) to frame issues and refer them for trial;\n\n(d) to take additional evidence or to require such evidence to be taken.\n\n(2) Subject as aforesaid, the Appellate Court shall have the same powers and shall perform as nearly as may be the same duties as are conferred and imposed by this Code on Courts of original jurisdiction in respect of suits instituted therein."
  },
  {
    "section": 108,
    "title": "Procedure in appeals from appellate decrees and orders",
    "description": "The provisions of this Part relating to appeals from original decrees shall, so far as may be, apply to appeals—\n\n(a) from appellate decrees, and\n\n(b) from orders made under this Code or under any special or local law in which a different procedure is not provided."
  },
  {
    "section": 109,
    "title": "When appeals lie to the Supreme Court",
    "description": "1[109. When appeals lie to the Supreme Court.-- Subject to the provisions in Chapter IV of Part V of\nthe Constitution and such rules as may, from time to time, be made by the Supreme Court regarding appeals\nfrom the Courts of India, and to the provisions hereinafter contained, an appeal shall lie to the Supreme Court\nfrom any judgment, decree or final order in a civil proceeding of a High Court, if the High Court certifies \n\n(i) that the case involves a substantial question of law of general importance; and\n(ii) that in the opinion of the High Court the said question needs to be decided by the Supreme Court.]"
  },
  {
    "section": 110,
    "title": "[Omitted]",
    "description": "[Value of subject matters.] Omitted by the Code of Civil Procedure (Amendment) Act, 1973 (49 of 1973), s. 3 (w.e.f. 29-11-1973)."
  },
  {
    "section": 111,
    "title": "[Omitted]",
    "description": "[Bar of certain appeals.] omitted by the A.O. 1950."
  },
  {
    "section": "111A.",
    "title": "[Omitted]",
    "description": "1[[Appeals to Federal Court.] Rep. by the Federal Court Act, 1941 (21 of 1941), s. 2."
  },
  {
    "section": 112,
    "title": "Savings",
    "description": "1[(1) Nothing contained in this Code shall be deemed—\n\n(a) to affect the powers of the Supreme Court under article 136 or any other provision of the Constitution; or\n\n(b) to interfere with any rules made by the Supreme Court, and for the time being in force for the presentation of appeals to that Court, or their conduct before that Court.]\n\n(2) Nothing herein contained applies to any matter of criminal or admiralty or vice-admiralty jurisdiction or to appeals from orders and decrees of Prize Courts."
  },
  {
    "section": 113,
    "title": "Reference to High Court",
    "description": "Subject to such conditions and limitations as may be prescribed, any Court may state a case and refer the same for the opinion of the High Court, and the High Court may make such order thereon as it thinks fit:\n\n1[Provided that where the Court is satisfied that a case pending before it involves a question as to the validity of any Act, Ordinance or Regulation or of any provision contained in an Act, Ordinance or Regulation, the determination of which is necessary for the disposal of the case, and is of opinion that such Act, Ordinance, Regulation or provision is invalid or inoperative, but has not been so declared by the High Court to which that Court is subordinate or by the Supreme Court, the Court shall state a case setting out its opinion and the reasons therefor, and refer the same for the opinion of the High Court.\n\nExplanation.In this section,\"Regulation\" means any Regulation of the Bengal, Bombay or Madras Code or Regulation as defined in the General Clauses Act,1897, (10 of 1897) or in the General Clauses Act of a State.]"
  },
  {
    "section": 114,
    "title": "Review",
    "description": "Subject as aforesaid, any person considering himself aggrieved—\n\n(a) by a decree or order from which an appeal is allowed by this Code, but from which no appeal has been preferred.\n\n(b) by a decree or order from which no appeal is allowed by this Code, or\n\n(c) by a decision on a reference from a Court of Small Causes,\n\nmay apply for a review of judgment to the Court which passed the decree or made the order, and the Court may make such order thereon as it thinks fit."
  },
  {
    "section": 115,
    "title": "Revision",
    "description": "1[(1)] The High Court may call for the record of any case which has been decided by any Court subordinate to such High Court and in which no appeal lies thereto, and if such subordinate Court appears\n\n(a) to have exercised a jurisdiction not vested in it by law, or\n\n(b) to have failed to exercise a jurisdiction so vested, or\n\n(c) to have acted in the exercise of its jurisdiction illegally or with material irregularity,\n\nthe High Court may make such order in the case as it thinks fit:\n\n2[Provided that the High Court shall not, under this section, vary or reverse any order made, or any order deciding an issue, in the course of a suit or other proceeding, except where the order, if it had been made in favour of the party applying for revision would have finally disposed of the suit or other proceedings.]\n\n3[(2) The High Court shall not, under this section, vary or reverse any decree or order against which an appeal lies either to the High Court or to any Court subordinate thereto.\n\n4[(3) A revision shall not operate as a stay of suit or other proceeding before the Court except where such suit or other proceeding is stayed by the High Court.]\n\nExplanation--.In this section, the expression \"any case which has been decided\" includes any order made, or any order deciding an issue in the course of a suit or other proceeding.]\n\nSTATE AMENDMENTS\n\nOrrisa\n\nAmendment of section 115.--In the Code of Civil Procedure, 1908 (5 of 1908) for section 115, the following section shall be substituted, namely:--\n\n115. Revision.--The High Court, in cases arising out of original suits or other proceedings of the value exceeding one lakh rupees, and the District Court, in any other case including a case arising out of an original suit or other proceedings instituted before the commencement of the Code of Civil Procedure ( Orissa Amendment) Act, 1991, may call for the record of any case which has been decided by any Court subordinate to the High Court or the District Court, as the case may be, and in which no appeal lies thereto, and if such subordinate Court appears--\n\n(a) to have failed to exercised a jurisdiction not vested in it by law; or\n\n(b) to have failed to exercise a jurisdiction so vested; or\n\n(c) to have acted in the exercise of its jurisdiction illegally or with material irregularity;\n\nthe High Court or the District Court, as the case may be, may make such order in the case as it thinks fit:\n\nProvided that in respect of cases arising out of original suits, or other proceedings of any valuation decided by the District Court, the High Court alone shall be competent to make an order under this section:\n\nProvided further that the High Court or the District Court shall not, under this section, vary or reverse any order, including an order deciding an issue, made in the course of a suit or other proceedings, except where--\n\n(i) the order, if so varied or reversed, would finally dispose of the suit or other proceedings; or\n\n(ii) the order, if allowed to stand, would occasion a failure of justice or cause irreparable injury to the party against whom it was made.\n\nExplanation--In this section, the expression \" any case which has been decided\" includes any order deciding an issue in the course of a suit or other proceeding.\".\n\n3. Saving.--The amendment made by this Act shall not affect the validity, invalidity, effect or consequence of anything already done or suffered, or any jurisdiction already exercised, and any proceeding instituted or commenced in the High Court under section 115 of the Code of Civil Procedure, 1908 (5 of 1908) prior to the commencement of this Act shall, notwithstanding such amendment, continue to be heard and decided by such Court.\n\n[Vide the Orissa Act 26 of 1991, s. 2]\n\nAmendment of section 115.--In the Code of Civil Procedure, 1908 (5 of 1908), for section 115, the following section shall be substituted, namely:--\n\n115. Revision.--(1) The High Court, in cases arising out of original suits or other proceedings of the value exceeding five lakhs rupees and the District Court, in any other cases, including a case arising out of an original suit or other proceedings instituted before the commencement of the Code of Civil Procedure ( Orissa Amendment) Act, 2010, may call for the record of any case which has been decided by any Court subordinate to the High Court or the District Court, as the case may be, and in which no appeal lies thereto, and if such subordinate Court appears--\n\n(a) to have exercised a jurisdiction not vested in it by law; or\n\n(b) to have failed to exercise a jurisdiction so vested; or\n\n(c) to have acted in the exercise of its jurisdiction illegally or with material irregularity,\n\nthe High Court or the District Court, as the case may be, may make such order in the case as it thinks fit:\n\nProvided that in respect of cases arising out of original suits or other proceedings of any valuation decided by the District Court, the High Court alone shall be competent to make an order under this section\n\n(2) The High Court or the District Court, as the case may be, shall not under this section, vary or reverse any order, including an order deciding an issue, made in the course of a suit or other proceedings, except where the order, if it had been made in favor of the party applying for revision, would have finally disposed of the suit or other proceedings.\n\n(3) A revision shall not operate as a stay of suit or other proceeding before the Court except where such suit or other proceeding is stayed by the High Court or District Court, as the case may be.\n\nExplanation--In this section, the expression, \"any case which has been decided\" includes any order deciding an issue in the course of a suit or other proceeding.\".\n\n[Vide the Orissa Act 14 of 2010, s. 2]"
  },
  {
    "section": 116,
    "title": "Part to apply only to certain High Courts",
    "description": "1, 2This Part applies only to High Courts 2 [not being the court of a Judicial Commissioner]."
  },
  {
    "section": 117,
    "title": "Application of Code to High Courts",
    "description": "Save as provided in this Part or in Part X or in rules, the provisions of this Court shall apply to such High Courts."
  },
  {
    "section": 118,
    "title": "Execution of decree before ascertainment of costs",
    "description": "Where any such High Court considers it necessary that a decree passed in the exercise of its original civil jurisdiction should be executed before the amount of the costs incurred in the suit can be ascertained by taxation, the Court may order that the decree shall be executed forthwith, except as to so much thereof as relates to the costs;\n\nand, as to so much thereof as relates to the costs, that the decree may be executed as soon as the amount of the costs shall be ascertained by taxation."
  },
  {
    "section": 119,
    "title": "Unauthorised persons not to address Court",
    "description": "Nothing in this Code shall be deemed to authorize\nany person on behalf of another to address the Court in the exercise of its original civil jurisdiction, or to\nexamine witnesses, except where the Court shall have in the exercise of the power conferred by its charter\nauthorized him so to do, or to interfere with the power of the High Court to make rules concerning\nadvocates, vakils and attorneys."
  },
  {
    "section": 120,
    "title": "Provisions not applicable to High Court in original civil jurisdiction",
    "description": "(1)The following provisions shall not apply to the High Court in the exercise of its original civil jurisdiction, namely, sections 16, 17 and 20.\n\n1* * * * *"
  },
  {
    "section": 121,
    "title": "Effect of rules in First Schedule",
    "description": "The rules in a First Schedule shall have effect as if enacted in the body of this Code until annulled or altered in accordance with the provisions of this Part."
  },
  {
    "section": 122,
    "title": "Power of certain High Courts to make rules",
    "description": "1[High Courts 2 [not being the Court of a Judicial Commissioner]] 3 *** may, from time to time after previous publication, make rules regulating their own procedure and the procedure of the Civil Courts subjects to their superintendence, and may by such rules annul, alter or add to all or any of the rules in the First Schedule."
  },
  {
    "section": 123,
    "title": "Constitution of Rule Committees in certain States",
    "description": "(1) A Committee, to be called the Rule Committee, shall be constituted at 1[the town which is the usual place of sitting of each of the High Courts 2*** referred to in section 122].\n\n(2) Each such Committee shall consist of the following persons, namely:\n\n(a) three Judges of the High Court established at the town at which such Committee is constituted, one of whom at least has served as a District Judge or 3*** a Divisional Judge for three years,\n\n4[(b) two legal practitioners enrolled in that Court,]\n\n5[(c) a Judge of a Civil Court subordinate to the High Court, 6***\n\n7* * * * *\n(3) The members of each Committee shall be appointed by the 8 [High Court], which shall also nominate one of their number to be President:\n\n9* * * * *\n\n(4) Each member of any such Committee shall hold office for such period as may be prescribed by the 8[High Court] in this behalf; and whenever any member retires, resigns, dies or ceases reside in the State in which the Committee was constituted, or becomes incapable of acting as a member of the Committee, the said 8[High Court] may appoint another person to be a member in his stead.\n\n(5) There shall be a secretary to each such Committee, who shall be appointed by the 8[High Court] and shall receive such remuneration as may be provided in this behalf 10[by the State Government].\n\nSTATE AMENDMENTS\n\nAssam.--\n\nFor clause (a) of sub-section (2) of section 123 the following shall be substituted--\n\n\"(a) three Judges of the High Court established at the town at which such Committee is constituted, provided that the Chief Justice may appoint only two Judges of the High Court on the Committee if the number of Judges of the High Court does not exceed three.\"\n\n[Vide Assam Act 8 of 1953, sec. 2.]\n\nTamil Nadu\n\nAmendment of section 123, Central Act V of 1908.--In section (2) of section 123 of the Code of Civil Procedure, 1908 ( Central Act V of 1908),--\n\n(a) in clause (b), for the words \"two legal practitioners\", the words \"three legal practitioners\" shall be substituted.\n\n(b) in clause (d), the word \"Madras\" shall be omitted.\n\n[Vide Tamil Nadu Act 15 of 1970, s. 2]"
  },
  {
    "section": 124,
    "title": "Committee to report to High Court",
    "description": "Every Rule Committee shall make a report to the High\nCourt established at the town at which it is constituted on any proposal to annul, alter or add to the rules\nin the First Schedule or to make new rules, and before making any rules under section 122 the High Court\nshall take such report into consideration."
  },
  {
    "section": 125,
    "title": "Power of other High Courts to make rules",
    "description": "High Courts, other than the Courts specified in\nsection 122, may exercise the powers conferred by that section in such manner and subject to such\nconditions 1\n[as 2\n[the State Government may determine:] \nProvided that any such High Court may, after previous publication, make a rule extending within the\nlocal limits of its jurisdiction any rules which have been made by any other High Court."
  },
  {
    "section": 126,
    "title": "Rules to be subject to approval",
    "description": "1[Rules made under the foregoing provisions shall be subject to the previous approval of the Government of the State in which the Court whose procedure the rules regulate is situate or, if that Court is not situate in any State, to the previous approval of 2 [Central Government.]]"
  },
  {
    "section": 127,
    "title": "Publication of rules",
    "description": "Rules so made and 1 [approved] shall be published in the 2 [Official Gazette], and shall from the date of publication or from such other date as may be specified have the same force and effect, within the local limits of the jurisdiction of the High Court which made them, as if they had been contained in the First Schedule."
  },
  {
    "section": 128,
    "title": "Matters for which rules may provide",
    "description": "(1) Such rules shall be not inconsistent with the provisions in the body of this code, but, subject thereto, may provide for any matters relating to the procedure of Civil Courts.\n\n(2) In particular, and without prejudice to the generality of the powers conferred by sub-section (1), such rules may provide for all or any of the following matters, namely:—\n\n(a) the service of summonses, notices and other processes by post or in any other manner either generally or in any specified areas, and the proof of such service;\n\n(b) the maintenance and custody, while under attachment, of live-stock and other movable property, the fees payable for such maintenance and custody, the sale of such live-stock and property, and the proceeds of such sale;\n\n(c) procedure in suits by way of counterclaim, and the valuation of such suits for the purposes of jurisdiction;\n\n(d) procedure in garnishee and charging orders either in addition to, or in substitution for, the attachment and sale of debts;\n\n(e) procedure where the defendant claims to be entitled to contribution or indemnity over against any person whether a party to the suit or not;\n\n(f) summary procedure—\n\n(i) in suits in which the plaintiff seeks only to recover a debt or liquidated demand in money payable by the defendant, with or without interest, arising—\n\non a contract express or implied; or\n\non an enactment where the sum sought to be recovered is a fixed sum of money or in the nature of a debt other than a penalty; or\n\non a guarantee, where the claim against the principal is in respect of a debt or a liquidated demand only; or\n\non a trust; or\n\n(ii) in suits for the recovery of immovable property, with or without a claim for rent or mesne profits, by a landlord against a tenant whose term has expired or has been duly determined by notice to quit, or has become liable to forfeiture for non-payment of rent, or against persons claiming under such tenant;\n\n(g) procedure by way of originating summons;\n\n(h) consolidation of suits, appeals and other proceedings;\n\n(i) delegation to any Registrar, Prothonotary or Master or other official of the Court of any judicial, quasi-judicial and non-judicial duties; and\n\n(j) all forms, registers, books, entries and accounts which may be necessary or desirable for the transaction of the business of Civil Courts."
  },
  {
    "section": 129,
    "title": "Power of High Courts to make rules as to their original Civil procedure",
    "description": "Notwithstanding anything in this Code, any High Court 1 [not being the Court of a Judicial Commissioner] may make such rules not inconsistent with the Letters Patent 2 [or order] 3 [or other law] establishing it to regulate its own procedure in the exercise of its original civil jurisdiction as it shall think fit, and nothing herein contained shall affect the validity of any such rules in force at the commencement of this Code."
  },
  {
    "section": 130,
    "title": "Power of other High Courts to make rules as to matters other than procedure",
    "description": "1[A High Court 2[not being a High Court to which section 129 applies] may, with the previous approval of the State Government, make with respect to any matter other than procedure any rule which a High Court 3[for a 4*** State] might under 5[article 227 of the Constitution] make with respect to any such matter for any part of the territories under its jurisdiction which is not included within the limits of a presidency town.]"
  },
  {
    "section": 131,
    "title": "Publication of rules",
    "description": "Rules made in accordance with section 129 or section 130 shall be published in the 1[Official Gazette] and shall from the date of publication or from such other date as may be specified have the force of law."
  },
  {
    "section": 132,
    "title": "Exemption of certain women from personal appearance",
    "description": "(1) Women who, according to the customs and manners of the country, ought not to be compelled to appear in public shall be exempt from personal appearance in Court.\n\n(2) Nothing herein contained shall be deemed to exempt such women from arrest in execution of civil process in any case in which the arrest of women is not prohibited by this Code."
  },
  {
    "section": 133,
    "title": "Exemption of other persons",
    "description": "1[(1)The following persons shall be entitled to exemption from personal appearance in Court, namely:--\n(i) the President of India;\n\n(ii) the Vice-President of India;\n\n(iii) the Speaker of the House of the People;\n\n(iv) the Ministers of the Union;\n\n(v) the Judges of the Supreme Court;\n\n(vi) the Governors of States and the administrators of Union territories;\n\n(vii) the Speakers of the State Legislative Assemblies;\n\n(viii) the Chairman of the State Legislative Councils;\n\n(ix) the Ministers of States;\n\n(x) the Judges of the High Courts; and\n\n(xi) the persons to whom section 87B applies.]\n\n2* * * * *\n\n(3)Where any person 3*** claims the privilege of such exemption, and it is consequently necessary to examine him by commission, he shall pay the costs of that commission, unless the party requiring his evidence pays such costs."
  },
  {
    "section": 134,
    "title": "Arrest other than in execution of decree",
    "description": "The provisions of sections 55, 57 and 59 shall apply, so far as may be, to all persons arrested under this Code."
  },
  {
    "section": 135,
    "title": "Exemption from arrest under civil process",
    "description": "(1) No Judge, Magistrate or other judicial officer shall be liable to arrest under civil process while going to, presiding in, or returning from, his Court.\n\n(2) Where any matter is pending before a tribunal having jurisdiction therein, or believing in good faith that it has such jurisdiction, the parties thereto, their pleaders, mukhtars, revenue-agents and recognized agents, and their witnesses acting in obedience to a summons, shall be exempt from arrest under civil process other than process issued by such tribunal for contempt of Court while going to or attending such tribunal for the purpose of such matter, and while returning from such tribunal.\n\n(3) Nothing in sub-section (2) shall enable a judgment-debtor to claim exemption from arrest under an order for immediate execution or where such judgment-debtor attends to show cause why he should not be committed to prison in execution of a decree."
  },
  {
    "section": "135A.",
    "title": "Exemption of members of legislative bodies from arrest and detention under civil process",
    "description": "1[135A. Exemption of members of legislative bodies from arrest and detention under civil process-- 2[(1) No person shall be liable to arrest or detention in prison under civil process--\n\n(a) if he is a member of--\n\n(i) either House of Parliament, or\n\n(ii) the Legislative Assembly or Legislative Council of a State, or\n\n(iii) a Legislative Assembly of a Union territory,\n\nduring the continuance of any meeting of such House of Parliament or, as the case may be, of the Legislative Assembly or the Legislative Council;\n\n(b) if he is a member of any committee of--\n\n(i) either House of Parliament, or\n\n(ii) the Legislative Assembly of a State or Union territory, or\n\n(iii) the Legislative Council of a State,\n\nduring the continuance of any meeting of such committee;\n\n(c) if he is a member of--\n\n(i) either House of Parliament, or\n\n(ii) a Legislative Assembly or Legislative Council of a State having both such Houses,\n\nduring the continuance of a joint sitting, meeting, conference or joint committee of the Houses of Parliament or, Houses of the State Legislature, as the case may be,\n\nand during the forty days before and after such meeting, sitting or conference.]\n\n(2) A person released from detention under sub-section (1) shall, subject to the provisions, of the said sub-section, be liable to re-arrest and to the further detention to which he would have been liable if he had not been released under the provisions of sub-section (1).]"
  },
  {
    "section": 136,
    "title": "Procedure where person to be arrested or property to be attached is out side district",
    "description": "(1) Where an application is made that any person shall be arrested or that any property shall be attached under any provision of this Code not relating to the execution of decrees, and such person resides or such property is situate outside the local limits of the jurisdiction of the Court to which the application is made, the Court may, in its discretion, issue, a warrant of arrest of make an order of attachment, and send to the District Court within the local limits of whose jurisdiction such person or property resides or is situate a copy of the warrant or order, together with the probable amount of the costs of the arrest or attachment.\n\n(2) The District Court shall, on receipt of such copy and amount, cause the arrest or attachment to be made by its own officers, or by a Court subordinate to itself, and shall inform the Court which issued or made such warrant or order of the arrest or attachment.\n\n(3) The Court making an arrest under this section shall send the person arrested to the Court by which the warrant of arrest was issued, unless he shows cause to the satisfaction of the former Court why he should not be sent to the later Court, or unless he furnishes sufficient security for his appearance before the later Court or for satisfying any decree that may be passed against him by that Court, in either of which cases the Court making the arrest shall release him.\n\n(4) Where a person to be arrested or movable property to be attached under this section is within the local limits of the ordinary original civil jurisdiction of the High Court of Judicature at Fort William in Bengal or at Madras or at Bombay, 1 *** the copy of the warrant of arrest or of the order of attachment, and the probable amount of the costs of the arrest or attachment, shall be sent to the Court of SmallCauses of Calcutta, Madras 2 [or Bombay], as the case may be, and that Court, on receipt of the copy and amount, shall proceed as if it were the District Court."
  },
  {
    "section": 137,
    "title": "Language of subordinate Courts",
    "description": "(1) The language which, on the commencement of this Code, is the language of any Court subordinate to a High Court shall continue to be the language of such subordinate Court until the State Government otherwise directs.\n\n(2) The State Government may declare what shall be the language of any such Court and in what character applications to and proceedings in such Courts shall be written.\n\n(3) Where this Court requires or allows anything other that the recording of evidence to be done in writing in any such Court, such writing may be in English; but if any party or his pleader is unacquainted with English a translation into the language of the Court shall, at his request, be supplied to him; and the Court shall make such order as it thinks fit in respect of the payment of the costs of such translation."
  },
  {
    "section": 138,
    "title": "Power of High Court to require evidence to be recorded in English",
    "description": "1[138. Power of High Court to require evidence to be recorded in English.-- (1) The 2[High Court] may, by notification in the Official Gazette, direct with respect to any Judge specified in the notification, or falling under a description set forth therein, that evidence in cases in which an appeal is allowed shall be taken down by him in the English language and in manner prescribed.\n\n(2) Where a Judge is prevented by any sufficient reason from complying with a direction under sub-section (1), he shall record the reason and cause the evidence to be taken down in writing from his dictation in open Court."
  },
  {
    "section": 139,
    "title": "Oath on affidavit by whom to be administered",
    "description": "In the case of any affidavit under this Code—\n\n(a) any Court or Magistrate, or\n\n1[(aa) any notary appointed under the Notaries Act, 1952 (53 of 1952); or]\n\n(b) any officer or other person whom a High Court may appoint in this behalf, or\n\n(c) any officer appointed by any other Court which the State Government has generally or specially empowered in this behalf,\n\nmay administer the oath to the deponent."
  },
  {
    "section": 140,
    "title": "Assessors in causes of salvage, etc",
    "description": "(1) In any admiralty or vice-admiralty cause of salvage to wage or collision the Court, whether it be exercising its original or its appellate jurisdiction, may, if it thinks fit, and shall upon request of either party to such cause, summon to its assistance, in such manner as it may direct or as may be prescribed, two competent assessors; and such assessors shall attend and assist accordingly.\n\n(2) Every such assessor shall receive such fees for his attendance, to be paid by such of the parties as the Court may direct or as may be prescribed."
  },
  {
    "section": 141,
    "title": "Miscellaneous proceedings",
    "description": "The procedure provided in this Code in regard to suits shall be followed, as far as it can be made applicable, in all proceedings in any Court of civil jurisdiction.\n\n1[Explanation.— In this section, the expression \"proceedings\" includes proceedings under Order IX, but does not include anyproceedings under article 226 of the Constitution.]"
  },
  {
    "section": 142,
    "title": "Orders and notices to be in writing",
    "description": "All orders and notices served on or given to any person under the provisions of this Code shall be in writing."
  },
  {
    "section": 143,
    "title": "Postage",
    "description": "Postage, where chargeable on a notice, summons or letter issued under this Code and forwarded by post, and the fee for registering the same, shall be paid within a time to be fixed before the communication is made:\n\nProvided that the State Government 1 *** may remit such postage, or fee, or both, or may prescribe a scale of court-fees to be levied in lieu thereof."
  },
  {
    "section": 144,
    "title": "Application for restitution",
    "description": "(1)Where and in so far as a decree 1 [or an order] is 2 [varied or reversed in any appeal, revision or other proceeding or is set aside or modified in any suit instituted for the purpose, the Court which passed the decree or order] shall, on the application of any party entitled to any benefit by way of restitution or otherwise, cause such restitution to be made as will, so far as may be, place the parties in the position which they would have occupied but for such decree 1 [or order] or 3 [such part thereof as has been varied, reversed, set aside or modified]; and for this purpose, the Court may make any orders, including orders for the refund of costs and for the payment of interest, damages, compensation and mesne profits, which are properly 4 [consequential on such variation, reversal, setting aside or modification of the decree or order].\n\n5[Explanation.--For the purposes of sub-section (1), the expression \"Court which passed the decree or order\" shall be deemed to include,\n\n(a) where the decree or order has been varied or reversed in exercise of appellate or revision jurisdiction, the Court of first instance;\n\n(b) where the decree or order has been set aside by a separate suit, the court of first instance which passed such decree or order.\n\n(c) where the Court of first instance has ceased to exist or has ceased to have jurisdiction to execute, it, the Court which, if the suit wherein the decree or order was passed were instituted at the time of making the application for restitution under this section, would have jurisdiction to try such suit.]\n\n(2) No suit shall be instituted for the purpose of obtaining any restitution or other relief which could be obtained by application under sub-section (1)."
  },
  {
    "section": 145,
    "title": "Enforcement of liability of surety",
    "description": "Where any person 1 [has furnished security or given a guarantee]--\n\n(a) for the performance of any decree or any part thereof, or\n\n(b) for the restitution of any property taken in execution of a decree, or\n\n(c) for the payment of any money, or for the fulfilment of any condition imposed on any person, under an order of the Court in any suit or in any proceeding consequent thereon,\n\n2 [the decree or order may be executed in the manner therein provided for the execution of decrees, namely:--\n\n(i) if he has rendered himself personally liable, against him to that extent;\n\n(ii) if he has furnished any property as security, by sale of such property to the extent of the security;\n\n(iii) if the case falls both under clauses (i) and (ii) then to the extent specified in those clauses,\nand such person shall, be deemed to be a party within the meaning of section 47]:\n\nProvided that such notice as the Court in each case thinks sufficient has been given to the surety."
  },
  {
    "section": 146,
    "title": "Proceedings by or against representatives",
    "description": "Save as otherwise provided by this Code or by\nany law for the time being in force, where any proceeding may be taken or application made by or against\nany person then the proceeding may be taken or the application may be made by or against any person\nclaiming under him."
  },
  {
    "section": 147,
    "title": "Consent or agreement by persons under disability",
    "description": "In all suits to which any person under disability is a party, any consent or agreement, as to any proceeding shall, if given or made with the express leave of the Court by the next friend or guardian for the suit, have the same force and effect as if such person, were under no disability and had given such consent or made such agreement."
  },
  {
    "section": 148,
    "title": "Enlargement of time",
    "description": "Where any period is fixed or granted by the Court for the doing of any act\nprescribed or allowed by this Code, the Court may, in its discretion, from time to time, enlarge such period,\n1\n[not exceeding thirty days in total,] even though the period originally fixed or granted may have expired."
  },
  {
    "section": "148A.",
    "title": "Right to lodge a caveat",
    "description": "1[148 A. Right to lodge a caveat.-- (1)Where an application is expected to be made, or has been made, in a suit or proceeding instituted, or about to be instituted, in a Court , any person claiming a right to appear before the Court on the hearing of such application may lodge a caveat in respect thereof.\n\n(2) Where a caveat has been lodged under sub-section (1), the person by whom the caveat has been lodged (hereinafter referred to as the caveator) shall serve a notice of the caveat by registered post, acknowledgement due, on the person by whom the application has been, or is expected to be, made, under sub-section (1).\n\n(3) Where, after a caveat has been lodged under sub-section (1), any application is filed in any suit or proceeding, the Court, shall serve a notice of the application on the caveator.\n\n(4) Where a notice of any caveat has been served on the applicant, he shall forthwith furnish the caveator at the caveators expense, with a copy of the application made by him and also with copies of any paper or document which has been, or may be, filed by him in support of the application.\n\n(5) Where a caveat has been lodged under sub-section (1), such caveat shall not remain in force after the expiry of ninety days from the date on which it was lodged unless the application referred to in sub-section (1) has been made before the expiry of the said period.]"
  },
  {
    "section": 149,
    "title": "Power to make up deficiency of court-fees",
    "description": "Where the whole or any part of any fee prescribed for any document by the law for the time being in force relating to court-fees has not been paid, the Court may, in its discretion, at any stage, allow the person, by whom such fee is payable, to pay the whole or part, as the case may be, of such court-fee; and upon such payment the document, in respect of which fee is payable, shall have the same force and effect as if such fee had been paid in the first instance."
  },
  {
    "section": 150,
    "title": "Transfer of business",
    "description": "Save as otherwise provided, where the business of any Court is transferred\nto any other Court, the Court to which the business is so transferred shall have the same powers and shall\nperform the same duties as those respectively conferred and imposed by or under this Code upon the Court\nfrom which the business was so transferred."
  },
  {
    "section": 151,
    "title": "Saving of inherent powers of Court",
    "description": "Nothing in this Code shall be deemed to limit or otherwise affect the inherent power of the Court to make such orders as may be necessary for the ends of justice or to prevent abuse of the process of the Court."
  },
  {
    "section": 152,
    "title": "Amendment of judgments, decrees or orders",
    "description": "Clerical or arithmetical mistakes in judgments, decrees or orders or errors arising therein from any accidental slip or omission may at any time be corrected by the Court either of its own motion or on the application of any of the parties."
  },
  {
    "section": 153,
    "title": "General power to amend",
    "description": "The Court may at any time, and on such terms as to costs or otherwise as it may think fit, amend any defect or error in any proceeding in a suit ; and all necessary amendments shall be made for the purpose of determining the real question or issue raised by or depending on such proceeding."
  },
  {
    "section": "153A.",
    "title": "Power to amend decree or order where appeal is summarily dismissed",
    "description": "1[153A. Power to amend decree or order where appeal is summarily dismissed.-- Where an\nAppellate Court dismisses an appeal under rule 11 of Order XLI, the power of the Court to amend, under\nsection 152, the decree or order appealed against may be exercised by the Court which had passed the decree\nor order in the first, instance, notwithstanding that the dismissal of the appeal has the effect of confirming the\ndecree or order, as the case may be, passed by the Court of first instance."
  },
  {
    "section": "153B.",
    "title": "Place of trial to be deemed to be open Court",
    "description": "The place in which any Civil Court is held for the purpose of trying any suit shall be deemed to be an open Court, to which the public generally may have access so far as the same can conveniently contain them:\n\nProvided that the presiding Judge may, if he thinks fit, order at any stage of any inquiry into or trial of any particular case, that the public generally, or any particular person, shall not have access to, or be or remain in, the room or building used by the Court.]"
  },
  {
    "section": 154,
    "title": "[Repealed]",
    "description": "[Saving of present right of appeal.] Rep. by the Repealing and Amending Act, 1952 (48 of 1952), s. 2 and the First Schedule."
  },
  {
    "section": 155,
    "title": "[Repealed]",
    "description": "[Amendment of certain Acts.] Rep. by s. 2 and the First Schedule, ibid."
  },
  {
    "section": 156,
    "title": "[Repealed]",
    "description": "[Repeals.] Rep. by the Second Repealing and Amending Act, 1914 (17 of1914). s. 3 and the Second Schedule."
  },
  {
    "section": 157,
    "title": "Continuance of orders under repealed enactments",
    "description": "Notifications published, declarations and rules made, places appointed, agreements filed, scales prescribed, forms framed, appointments made and powers conferred under Act VIII of 1859 or under any Code of Civil Procedure or any Act amending the same or under any other enactment hereby repealed shall, so far as they are consistent with this Code, have the same force and effect as if they had been respectively published, made, appointed, filed, prescribed, framed and conferred under this Code and by the authority empowered thereby in such behalf."
  },
  {
    "section": 158,
    "title": "Reference to Code of Civil Procedure and other repealed enactments",
    "description": "In every enactment\nor notification passed or issued before the commencement of this Code in which reference is made to or\nto any Chapter or section of Act VIII of 1859 or any Code of Civil Procedure or any Act amending the\nsame or any other enactment hereby repealed, such reference shall, so far as may be practicable, ben\nto be made to this Code or to its corresponding Part, Order, section or rule."
  }
]