[
  {
    "section": 1,
    "title": "Short title",
    "description": "This Act may be called the 1*** Divorce Act, and shall\ncome into operation on the first day of April, 1869."
  },
  {
    "section": 2,
    "title": "Extent of Act",
    "description": "1[This Act extends to 2[the whole of India 3[the state of Jammu and Kashmir*]].]\n\nExtent of power to grant relief generally.-- 4[Nothing hereinafter contained shall authorise any Court to grant any relief under this Act except where the petitioner 5[or respondent professes the Christian religion],\n\nand to make decrees of dissolution.--or to make decrees of dissolution of marriage except where the parties to the marriage are domiciled in India at the time when the petition is presented,\n\nor of nullity--.or to make decrees of nullity of marriage except where the marriage has been solemnized in India and the petitioner is resident in India at the time of presenting the petition,\n\nor to grant any relief under this Act, other than a decree of dissolution of marriage or of nullity of marriage, except where the petitioner resides in India at the time of presenting the petition]."
  },
  {
    "section": 3,
    "title": "Interpretation-clause",
    "description": "In this Act, unless there be something repugnant in the subject or context, --\n\n1[(1) \"High Court\".-- \"High Court\" means with reference to any area:--\n\n(a) in a State, the High Court for that State;\n\n2[(b) in Delhi, the High Court of Delhi;\n\n(bb) in Himachal Pradesh, the High Court of Punjab and Haryana up to and inclusive of the 30th April, 1967 and the High Court of Delhi thereafter];\n\n(c) in Manipur and Tripura, the High Court of Assam;\n\n(d) in the Andaman and Nicobar Islands, the High Court at Calcutta;\n\n(e) in 3[Lakshadweep], the High Court of Kerala;\n\n4[(ee) in Chandigarh, the High Court of Punjab and Haryana];\n\nand in the case of any petition under this Act, \"High Court\" means the High Court for the area where the husband and wife reside or last resided together;\n\n5[(2) \"District Judge\" means a Judge of a principal civil court of original jurisdiction however designated]:\n\n(3) \"District Court\" means, in the case of any petition under this Act, the court of the District Judge within the local limits of whose ordinary jurisdiction, 6[or of whose jurisdiction under this Act the marriage was solemnized or] the husband and wife reside or last resided together;\n\n(4) \"Court\" means the High Court or the District Court, as the case may be;\n\n(5) \"minor children\" means, in the case of sons of Native fathers, boy, who have not completed the age of sixteen years, and, in the case of daughters of Native fathers, girls who have not completed the age of thirteen years; In other cases it means unmarried children who have not completed the age of eighteen years;\n\n7**** *\n\n8* * * **\n\n(8) \"marriage with another woman\" means marriage of any person, being married, to any other person, during the life of the former wife, whether the second marriage shall have taken place within 9[India] or elsewhere;\n\n(9) \"desertion\", implies an abandonment against the wish of the person charging it; and\n\n(10) \"property\" includes in the case of a wife, any property to which she is entitled for an estate in remainder or reversion or as a trustee, executrix or administratrix; and the date of the death of the testator or intestate shall be deemed to be the time at which any such wife becomes entitled as executrix or administratrix."
  },
  {
    "section": 4,
    "title": "Matrimonial jurisdiction of High Courts to be exercised subject to Act Exception",
    "description": "The jurisdiction now exercised by the High Courts in respect of divorce a mensa et toro, and in all other causes, suits and matters matrimonial, shall be exercised by such courts and by the District Courts subject to the provisions in this Act contained, and not otherwise; except so far as relates to the granting of marriage-licenses, which may be granted as if this Act had not been passed."
  },
  {
    "section": 5,
    "title": "Enforcement of decrees or orders made heretofore by Supreme or High Court",
    "description": "Any decree or order of the late Supreme Court of Judicature at Calcutta, Madras or Bombay sitting on the ecclesiastical side, or of any of the said High Courts sitting in the exercise of their matrimonial jurisdiction, respectively, in any cause or matter matrimonial, may be enforced and dealt with by the said High Courts, respectively, as hereinafter mentioned, in like manner as if such decree or order had been originally made under this Act by the Court so enforcing or dealing with the same."
  },
  {
    "section": 6,
    "title": "Pending suits",
    "description": "All suits and proceedings in causes and matters matrimonial, which when this Act comes into operation are pending in any High Court, shall be dealt with and decided by such court, so far as may be, as if they had been originally instituted therein under this Act."
  },
  {
    "section": 7,
    "title": "[Omitted]",
    "description": "[Court to act on principles of English Divorce Court.]––Omitted by the Indian Divorce (Amendment) Act, 2001 (51 of 2001), s. 4 (w.e.f. 3-10-2001)."
  },
  {
    "section": 8,
    "title": "Extraordinary jurisdiction of High Court",
    "description": "The High Court may, whenever it thinks fit, remove and try and determine as a Court of original jurisdiction any suit or proceeding instituted under this Act in the Court of any District Judge within the limits of its jurisdiction under this Act.\n\nPower to transfer suits.The High Court may also withdraw any such suit or proceeding, and transfer it for trial or disposal to the Court of any other such District Judge."
  },
  {
    "section": 9,
    "title": "Reference to High Court",
    "description": "When any question of law or usage having the force of law arises at any point in the proceedings previous to the hearing of any suit under this Act by a District Court or at any subsequent stage of such suit, or in the execution of the decree therein or order thereon,\n\nthe Court may, either of its own motion or on the application of any of the parties, draw up a statement of the case and refer it, with the Courts own opinion thereon, to the decision of the High Court.\n\nIf the question has arisen previous to or in the hearing, the District Court may either stay such proceedings, or proceed in the case pending such reference, and pass a decree contingent upon the opinion of the High Court upon it.\n\nIf a decree or order has been made, its execution shall be stayed until the receipt of the order of the High Court upon such reference."
  },
  {
    "section": 10,
    "title": "Grounds for dissolution of marriage",
    "description": "1[10. Grounds for dissolution of marriage.--(1) Any marriage solemnized, whether before or after the commencement of the Indian Divorce (Amendment) Act, 2001 (51 of 2001), may, on a petition presented to the District Court either by the husband or the wife, be dissolved on the ground that since the solemnization of the marriage, the respondent---\n\n(i) has committed adultery; or\n\n(ii) has ceased to be Christian by conversion to another religion; or\n\n(iii) has been incurably of unsound mind for a continuous period of not less than two years immediately preceding the presentation of the petition; or\n\n2******\n\n(v) has, for a period of not less than two years immediately preceding the presentation of the petition, been suffering from venereal disease in a communicable form; or\n\n(vi) has not been heard of as being alive for a period of seven years or more by those persons who would naturally have heard of the respondent if the respondent had been alive; or\n\n(vii) has wilfully refused to consummate the marriage and the marriage has not therefore been consummated; or\n\n(viii) has failed to comply with a decree for restitution of conjugal rights for a period of two years or upwards after the passing of the decree against the respondent; or\n\n(ix) has deserted the petitioner for at least two years immediately preceding the presentation of the petition; or\n\n(x) has treated the petitioner with such cruelty as to cause a reasonable apprehension in the mind of the petitioner that it would be harmful or injurious for the petitioner to live with the respondent.\n\n(2) A wife may also present a petition for the dissolution of her marriage on the ground that the husband has, since the solemnization of the marriage, been guilty of rape, sodomy or bestiality.]"
  },
  {
    "section": "10A.",
    "title": "Dissolution of marriage by mutual consent",
    "description": "1[(1) Subject to the provisions of this Act and the rules made thereunder, a petition for dissolution of marriage may be presented to the District Court by both the parties to a marriage together, whether such marriage was solemnized before or after the commencement of the Indian Divorce (Amendment) Act, 2001 (51 of 2001), on the ground that they have been living separately for a period of two years or more, that they have not been able to live together and they have mutually agreed that the marriage should be dissolved.\n\n(2) On the motion of both the parties made not earlier than six months after the date of presentation of the petition referred to in sub-section (1) and not later than eighteen months after the said date, if the petition is not withdrawn by both the parties in the mean time, the Court shall, on being satisfied, after hearing the parties and making such inquiry, as it thinks fit, that a marriage has been solemnized and that the averments in the petition are true, pass a decree declaring the marriage to be dissolved with effect from the date of decree.]"
  },
  {
    "section": 11,
    "title": "Adulterer to be co-respondent",
    "description": "1[11. Adulterer or adulteress to be co-respondent---On a petition for dissolution of marriage presented by a husband or wife on the ground of adultery, the petitioner shall make the alleged adulterer or adulteress a co-respondent, unless the petitioner is excused by the Court from so doing on any of the following grounds, namely:---\n\n(a) that the wife, being the respondent is leading the life of a prostitute or the husband, being respondent is leading an immoral life and that the petitioner knows of no person with whom the adultery has been committed;\n\n(b) that the name of the alleged adulterer or adulteress is unknown to the petitioner although the petitioner has made due efforts to discover it;\n\n(c) that the alleged adulterer or adulteress is dead]."
  },
  {
    "section": 12,
    "title": "Court to be satisfied of absence of collusion",
    "description": "Upon any such petition for the dissolution of a marriage, the Court shall satisfy itself, so far as it reasonably can, not only as to the facts alleged, but also whether or not the petitioner has been in any manner accessory to, or conniving at, the going through of the said form of marriage, or the adultery, or has condoned the same, and shall also enquire into any countercharge which may be made against the petitioner."
  },
  {
    "section": 13,
    "title": "Dismissal of petition",
    "description": "In case the Court, on the evidence in relation to any such petition, is\nsatisfied that the petitioner's case has not been proved, or is not satisfied that the alleged adultery has\nbeen committed,\n\n\nor finds that the petitioner has, during the marriage, been accessory to, or conniving at, the going\nthrough of the said form of marriage, or the adultery of the other party to the marriage, or has\ncondoned the adultery complained of,\n\n\nor that the petition is presented or prosecuted in collusion with either of the respondents,\n\n\nthen and in any of the said cases the Court shall dismiss the petition.\n\n\n1\n * * * * *"
  },
  {
    "section": 14,
    "title": "Power to Court to pronounce decree for dissolving marriage",
    "description": "In case the Court is satisfied on the evidence that the case of the petitioner has been proved,\n\nand does not find that the petitioner has been in any manner accessory to, or conniving at, the going through of the said form of marriage, or the adultery of the other party to the marriage, or has condoned the adultery complained of,\n\nor that the petition is presented or prosecuted in collusion with either of the respondents,\n\nthe Court shall pronounce a decree declaring such marriage to be dissolved 1***:\n\nProvided that the Court shall not be bound to pronounce such decree if it finds that the petitioner has, during the marriage, been guilty of adultery,\n\nor if the petitioner has, in the opinion of the Court, been guilty of unreasonable delay in presenting or prosecuting such petition,\n\nor of cruelty towards the other party to the marriage,\n\nor of having deserted or wilfully separated himself or herself from the other party before the adultery complained of, and without reasonable excuse,\n\nor of such wilful neglect or misconduct of or towards the other party as has conduced to the adultery.\n\nCondonation. No adultery shall be deemed to have been condoned within the meaning of this Act unless where conjugal cohabitation has been resumed or continued."
  },
  {
    "section": 15,
    "title": "Relief in case of opposition on certain grounds",
    "description": "In any suit instituted for dissolution of marriage, if the respondent opposes the relief sought on the ground, in case of such a suit instituted by a husband, of his adultery, cruelty, or desertion 1 *** or, in case of such a suit instituted by a wife, on the ground of 2[her adultery or cruelty or desertion], the Court may in such suit give to the respondent, on his or her application, the same relief to which he or she would have been entitled in case he or she had presented a petition seeking such relief, and the respondent shall be competent to give evidence of or relating to 3[such adultery, cruelty] or desertion."
  },
  {
    "section": 16,
    "title": "Decrees for dissolution to be nisi",
    "description": "Every decree for dissolution of marriage made by a High Court 1*** shall in the first instance, be a decree nisi, not to be made absolute till after the expiration of such time, not less than six months from the pronouncing thereof, as the High Court, by general or special order from time to time, directs.\n\nCollusion. During that period any person shall be at liberty, in such manner as the High Court by general or special order from time to time directs, to show cause why the said decree should not be made absolute by reason of the same having been obtained by collusion or by reason of material facts not being brought before the Court.\n\nOn cause being so shown, the Court shall deal with the case by making the decree absolute, or by reversing the decree nisi, or by requiring further inquiry, or otherwise as justice may demand.\n\nThe High Court may order the cost of Counsel and witnesses and otherwise arising from such cause being shown, to be paid by the parties or such one or more of them as it thinks fit, including a wife if she have separate property.\n\nWhenever a decree nisi has been made, and the petitioner fails, within a reasonable time, to move to have such decree made absolute, the High Court may dismiss the suit."
  },
  {
    "section": 17,
    "title": "Power of High Court to remove certain suits",
    "description": "1[17. Power of High Court to remove certain suits.—During the progress of the suit in the Court of the District Judge, any person suspecting that any parties to the suit are or have been acting in collusion for the purpose of obtaining a divorce, shall be at liberty, in such manner as the High Court by general or special order from time to time directs, to apply to the High Court to remove the suit under section 8, and the Court shall thereupon, if it thinks fit, remove such suit and try and determine the same as a Court of original jurisdiction, and the provisions contained in section 16 shall apply to every suit so removed; or it may direct the District Judge to take such steps in respect of the alleged collusion as may be necessary, to enable him to make a decree in accordance with the justice of the case]."
  },
  {
    "section": "17A.",
    "title": "[Omitted]",
    "description": "[Appointment of officer to exercise duties of King's Proctor.]Omitted by the Indian Divorce (Amendment) Act, 2001 (51 of 2001), s. 13 (w.e.f. 3-10-2001)."
  },
  {
    "section": 18,
    "title": "Petition for decree of nullity",
    "description": "Any husband or wife may present a petition to the District Court 1 ***, praying that his or her marriage may be declared null and void."
  },
  {
    "section": 19,
    "title": "Grounds of decree",
    "description": "Such decree may be made on any of the following grounds:---\n\n(1) that the respondent was impotent at the time of the marriage and at the time of the institution of the suit;\n\n(2) that the parties are within the prohibited degree of consanguinity (whether natural or legal) or affinity;\n\n(3) that either party was a lunatic or idiot at the time of the marriage;\n\n(4) that the former husband or wife of either party was living at the time of the marriage, and the marriage with such former husband or wife was then in force.\n\nNothing in this section shall affect the 1[jurisdiction of the District Court] to make decrees of nullity of marriage on the ground that the consent of either party was obtained by force or fraud."
  },
  {
    "section": 20,
    "title": "[Omitted]",
    "description": "[Confirmation of District Judge's decree.]—Omitted by the Indian Divorce (Amendment) Act, 2001 (51 of 2001), s. 16 (w.e.f. 3-10-2001)."
  },
  {
    "section": 21,
    "title": "Children of annulled marriage",
    "description": "Where a marriage is annulled on the ground that a former\nhusband or wife was living, and it is adjudged that the subsequent marriage was contracted in good\nfaith and with the full belief of the parties that the former husband or wife was dead, or when a\nmarriage is annulled on the ground of insanity, children begotten before the decree is made shall be\nspecified in the decree, and shall be entitled to succeed, in the same manner as legitimate children, to\nthe estate of the parent who at the time of the marriage was competent to contract."
  },
  {
    "section": 22,
    "title": "Bar to decree for divorce a mensa et toro; but judicial separation obtainable by husband or wife",
    "description": "No decree shall hereafter be made for a divorce a mensa et toro, but the husband or wife may obtain a decree of judicial separation, on the ground of adultery, or cruelty, or desertion 1 *** for two years or upwards, and such decree shall have the effect of a divorce a mensa et toro under the existing law, and such other legal effect as here in after mentioned."
  },
  {
    "section": 23,
    "title": "Application for separation made by petition",
    "description": "Application for judicial separation on any one of the grounds aforesaid, may be made by either husband or wife by petition to the District Court 1 ***, and the Court, on being satisfied of the truth of the statements made in such petition, and that there is no legal ground why the application should not be granted, may decree judicial separation accordingly."
  },
  {
    "section": 24,
    "title": "Separated wife deemed spinster with respect to after-acquired property",
    "description": "In every case of a judicial separation under this Act, the wife shall from the date of the sentence, and whilst the separation continues, be considered as unmarried with respect to property of every description which she may acquire, or which may come to or devolve upon her.\n\nSuch property may be disposed of by her in all respects as an unmarried woman, and on her decease the same shall, in case she dies intestate, go as the same would have gone if her husband had been then dead:\n\nProvided that, if any such wife again cohabits with her husband, all such property as she may be entitled to when such cohabitation takes place shall be held to her separate use, subject, however, to any agreement in writing made between herself and her husband whilst separate."
  },
  {
    "section": 25,
    "title": "Separated wife deemed spinster for purposes of contract and suing",
    "description": "In every case of a judicial separation under this Act, the wife shall, whilst so separated, be considered as an unmarried woman for the purposes of contract, and wrongs and injuries, and suing and being sued in any civil proceedings; and her husband shall not be liable in respect of any contact, act or costs entered into, done, omitted or incurred by her during the separation:\n\nProvided that where, upon any such judicial separation, alimony has been decreed or ordered to be paid to the wife, and the same is not duly paid by the husband, he shall be liable for necessaries supplied for her use:\n\nProvided also that nothing shall prevent the wife from joining, at any time during such separation, in the exercise of any joint power given to herself and her husband."
  },
  {
    "section": 26,
    "title": "Decree of separation obtained during absence of husband or wife may be reversed",
    "description": "Any husband or wife, upon the application of whose wife or husband, as the case may be, a decree of judicial separation has been pronounced, may, at any time thereafter, present a petition to the Court by which the decree was pronounced, praying for a reversal of such decree, on the ground that it was obtained in his or her absence, and that there was reasonable excuse for the alleged desertion, where desertion was the ground of such decree.\n\nThe Court may, on being satisfied of the truth of the allegations of such petition reverse the decree accordingly; but such reversal shall not prejudice or affect the rights or remedies which any other person would have had, in case it had not been decreed, in respect of any debts, contracts, or acts of the wife incurred, entered into, or done between the times of the sentence of separation and of the reversal thereof."
  },
  {
    "section": 27,
    "title": "Deserted wife may apply to court for protection",
    "description": "Any wife to whom section 4 of the Indian Succession Act, 1865 (10 of 1865) 1 does not apply, may, when deserted by her husband, present a petition to the District Court 2 ***, at any time after such desertion, for an order to protect any property which she may have acquired or may acquire, and any property of which she may have become possessed or may become possessed after such desertion, against her husband or his creditors, or any person claiming under him."
  },
  {
    "section": 28,
    "title": "Court may grant protection-order",
    "description": "The Court, if satisfied of the fact of such desertion, and that the same was without reasonable excuse, and that the wife is maintaining herself by her own industry or property, may make and give to the wife an order protecting her earnings and other property from her husband and all creditors and persons claiming under him. Every such order shall state the time at which the desertion commenced, and shall, as regards all persons dealing with the wife in reliance thereon, be conclusive as to such time."
  },
  {
    "section": 29,
    "title": "Discharge or variation of orders",
    "description": "The husband or any creditor of, or person claiming under\nhim, may apply to the Court by which such order was made for the discharge or variation thereof, and\nthe Court, if the desertion has ceased, or if for any other reason it thinks fit so to do, may discharge or\nvary the order accordingly."
  },
  {
    "section": 30,
    "title": "Liability of husband seizing wife’s property after notice of order",
    "description": "If the husband, or any\ncreditor of, or person claiming under, the husband, seizes or continues to hold any property of the\nwife after notice of any such order, he shall be liable, at the suit of the wife (which she is hereby\nempowered to bring), to return or deliver to her the specific property, and also to pay her a sum equal\nto double its value."
  },
  {
    "section": 31,
    "title": "Wife’s legal position during continuance of order",
    "description": "So long as any such order of protection\nremains in force the wife shall be and be deemed to have been, during such desertion of her, in the like position in all respects, with regard to property and contracts and suing and being sued, as she\nwould be under this Act if she obtained a decree of judicial separation."
  },
  {
    "section": 32,
    "title": "Petition for restitution of conjugal rights",
    "description": "When either the husband or the wife has,\nwithout reasonable excuse, withdrawn from the society of the other, either wife, or husband may\napply, by petition to the District Court 1\n*** for restitution of conjugal rights, and the Court, on being\nsatisfied of the truth of the statements made in such petition, and that there is no legal ground why the\napplication should not be granted, may decree restitution of conjugal rights accordingly."
  },
  {
    "section": 33,
    "title": "Answer to petition",
    "description": "Nothing shall be pleaded in answer to a petition for restitution of\nconjugal rights, which would not be ground for a suit for judicial separation or for a decree of nullity\nof marriage."
  },
  {
    "section": 34,
    "title": "Omitted",
    "description": "[Husband may claim damages from adulterer.]--Omitted by the Indian Divorce (Amendment) Act, 2001 (51 of 2001), s. 19 (w.e.f. 3-10-2001)."
  },
  {
    "section": 35,
    "title": "[Omitted]",
    "description": "[Power to order adulterer to pay costs.]--Omitted by s. 20, ibid. (w.e.f. 3-10-2001)."
  },
  {
    "section": 36,
    "title": "Alimony pendente lite",
    "description": "In any suit under this Act, whether it be instituted by a husband or a wife, and whether or not she has obtained an order of protection 1[the wife may present a petition for expenses of the proceedings and alimony pending the suit.]\n\nSuch petition shall be served on the husband; and the Court, on being satisfied of the truth of the statements therein contained, may make such order on the husband 2[for payment to the wife of the expenses of the proceedings and alimony pending the suit] alimony pending the suit as it may deem just:\n\n3* * * * *\n\n4[Provided further that the petition for the expenses of the proceedings and alimony pending the suit, shall, as far as possible, be disposed of within sixty days of service of such petition on the husband.]"
  },
  {
    "section": 37,
    "title": "Power to order permanent alimony",
    "description": "1[Where a decree of dissolution of the marriage or a decree of judicial separation is obtained by the wife, the District Court may order that the husband shall] to the satisfaction of the court, secure to the wife such gross sum of money, or such annual sum of money for any term not exceeding her own life, as, having regard to her fortune (if any), to the ability of the husband, and to the conduct of the parties, it thinks reasonable; and for that purpose may cause a proper instrument to be executed by all necessary parties.\n\nPower to order monthly or weekly payments.-- In every such case the Court may make an order on the husband for payment to the wife of such monthly or weekly sums for her maintenance and support as the Court may think reasonable:\n\nProvided that if the husband afterwards from any cause becomes unable to make such payments, it shall be lawful for the Court to discharge or modify the order, or temporarily to suspend the same as to the whole or any part of the money so ordered to be paid, and again to revive the same order wholly or in part as to the court seems fit."
  },
  {
    "section": 38,
    "title": "Court may direct payment of alimony to wife or to her trustee",
    "description": "In all cases in which the Court makes any decree or order for alimony, it may direct the same to be paid either to the wife herself, or to any trustee on her behalf to be approved by the court, and may impose any terms or restrictions which to the Court seem expedient, and may from time to time appoint a new trustee, if it appears to the Court expedient so to do."
  },
  {
    "section": 39,
    "title": "Omitted",
    "description": "[ Power to order settlement of wife's property for benefit of husband and children.]--Omitted by the Indian Divorce (Amendment) Act, 2001 (51 of 2001), s. 23 (w.e.f. 3-10-2001)."
  },
  {
    "section": 40,
    "title": "Inquiry into existence of ante-nuptial or post-nuptial settlements",
    "description": "1[The District Court may, before passing a decree for dissolution of the marriage or a decree of nullity of marriage, inquire into] the existence of ante-nuptial or post-nuptial settlements made on the parties whose marriage is the subject of the decree, and may make such orders, with reference to the application of the whole or a portion of the property settled, whether for the benefit of the husband or the wife, or of the children (if any) of the marriage, or of both children and parents, as to the Court seems fit:\n\nProvided that the Court shall not make any order for the benefit of the parents or either of them at the expense of the children."
  },
  {
    "section": 41,
    "title": "Power to make orders as to custody of children in suit for separation",
    "description": "In any suit for obtaining a judicial separation the Court may from time to time, before making its decree, make such interim orders, and may make such provision in the decree, as it deems proper with respect to the custody, maintenance and education of the minor children, the marriage of whose parents is the subject of such suit, and may, if it thinks fit, direct proceedings to be taken for placing such children under the protection of the said Court:\n\n1[Provided that the application with respect to the maintenance and education of the minor children pending the suit, shall, as far as possible, be disposed of within sixty days from the date of service of notice on the respondent.]"
  },
  {
    "section": 42,
    "title": "Power to make such orders after decree",
    "description": "The court, after a decree of judicial separation, may upon application (by petition) for this purpose make, from time to time, all such orders and provisions, with respect to the custody, maintenance and education of the minor children, the marriage of whose parents is the subject of the decree, or for placing such children under the protection of the said court, as might have been made by such decree or by interim orders in case the proceedings for obtaining such decree were still pending."
  },
  {
    "section": 43,
    "title": "Power to make orders as to custody of children in suits for dissolution or nullity",
    "description": "1[In any suit for obtaining a dissolution of marriage or a decree of nullity of marriage instituted in a District Court, the Court may from time to time before making its decree, make such interim orders as it may deem proper] with respect to the custody, maintenance and education of the minor children, the marriage of whose parents is the subject of the suit,\n\nand may, if it thinks fit, direct proceedings to be taken for placing such children under the protection of the court."
  },
  {
    "section": 44,
    "title": "Power to make such orders after decree or confirmation",
    "description": "1[Where a decree of dissolution or nullity of marriage has been passed, the District Court may, upon application] by petition for the purpose, make from time to time all such orders and provisions, with respect to the custody, maintenance and education of the minor children, the marriage of whose parents was the subject of the decree, or for placing such children under the protection of the said court, as might have been made by such decree absolute or decree (as the case may be), or by such interim orders as aforesaid."
  },
  {
    "section": 45,
    "title": "Code of Civil Procedure to apply",
    "description": "Subject to the provisions herein contained, all proceedings under this Act between party and party shall be regulated by the 1[Code of Civil Procedure, 1908 (5 of 1908).]"
  },
  {
    "section": 46,
    "title": "Forms of petitions and statements",
    "description": "The forms set forth in the Schedule to this Act, with\nsuch variation as the circumstances of each case require, may be used for the respective purposes\nmentioned in such Schedule."
  },
  {
    "section": 47,
    "title": "Petition to state absence of collusion",
    "description": "Every petition under this Act for a decree of dissolution of marriage, or of nullity of marriage, or of judicial separation 1 *** shall 2 *** state that there is not any collusion or connivance between the petitioner and the other party to the marriage.\n\nStatements to be verified.--The statements contained in every petition under this Act shall be verified by the petitioner or some other competent person in manner required by law for the verification of plaints, and may at the hearing be referred to as evidence."
  },
  {
    "section": 48,
    "title": "Suits on behalf of lunatics",
    "description": "When the husband or wife is a lunatic or idiot, any suit under this Act (other than a suit for restitution of conjugal rights) may be brought on his or her behalf by the committee or other person entitled to his or her custody."
  },
  {
    "section": 49,
    "title": "Suits by minors",
    "description": "Where the petitioner is a minor, he or she shall sue by his or her next friend to be approved by the Court; and no petition presented by a minor under this Act shall be filed until the next friend has undertaken in writing to be answerable for costs. Such undertaking 1 *** shall be filed in Court, and the next friend shall thereupon be liable in the same manner and to the same extent as if he were a plaintiff in an ordinary suit."
  },
  {
    "section": 50,
    "title": "Service of petition",
    "description": "Every petition under this Act shall be served on the party to be affected thereby, either within or without 1[India], in such manner as the High Court by general or special order from time to time directs.\n\nProvided that the court may dispense with such service altogether in case it seems necessary or expedient so to do."
  },
  {
    "section": 51,
    "title": "Mode of taking evidence",
    "description": "The witnesses in all proceedings before the court, where their attendance can be had, shall be examined orally, and any party may offer himself or herself as a witness, and shall be examined, and may be cross-examined and re-examined, like any other witness:\n\nProvided that the parties shall be at liberty to verify their respective cases in whole or in part by affidavit, but so that the deponent in every such affidavit shall, on the application of the opposite party, or by direction of the Court, be subject to be cross-examined by or on behalf of the opposite party orally, and after such cross-examination may be re-examined orally as aforesaid by or on behalf of the party by whom such affidavit was filed."
  },
  {
    "section": 52,
    "title": "Competence of husband and wife to give evidence as to cruelty or desertion",
    "description": "On any petition presented, 1[by a husband or a wife, praying that his or her marriage may be dissolved by reason of his wife or her husband, as the case may be, having been guilty of adultery, cruelty or desertion], the husband and wife respectively shall be competent and compellable to give evidence of or relating to such cruelty or desertion."
  },
  {
    "section": 53,
    "title": "Power to close doors",
    "description": "The whole or any part of any proceeding under this Act may be heard,\nif the Court thinks fit, with closed doors."
  },
  {
    "section": 54,
    "title": "Power to adjourn",
    "description": "The Court may, from time to time, adjourn the hearing of any petition under this Act, and may require further evidence thereon if it sees fit so to do."
  },
  {
    "section": 55,
    "title": "Enforcement of, and appeals from, orders and decrees",
    "description": "All decrees and orders made by the Court in any suit or proceedings under this Act shall be enforced and may be appealed from, in the like manner as the decrees and orders of the Court made in the exercise of its original civil jurisdiction are enforced and may be appealed from, under the laws, rules and orders for the time being in force:\n\n1 * * * * *\n\nNo appeal as to costs.--2[Provided] that there shall be no appeal on the subject of costs only."
  },
  {
    "section": 56,
    "title": "Appeal to the Supreme Court",
    "description": "Any person may appeal to 1[the Supreme Court] from any decree (other than a decree nisi) or order under this Act of a High Court made on appeal or otherwise, and from any decree (other than a decree nisi) or order made in the exercise of original jurisdiction by Judges of a High Court or of any Division Court from which an appeal shall not lie to the High Court, when the High Court declares that the case is a fit one for appeal to 1[the Supreme Court.]"
  },
  {
    "section": 57,
    "title": "Liberty to parties to marry again",
    "description": "1[57. Liberty to parties to marry again.— Where a decree for dissolution or nullity of marriage has been passed and either the time for appeal has expired without an appeal having been presented to any court including the Supreme Court or an appeal has been presented but has been dismissed and the decree or dismissal has become final, it shall be lawful for either party to the marriage to marry again.]"
  },
  {
    "section": 58,
    "title": "English clergyman not compelled to solemnize marriages of persons divorced for adultery",
    "description": "No clergyman in Holy Orders of the 1 *** Church of England 2 *** shall be compelled to solemnize the marriage of any-person whose former marriage has been dissolved on the ground of his or her adultery, or shall be liable to any suit, penalty or censure for solemnizing or refusing to solemnize the marriage of any such person."
  },
  {
    "section": 59,
    "title": "English Minister refusing to perform ceremony to permit use of his Church",
    "description": "When any Minister of any Church or Chapel of the said 1 *** Church refuses to perform such marriage-service between any persons who but for such refusal would be entitled to have the same service performed in such Church or Chapel, such Minister shall permit any other Minister in Holy Orders of the said Church, entitled to officiate within the diocese in which such Church or Chapel is situate, to perform such marriage-service in such Church or Chapel."
  },
  {
    "section": 60,
    "title": "Decree for separation or protection-order valid as to persons dealing with wife before reversal",
    "description": "Every decree for judicial separation or order to protect property, obtained by a wife under this Act shall, until reversed or discharged, be deemed valid, so far as necessary, for the protection of any person dealing with the wife.\n\nNo reversal, discharge or variation of such decree or order shall affect any rights or remedies which any person would otherwise have had in respect of any contracts or acts of the wife entered into or done between the dates of such decree or order, and of the reversal, discharge or variation thereof.\n\nIndemnity of persons making payment to wife without notice of reversal of decree or protection order.-- All persons who in reliance on any such decree or order make any payment to, or permit any transfer or act to be made or done by, the wife who has obtained the same shall, notwithstanding such decree or order may then have been reversed, discharged or varied, or the separation of the wife from her husband may have ceased, or at some time since the making of the decree or order been discontinued, be protected and indemnified as if, at the time of such payment, transfer or other act, such decree or order were valid and still subsisting without variation, and the separation had not ceased or been discontinued,\n\nunless, at the time of the payment, transfer or other act, such persons had notice of the reversal, discharge or variation of the decree or order or of the cessation or discontinuance of the separation."
  },
  {
    "section": 61,
    "title": "Bar of suit for criminal conversation",
    "description": "After this Act comes into operation, no person\ncompetent to present a petition under sections 2 and 10 shall maintain a suit for criminal conversation\nwith his wife."
  },
  {
    "section": 62,
    "title": "Power to make rules",
    "description": "The High Court shall make such rules under this Act as it may from time to time consider expedient, and may from time to time alter and add to the same:\n\nProvided that such rules, alterations and additions are consistent with the provisions of this Act and the 1[Code of Civil Procedure, 1908 (5 of 1908)].\n\nAll such rules, alteration and additions shall be published in the Official Gazette."
  }
]