[
  {
    "chapter": 1,
    "section": 1,
    "section_title": "Short title, extent and Commencement",
    "section_desc": "This Act may be called the Indian Evidence Act, 1872.\nIt extends to the whole of India except the State of Jammu and Kashmir and applies to all judicial proceedings in or before any Court, including Courts-martial, other than Court-martial convened under the Army Act (44 & 45 Vict., c. 58) the Naval Discipline Act (29 & 30 Vict., c. 109) or  the Indian Navy (Discipline) Act, 1934 (34 of 1934) or the Air Force Act (7 Gco. 5, c. 51) but not to affidavits presented to any Court or Officer, not to proceedings before an arbitrator;\nAnd it shall come into force on the first day of September, 1872."
  },
  {
    "chapter": 1,
    "section": 2,
    "section_title": "Repeal of enactments",
    "section_desc": "Rep. by the Repealing Act, 1938 (1 of 1938) section 2 and Schedule"
  },
  {
    "chapter": 1,
    "section": 3,
    "section_title": "Interpretation clause",
    "section_desc": "In this Act the following words and expressions are used in the following senses, unless a contrary intention appears from the context—\nCourt: Court includes all Judges and Magistrates, and all persons, except arbitrators, legally authorized to take evidence.\nFact: Fact means and includes—\n\t\n\t\tany thing, state of things, or relation of things, capable of being perceived by the senses;\n\t\tany mental condition of which any person is conscious.\nRelevant: One fact is said to be relevant to another when the one is connected with the other in any of the ways referred to in the provisions of this Act relating to the relevancy of facts.\nFacts in issue: The expression facts in issue means and includes-any fact from which, either by itself or in connection with other facts, the existence, non-existence, nature or extent of any right, liability, or disability asserted or denied in any suit or proceeding, necessarily follows.\nDocument: Document means any matter expressed or described upon any substance by means of letters, figures or marks, or by more than one of those means, intended to be used or which may be used for the purpose of recording that matter.\nEvidence: Evidence means and includes—\n\t\tall statements which the Court permits or requires to be made before it by witnesses, in relation to matters of fact under inquiry;\nsuch statements are called oral evidence;\n\t\tall documents including electronic records produced for the inspection of the Court;\nsuch documents are called documentary evidence.\nProved: A fact is said to be proved when, after considering the matters before it, the Court either believes it to exist, or considers its existence so probable that a prudent man ought, under the circumstances of the particular case, to act upon the supposition that it exists.\nDisproved: A fact is said to be disproved when, after considering the matters before it, the Court either believes that it does not exist, or considers its non-existence so probable that a prudent man ought, under the circumstances of the particular case, to act upon the supposition that it does not exist.\nNot proved: A fact is said to be not proved when it is neither proved nor disproved.\nIndia: India means the territory of India excluding the State of Jammu and Kashmir.\nThe expressions Certifying Authority, digital signature, Digital Signature Certificate, electronic form, electronic records, information, secure electronic record, secure digital signature and subscriber shall have the meanings respectively assigned to them in the Information Technology Act, 2000."
  },
  {
    "chapter": 1,
    "section": 4,
    "section_title": "Presumption and Proof",
    "section_desc": "May presume: Whenever it is proved by this Act that Court may presume a fact, it may either regard such fact as proved, unless and until it is disproved, or may call for proof of it.\nShall presume: whenever it is directed by this Act that the Court shall presume a fact, it shall regard such fact as proved, unless and until it is disproved.\nConclusive proof: When one fact is declared by this Act to be conclusive proof of another, the Court shall, on proof of the one fact, regard the other as proved, and shall not allow evidence to be given for the purpose of disproving it."
  },
  {
    "chapter": 2,
    "section": 5,
    "section_title": "Evidence may be given of facts in issue and relevant facts",
    "section_desc": "Evidence may be given in any suit or proceeding of the existence or non-existence of every fact in issue and of such other facts as are hereinafter declared to be relevant, and of no others."
  },
  {
    "chapter": 2,
    "section": 6,
    "section_title": "Relevancy of facts forming part of same transaction",
    "section_desc": "Facts which, though not in issue, are so connected with a fact in issue as to form part of the same transaction, are relevant, whether they occurred at the same time and place or at different times and places."
  },
  {
    "chapter": 2,
    "section": 7,
    "section_title": "Facts which are the occasion, cause or effect of facts in issue",
    "section_desc": "Facts which are the occasion, cause, or effect, immediate or otherwise, of relevant facts, or facts in issue, or which constitute the state of things under which they happened, or which afforded an opportunity for their occurrence or transaction, are relevant."
  },
  {
    "chapter": 2,
    "section": 8,
    "section_title": "Motive, preparation and previous or subsequent conduct",
    "section_desc": "Any fact is relevant which shows or constitutes a motive or preparation for any fact in issue or relevant fact.\nThe conduct of any party, or of any agent to any party, to any suit or proceeding, in reference to such suit or proceeding, or in reference to a fact in issue therein or relevant thereto, and the conduct of any person an offence against whom is the subject of any proceeding, is relevant, if such conduct influences or is influenced by any fact in issue or relevant fact, and whether it was previous or subsequent thereto."
  },
  {
    "chapter": 2,
    "section": 9,
    "section_title": "Facts necessary to explain or introduce relevant facts",
    "section_desc": "Facts necessary to explain or introduce a fact in issue or relevant fact, or which support or rebut an inference suggested by a fact in issue or relevant fact, or which establish the identity of any thing or person whose identity is relevant, or fix the time or place at which any fact in issue or relevant fact happened, or which show the relation of parties by whom any such fact was transacted, are relevant in so far as they are necessary for that purpose."
  },
  {
    "chapter": 2,
    "section": 10,
    "section_title": "Things said or done by conspirator in reference to common design",
    "section_desc": "Where there is reasonable ground to believe that two or more persons have conspired together to commit an offence or an actionable wrong, anything said, done or written by any one of such persons in reference to their common intention, after the time when such intention was first entertained by any one of them, is a relevant fact as against each of the persons believed to so conspiring, as well for the purpose of proving the existence of the conspiracy as for the purpose of showing that any such person was a party to it."
  },
  {
    "chapter": 2,
    "section": 11,
    "section_title": "When facts not otherwise relevant become relevant",
    "section_desc": "Facts not otherwise relevant are relevant—\n\t\n\t\tif they are inconsistent with any fact in issue or relevant fact;\n\t\tif by themselves or in connection with other facts they make the existence or non-existence of any fact in issue or relevant fact highly probable or improbable."
  },
  {
    "chapter": 2,
    "section": 12,
    "section_title": "In suits for damages, facts tending to enable Court to determine amount are relevant",
    "section_desc": "In suits in which damages are claimed, any fact which will enable the Court to determine the amount of damages which ought to be awarded, is relevant."
  },
  {
    "chapter": 2,
    "section": 13,
    "section_title": "Facts relevant when right or custom is in question",
    "section_desc": "Where the question is as to the existence of any right or custom, the following facts are relevant—\n\t\n\t\tany transaction by which the right or custom in question was created, claimed, modified, recognized, asserted, or denied, or which was inconsistent with its existence;\n\t\tparticular instances in which the right or custom was claimed, recognized, or exercised or in which its exercise was disputed, asserted or departed from."
  },
  {
    "chapter": 2,
    "section": 14,
    "section_title": "Facts showing existence of state of mind, or of body or bodily feeling",
    "section_desc": "Facts showing the existence of any state of mind, such as intention, knowledge, good faith, negligence, rashness, ill-will or good-will towards any particular person, or showing the existence of any state of body or bodily feeling, are relevant, when the existence of any such state of mind or body or bodily feeling, is in issue or relevant."
  },
  {
    "chapter": 2,
    "section": 15,
    "section_title": "Facts bearing on question whether act was accidental or intentional",
    "section_desc": "When there is a question whether an act was accidental or intentional, or done with a particular knowledge or intention, the fact that such act formed part of a series of similar occurrences, in each of which the person doing the act was concerned, is relevant."
  },
  {
    "chapter": 2,
    "section": 16,
    "section_title": "Existence of course of business when relevant",
    "section_desc": "When there is a question whether a particular act was done, the existence of any course of business, according to which it naturally would have been done, is a relevant fact."
  },
  {
    "chapter": 2,
    "section": 17,
    "section_title": "Admission defined",
    "section_desc": "An admission is a statement, oral or documentary or contained in electronic form, which suggests any inference as to any fact in issue or relevant fact, and which is made by any of the persons, and under the circumstances, hereinafter mentioned."
  },
  {
    "chapter": 2,
    "section": 18,
    "section_title": "Admission by party to proceeding or his agent by suitor in representative character",
    "section_desc": "Statements made by a party to the proceeding, or by an agent to any such party, whom the Court regards, under the circumstances of the case, as expressly or impliedly authorized by him to make them, are admissions.\nby suitor in representative character: Statements made by parties to suits suing or sued in a representative character, are not admissions, unless they were made while the party making them held that character.\nStatements made by—\n\t\n\t\tparty interested in subject-matter: persons who have any proprietary or pecuniary interest in the subject-matter of the proceeding, and who make the statement in their character of persons so interested, or\n\t\tperson from whom interest derived: persons from whom the parties to the suit have derived their interest in the subject-matter of the suit, are admissions, if they are made during the continuance of the interest of the persons making the statements."
  },
  {
    "chapter": 2,
    "section": 19,
    "section_title": "Admissions by persons whose position must be proved as against party to suit",
    "section_desc": "Statements made by persons whose position or liability, it is necessary to prove as against any party to the suit, are admissions, if such statements would be relevant as against such persons in relation to such position or liability in a suit brought by or against them, and if they are made whilst the person making them occupies such position or is subject to such liability."
  },
  {
    "chapter": 2,
    "section": 20,
    "section_title": "Admissions by persons expressly referred to by party to suit",
    "section_desc": "Statements made by persons to whom a party to the suit has expressly referred for information in reference to a matter in dispute are admissions."
  },
  {
    "chapter": 2,
    "section": 21,
    "section_title": "Proof of admissions against persons making them, and by or on their behalf",
    "section_desc": "Admissions are relevant and may be proved as against the person who makes them or his representative in interest; but they cannot be proved by or on behalf of the person who makes them or by his representative in interest, except in the following cases—\n\t\n\t\tAn admission may be proved by or on behalf of the person making it, when it is of such a nature that, if the person making it were dead, it would be relevant as between third persons under section 32.\n\t\tAn admission may by proved by or on behalf of the person making it, when it consists of a statement of the existence of any state of mind or body, relevant or in issue, made at or about the time when such state of mind or body existed, and is accompanied by conduct rendering its falsehood improbable.\n\t\tAn admission may be proved by on behalf of the person making it, if it is relevant otherwise than as an admission."
  },
  {
    "chapter": 2,
    "section": 22,
    "section_title": "When oral admissions as to contents of documents are relevant",
    "section_desc": "Oral admissions as to the contents of a document are not relevant, unless and until the party proposing to prove them shows that he is entitled to give secondary evidence of the contents of such document under the rules hereinafter contained, or unless the genuineness of a document produced is in question."
  },
  {
    "chapter": 2,
    "section": "22A",
    "section_title": "When oral admission as to contents of electronic records are relevant",
    "section_desc": "Oral admissions as to the contents of electronic records are not relevant, unless the genuineness of the electronic record produced is in question."
  },
  {
    "chapter": 2,
    "section": 23,
    "section_title": "Admissions in civil cases, when relevant",
    "section_desc": "In civil cases no admission is relevant, if it is made either upon an express condition that evidence of it is not to be given, or under circumstances from which the Court can infer that the parties agreed together that evidence of it should not be given."
  },
  {
    "chapter": 2,
    "section": 24,
    "section_title": "Confession caused by inducement, threat or promise, when irrelevant in criminal proceeding",
    "section_desc": "A confession made by an accused person is irrelevant in a criminal proceeding, if the making of the confession appears to the Court to have been caused by any inducement, threat or promise1, having reference to the charge against the accused person, proceeding from a person in authority and sufficient, in the opinion of the Court, to give the accused person grounds, which would appear to him reasonable, for supposing that by making it he would gain any advantage or avoid any evil of a temporal nature in reference to the proceedings against him."
  },
  {
    "chapter": 2,
    "section": 25,
    "section_title": "Confession to police officer not to be proved",
    "section_desc": "No confession made to a police officer1, shall be proved as against a person accused of any offence."
  },
  {
    "chapter": 2,
    "section": 26,
    "section_title": "Confession by accused while in custody of police not to be proved against him",
    "section_desc": "No confession made by any person whilst the is in the custody of a police officer, unless it be made in the immediate presence of a Magistrate1, shall be proved as against such person."
  },
  {
    "chapter": 2,
    "section": 27,
    "section_title": "How much of information received from accused may be proved",
    "section_desc": "Provided that, when any fact is deposed to as discovered in consequence of information received from a person accused of any offence, in the custody of a police officer, so much of such information, whether it amounts to a confession or not, as relates distinctly to the fact thereby discovered, may be proved."
  },
  {
    "chapter": 2,
    "section": 28,
    "section_title": "Confession made after removal of impression caused by inducement, threat or promise relevant",
    "section_desc": "If such a confession as is referred to in section 24 is made after the impression caused by any such inducement, threat or promise has, in the opinion of the Court, been fully removed, it is relevant."
  },
  {
    "chapter": 2,
    "section": 29,
    "section_title": "Confession otherwise relevant not to become irrelevant because of promise of secrecy, etc",
    "section_desc": "If such a confession is otherwise relevant, it docs not become irrelevant merely because it was made under a promise of secrecy, or in consequence of a deception practiced on the accused person for the purpose of obtaining it, or when he was drunk, or because it was made in answer to questions which he need not have answered, whatever may have been the form of those questions, or because he was not warned that he was not bound to make such confession, and that evidence of it might be given against him."
  },
  {
    "chapter": 2,
    "section": 30,
    "section_title": "Consideration of proved confession affecting person making it and others jointly under trial for same offence",
    "section_desc": "When more persons than one are being tried jointly for the same offence, and a confession made by one of such persons affecting himself and some other of such persons is proved, the Court may take into consideration such confession as against such other person as well as against the person who makes such confession."
  },
  {
    "chapter": 2,
    "section": 31,
    "section_title": "Admissions not conclusive proof, but may estop",
    "section_desc": "Admissions are not conclusive proof of the matters admitted but they may operate as estoppels under the provisions hereinafter contained."
  },
  {
    "chapter": 2,
    "section": 32,
    "section_title": "Cases in which statement of relevant fact by person who is dead or cannot be found, etc., is relevant",
    "section_desc": "Statements, written or verbal, of relevant facts made by a person who is dead, or who cannot be found, or who has become incapable of giving evidence, or whose attendance cannot be procured, without an amount of delay or expense which under the circumstances of the case appears to the Court unreasonable, are themselves relevant facts in the following cases—\n\t\n\t\twhen it relates to cause of death: When the statement is made by a person as to the cause of his death, or as to any of the circumstances of the transaction which resulted in his death, in cases in which the cause of that person’s death comes into question.\nSuch statements are relevant whether the person who made them was or was not, at the time when they were made, under expectation of death, and whatever may be the nature of the proceeding in which the cause of his death comes into question.\n\t\tor is made in course of business: When the statement was made by such person in the ordinary course of business, and in particular when it consists of any entry or memorandum made by him in books kept in the ordinary course of business, or in the discharge of professional duly; or of an acknowledgment written or signed by him of the receipt of money, goods, securities or property of any kind; or of a document used in commerce written or signed by him; or of the date of a letter or other document usually dated, written or signed by him.\n\t\tor against interest of maker: When the statement is against the pecuniary or proprietary interest of the person making it or when, if true, it would expose him or would have exposed him to a criminal prosecution or to a suit for damages.\n\t\tor gives opinion as to public right or custom, or matters of general interests: When the statement gives the opinion of any such person, as to the existence of any public right or custom or matter of public or general interest, of the existence of which, if it existed he would have been likely to be aware, and when such statement was made before any controversy as to such right, custom or matter had arisen.\n\t\tor relates to existence of relationship: When the statement relates to the existence of any relationship by blood, marriage or adoption between persons as to whose relationship by blood, marriage or adoption the person making the statement had special means of knowledge, and when the statement was made before the question in dispute was raised.\n\t\tor is made in will or deed relating to family affairs: When the statement relates to the existence of any relationship by blood, marriage or adoption between persons deceased, and is made in any will or deed relating to the affairs of the family to which any such deceased person belonged, or in any family pedigree, or upon any tombstone, family portrait, or other thing on which such statements are usually made, and when such statement was made before the question in dispute was raised.\n\t\tor is document relating to transaction mentioned in section 13, clause (a): When the statement is contained in any deed, will or other document which relates to any such transaction as is mentioned in section 13, clause (a).\n\t\tor is made by several persons and expresses feelings relevant to matter in question: When the statement was made by a number of persons, and expressed feelings or impressions on their pan relevant to the matter in question."
  },
  {
    "chapter": 2,
    "section": 33,
    "section_title": "Relevancy of certain evidence for proving, in subsequent proceeding, the truth of facts therein stated",
    "section_desc": "Evidence given by a witness in a judicial proceeding or before any person authorized by law to take it, is relevant for the purpose of proving, in a subsequent judicial proceeding, or in a later stage of the same judicial proceeding, the truth of the facts which it states, when the witness is dead or cannot be found, or is incapable of giving evidence, or is kept out of the way by the adverse party, or if his presence cannot be obtained without an amount of delay or expense which, under the circumstances of the case, the Court considers unreasonable;\nProvided—\nthat the proceeding was between the same parties or their representatives in interest;\nthat the adverse party in the first proceeding had the right and opportunity to cross-examine;\nthat the questions in issue were substantially the same in the first as in the second proceeding."
  },
  {
    "chapter": 2,
    "section": 34,
    "section_title": "Entries in books of account including those maintained in an electronic form when relevant",
    "section_desc": "Entries in books of accounts including those maintained in an electronic form, regularly kept in the course of business, are relevant whenever they refer to a matter into which the Court has to inquire, but such statements shall not alone be sufficient evidence to charge any person with liability."
  },
  {
    "chapter": 2,
    "section": 35,
    "section_title": "Relevancy of entry in public record or an electronic record made in performance of duty",
    "section_desc": "An entry in any public or other official book, register or record or an electronic record, stating a fact in issue or relevant fact, and made by a public servant in the discharge of his official duty, or by any other person in performance of a duty specially enjoined by the law of the country in which such book, register, or record or an electronic record is kept, is itself a relevant fact."
  },
  {
    "chapter": 2,
    "section": 36,
    "section_title": "Relevancy of statements in maps, charts and plans",
    "section_desc": "Statements of facts in issue or relevant facts, made in published maps or charts generally offered for public sale, or in maps or plans made under the authority of the Central Government or any State Government, as to matters usually represented or stated in such maps, charts or plans, are themselves relevant facts."
  },
  {
    "chapter": 2,
    "section": 37,
    "section_title": "Relevancy of statement as to fact to public nature, contained in certain Acts or notifications",
    "section_desc": "When the Court has to form an opinion as to the existence of any fact of a Public nature, any statement of it, made in a recital contained in any Act of Parliament of the United Kingdom, or in any Central Act, Provincial Act, or a State Act, or in a Government notification or notification by the Crown Representative appearing in the Official Gazette or in any printed paper purporting to be the London Gazette or the Government Gazette of any Dominion, colony or possession of His Majesty is a relevant fact."
  },
  {
    "chapter": 2,
    "section": 38,
    "section_title": "Relevancy of statements as to any law contained in law-books",
    "section_desc": "When the Court has to form an opinion as to a law of any country, any statement of such law contained in a book purporting to be printed or published under the authority of the Government of such country and to contain any such law, and any report of a ruling of the Courts of such country contained in a book purporting to be a report of such rulings, is relevant."
  },
  {
    "chapter": 2,
    "section": 39,
    "section_title": "What evidence to be given when statement forms part of a conversation, document, electronic record, book or series of letters or papers",
    "section_desc": "When any statement of which evidence is given forms part of a longer statement, or of a conversation or part of an isolated document, or is contained in a document which forms part of a book, or is contained in part of electronic record or a connected series of letters or papers, evidence shall be given of so much and no more of the statement, conversation, document, electronic record, book or series of letters or papers as the Court considers necessary in that particular case to the full understanding of the nature and effect of the statement, and of the circumstances under which it was made."
  },
  {
    "chapter": 2,
    "section": 40,
    "section_title": "Previous judgments relevant to bar a second suit or trial",
    "section_desc": "The existence of any judgment, order or decree which by law prevents any Courts from taking cognizance of a suit or holding a trial is a relevant fact when the question is whether such Court ought to take cognizance of such suit or to hold such trial."
  },
  {
    "chapter": 2,
    "section": 41,
    "section_title": "Relevancy of certain judgments in probate, etc., jurisdiction",
    "section_desc": "A final judgment, order or decree of a competent Court, in the exercise of probate, matrimonial admiralty or insolvency jurisdiction which confers upon or takes away from any person any legal character, or which declares any person to be entitled to any such character, or to be entitled to any specific thing, not as against any specified person but absolutely, is relevant when the existence of any such legal character, or the title of any such person to any such thing, is relevant.\nSuch judgment, order or decree is conclusive proof—\nthat any legal character which it confers accrued at the time when such judgment, order or decree came into operation;\nthat any legal character, to which it declares any such person to be entitled, accrued, to that person at the time when such judgment, order or decree declares it to have accrued to that person;\nthat any legal character which it takes away from any such person ceased at the time from which such judgment, order or decree declared that it had ceased or should cease;\nand that anything to which it declares any person to be so entitled was the property of that person at the time from which such judgment, order or decree declares that it had been or should be his property."
  },
  {
    "chapter": 2,
    "section": 42,
    "section_title": "Relevancy and effect of judgments, orders or decrees, other than those mentioned in section 41",
    "section_desc": "Judgments, orders or decrees other than those mentioned in section 41, are relevant if they relate to matters of a public nature relevant to the enquiry, but such judgments, orders or decrees are not conclusive proof of that which they state."
  },
  {
    "chapter": 2,
    "section": 43,
    "section_title": "Judgments, etc., other than those mentioned in sections 40 to 42, when relevant",
    "section_desc": "Judgments, orders or decrees, other than those mentioned in sections 40, 41 and 42 are irrelevant, unless the existence of such judgment, order or decree, is a fact in issue, or is relevant under some other provisions of this Act."
  },
  {
    "chapter": 2,
    "section": 44,
    "section_title": "Fraud or collusion in obtaining judgment, or incompetency of Court, may be proved",
    "section_desc": "Any party to a suit or other proceeding may show that any judgment, order or decree which is relevant under sections 40, 41 or 42 and which has been proved by the adverse party, was delivered by a Court not competent to deliver it, or was obtained by fraud or collusion."
  },
  {
    "chapter": 2,
    "section": 45,
    "section_title": "Opinions of experts",
    "section_desc": "When the Court has to form an opinion upon a point of foreign law or of science or art, or as identity of handwriting or finger impressions, the opinions upon that point of persons specially skilled in such foreign law, science or art, or in questions as to identity of handwriting or finger impressions are relevant facts.\nSuch persons are called experts."
  },
  {
    "chapter": 2,
    "section": 46,
    "section_title": "Facts bearing upon opinions of experts",
    "section_desc": "Facts, not otherwise relevant, are relevant if they support or are inconsistent with the opinion of experts, when such opinions are relevant."
  },
  {
    "chapter": 2,
    "section": 47,
    "section_title": "Opinion as to handwriting, when relevant",
    "section_desc": "When the Court has to form an opinion as to the person by whom any document was written or signed, the opinion of any person acquainted with the handwriting of the person by whom it is supposed to be written or signed that it was or was not written or signed by that person, is a relevant fact."
  },
  {
    "chapter": 2,
    "section": "47A",
    "section_title": "Opinion as to digital signature when relevant",
    "section_desc": "When the Court has to form an opinion as to the digital signature of any person, the opinion of the Certifying Authority which has issued the Digital Signature Certificate is a relevant fact."
  },
  {
    "chapter": 2,
    "section": 48,
    "section_title": "Opinion as to existence of right or custom, when relevant",
    "section_desc": "When the Court has to form an opinion as to the existence of any general custom or right, the opinions, as to the existence of such custom or right, of persons who would be likely to know of its existence if it existed, are relevant."
  },
  {
    "chapter": 2,
    "section": 49,
    "section_title": "Opinion as to usages, tenets, etc., when relevant",
    "section_desc": "When the Court has to form an opinion as to—\nthe usages and tenets of any body of men or family,\nthe constitution and government of any religious or charitable foundation, or\nthe meaning of words or terms used in particular districts or by particular classes of people,\nthe opinions of persons having special means of knowledge thereon, are relevant facts."
  },
  {
    "chapter": 2,
    "section": 50,
    "section_title": "Opinion or relationship, when relevant",
    "section_desc": "When the Court has to form an opinion as to the relationship of one person to another, the opinion, expressed by conduct, as to the existence of such relationship, or any person who, as a member of the family or otherwise, has special means of knowledge on the subject, is relevant fact;\nProvided that such opinion shall not be sufficient to prove a marriage in proceedings under the Indian Divorce Act, 1869 (4 of 1869) or in prosecutions under sections 494, 495, 497 or 498 of the Indian Penal Code (45 of 1860)."
  },
  {
    "chapter": 2,
    "section": 51,
    "section_title": "Grounds of opinion, when relevant",
    "section_desc": "Whenever the opinion of any living person is relevant, the grounds on which such opinion is based are also relevant."
  },
  {
    "chapter": 2,
    "section": 52,
    "section_title": "In civil cases character to prove conduct imputed, irrelevant",
    "section_desc": "In civil cases, the fad that the character of any person concerned is such as to render probable or improbable any conduct imputed to him, is irrelevant, except in so far as such character appears from facts otherwise relevant."
  },
  {
    "chapter": 2,
    "section": 53,
    "section_title": "In criminal cases, previous good character relevant",
    "section_desc": "In criminal proceedings, the fact that the person accused is of a good character, is relevant."
  },
  {
    "chapter": 2,
    "section": "53A",
    "section_title": "Evidence of character or previous sexual experience not relevant in certain cases",
    "section_desc": "In a prosecution for an offence under section 354, section 354A, section 354B, section 354C, section 354D, section 376, “section 376A, section 376AB, section 376B, section 376C, section 376D, section 376DA, section 376DB or section 376E of the Indian Penal Code (45 of 1860) or for attempt to commit any such offence, where the question of consent is in issue, evidence of the character of the victim or of such person’s previous sexual experience with any person shall not be relevant on the issue of such consent or the quality of consent1.\n\n1 Criminal Law (Amendment) Act, 2018"
  },
  {
    "chapter": 2,
    "section": 54,
    "section_title": "Previous bad character not relevant, except in reply",
    "section_desc": "In criminal proceedings the fact that the accused person has a bad character is irrelevant, unless evidence has been given that he has a good character, in which case it becomes relevant."
  },
  {
    "chapter": 2,
    "section": 55,
    "section_title": "Character as affecting damages",
    "section_desc": "In civil cases, the fact that the character of any person is such as to affect the amount of damages which he ought to receive, is relevant."
  },
  {
    "chapter": 3,
    "section": 56,
    "section_title": "Fact judicially noticeable need not be proved",
    "section_desc": "No fact of which the Court will take judicial notice need to be proved."
  },
  {
    "chapter": 3,
    "section": 57,
    "section_title": "Facts of which Court must take judicial notice",
    "section_desc": "The Court shall take judicial notice of the following facts—\n\t\n\t\tAll laws in force in the territory of India;\n\t\tAll public Acts passed or hereafter to be passed by Parliament of the United Kingdom and all local and personal Acts directed by Parliament of the United Kingdom to be judicially noticed;\n\t\tArticles of War for the Indian Army Navy or Air Force;\n\t\tThe course of proceeding of Parliament of the United Kingdom, of the Constituent Assembly of India, of Parliament and of the legislatures established under any law for the time being in force in a Province or in the States;\n\t\tThe accession and the sign manual of the Sovereign for the time being of the United Kingdom of Great Britain and Ireland;\n\t\tAll seals of which English Courts take judicial notice : the seals of all the Courts in India and all Courts out of India established by the authority of the Central Government or the Crown Representative; the seals of Courts of Admiralty and Maritime Jurisdiction and of Notaries Public, and all seals which any person is authorized to use by the Constitution or an Act of Parliament of the United Kingdom or an Act or Regulation having the force of law in India;\n\t\tThe accession to office, names, titles, functions and signatures of the persons filling for the time being any public office in any State, if the fact of their appointment to such office is notified in any Official Gazette;\n\t\tThe existence, title and national flag of every State or Sovereign recognized by the Government of India;\n\t\tThe divisions of time, the geographical divisions of the world, and public festivals, fasts and holidays notified in the Official Gazette;\n\t\tThe territories under the dominion of the Government of India;\n\t\tThe commencement, continuance, and termination of hostilities between the Government of India and any other State of body of persons;\n\t\tThe names of the members and officers of the Court and of their deputies and subordinate officers and assistants, and also of all officers acting in execution of its process, and of or all advocates, attorneys, proctors, vakils pleaders and other persons authorized by law to appear or act before it;\n\t\tThe rule of the road 1on land or at sea.\nIn all these cases, and also on all matters of public history, literature, science or art, the Court may resort for its aid to appropriate books or documents of reference.\nIf the Court is called upon by any person to take judicial notice of any fact, it may refuse to do so, unless and until such person produces any such book or document as it may consider necessary to enable it to do so."
  },
  {
    "chapter": 3,
    "section": 58,
    "section_title": "Facts admitted need not be proved",
    "section_desc": "No fact need to be proved in any proceeding which the parties thereto or their agents agree to admit at the hearing, or which, before the hearing, they agree to admit by any writing under their hands, or which by any rule of pleading in force at the time they are deemed to have admitted by their pleadings;\nProvided that the court may, in its discretion, require the facts admitted to be proved otherwise than by such admission."
  },
  {
    "chapter": 4,
    "section": 59,
    "section_title": "Proof of facts by oral evidence",
    "section_desc": "All facts, except the contents of documents or electronic records, may be proved by oral evidence."
  },
  {
    "chapter": 4,
    "section": 60,
    "section_title": "Oral evidence must be direct",
    "section_desc": "Oral evidence must, in all cases whatever, be direct; that is to say—\nIf it refers to a fact which could be seen, it must be the evidence of a witness who says he saw it;\nIf it refers to a fact which could be heard, it must be the evidence of a witness who says he heard it;\nIf it refers to a fact which could be perceived by any other sense or in any other manner, it must be the evidence of a witness who says he perceived it by that sense or in that manner;\nIf it refers to an opinion or to the grounds on which that opinion is held, it must be the evidence of the person who holds that opinion on those grounds;\nProvided that the opinions of experts expressed in any treatise commonly offered for sate, and the grounds on which such opinions are held, may be proved by the production of such treatises if the author is dead or cannot be found, or has become incapable of giving evidence, or cannot be called as a witness without an amount of delay or expense which the Court regards as unreasonable:\nProvided also that, if oral evidence refers to the existence or condition of any material thing other than a document, the Court may, if it thinks fit, require the production of such material thing for its inspection."
  },
  {
    "chapter": 5,
    "section": 61,
    "section_title": "Proof of contents of documents",
    "section_desc": "The contents of documents may be proved either by primary or by secondary evidence."
  },
  {
    "chapter": 5,
    "section": 62,
    "section_title": "Primary evidence",
    "section_desc": "Primary evidence means the document itself produced for the inspection of the Court."
  },
  {
    "chapter": 5,
    "section": 63,
    "section_title": "Secondary evidence",
    "section_desc": "Secondary evidence means and includes—\n\t\n\t\tCertified copies given under the provisions hereinafter contained;\n\t\tCopies made from the original by mechanical processes which in themselves insure the accuracy of the copy, and copies compared with such copies;\n\t\tCopies made from or compared with the original;\n\t\tCounterparts of documents as against the parties who did not execute them;\n\t\tOral accounts of the contents of a document given by some person who has himself seen it."
  },
  {
    "chapter": 5,
    "section": 64,
    "section_title": "Proof of documents by primary evidence",
    "section_desc": "Documents must be proved by primary evidence except in the cases hereinafter mentioned."
  },
  {
    "chapter": 5,
    "section": 65,
    "section_title": "Cases in which secondary evidence relating to documents may be given",
    "section_desc": "Secondary evidence may be given of the existence, condition, or contents of a document in the following cases—\n\t\n\t\tWhen the original is shown or appears to be in the possession or power—\nof the person against whom the document is sought to be proved, or of any person out of reach of, or not subject to, the process of the Court, or\nof any person legally bound to produce it,\nand when, after the notice mentioned in section 66, such person does not produce it;\n\t\twhen the existence, condition or contents of the original have been proved to be admitted in writing by the person against whom it is proved or by his representative in interest;\n\t\twhen the original has been destroyed or lost, or when the party offering evidence of its contents cannot, for any other reason not arising from his own default or neglect, produce it in reasonable time;\n\t\twhen the original is of such a nature as not to be easily movable;\n\t\twhen the original is a public document within the meaning of section 74;\n\t\twhen the original is a document of which a certified copy is permitted by this Act, or by any other law in force in India to be given in evidence;\n\t\twhen the original consists of numerous accounts or other documents which cannot conveniently be examined in Court and the fact to be proved is the general result of the whole collection.\nIn cases (a), ( c) and (d), any secondary evidence of the contents of the document is admissible.\nIn case (b), the written admission is admissible.\nIn case (e) or (f), a certified copy of the document, but no other kind of secondary evidence, is admissible.\nIn case (g), evidence may be given as to the general result of the documents by any person who has examined them, and who is skilled in the examination of such documents."
  },
  {
    "chapter": 5,
    "section": "65A",
    "section_title": "Special provisions as to evidence relating to electronic record",
    "section_desc": "The contents of electronic records may be proved in accordance with the provisions of section 65B (w.e.f. 17-10-2000)."
  },
  {
    "chapter": 5,
    "section": "65B",
    "section_title": "Admissibility of electronic records",
    "section_desc": "Notwithstanding anything contained in this Act, any information contained in an electronic record which is printed on a paper, stored, recorded or copied in optical or magnetic media produced by a computer (hereinafter referred to as the computer output) shall be deemed to be also a document, if the conditions mentioned in this section are satisfied in relation to the information and computer in question and shall be admissible in any proceedings, without further proof or production of the original, as evidence or any contents of the original or of any fact stated therein of which direct evidence would be admissible.\n\t\tThe conditions referred to in sub-section (1) in respect of a computer output shall be the following, namely—\n\t\t\n\t\t\tthe computer output containing the information was produced by the computer during the period over which the computer was used regularly to store or process information for the purposes of any activities regularly carried on over that period by the person having lawful control over the use of the computer;\n\t\t\tduring the said period, information of the kind contained in me electronic record or of the kind from which the information so contained is derived was regularly fed into the computer in the ordinary course of the said activities;\n\t\t\tthroughout the material part of the said period, the computer was operating properly or, if not, then in respect of any period in which it was not operating properly or was out of operation during that part of the period, was not such as to affect the electronic record or the accuracy of its contents; and\n\t\t\tthe information contained in the electronic record reproduces or is derived from such information fed into the computer in the ordinary course of the said activities.\n\t\t\n\t\tWhere over any period, the function of storing or processing information for the purposes of any activities regularly carried on over that period as mentioned in clause (a) of sub-section (2) was regularly performed by computers, whether—\n\t\t\n\t\t\tby a combination of computers operating over that period; or\n\t\t\tby different computers operating in succession over that period; or\n\t\t\tby different combinations of computers operating in succession over that period; or\n\t\t\tin any other manner involving the successive operation over that period, in whatever order, of one or more computers and one or more combinations of computers,\nall the computers used for that purpose during that period shall be treated for the purposes of this section as constituting a single computer; and references in the section to a computer shall be construed accordingly.\n\t\t\n\t\tIn any proceedings where it is desired to give a statement in evidence by virtue of this section, a certificate doing any of the following things, that is to say—\n\t\t\n\t\t\tidentifying the electronic record containing the statement and describing the manner in which it was produced;\n\t\t\tgiving such particulars of any device involved in the production of that electronic record as may be appropriate for the purpose of showing that the electronic record was produced by a computer;\n\t\t\tdealing with any of the matters to which the conditions mentioned in sub-section (2) relate, and purporting to be signed by a person occupying a responsible official position in relation to the operation of the relevant device or the management of the relevant activities (whichever is appropriate) shall be evidence of any matter stated in the certificate; and for the purposes of this sub-section it shall be sufficient for a matter to be stated to the best of the knowledge and belief of the person stating it.\n\t\t\n\t\tFor the purposes of this section—\n\t\t\n\t\t\tinformation shall be taken to be supplied to a computer if it is supplied thereto in any appropriate form and whether it is so supplied directly or (with or without human intervention) by means of any appropriate equipment;\n\t\t\twhether in the course of activities carried on by any official information is supplied with a view to its being stored or processed for the purposes of those activities by a computer operated otherwise than in the course of those activities, that information, if duly supplied to that computer, shall be taken to be supplied to it in the course of those activities;\n\t\t\ta computer output shall be taken to have been produced by a computer whether it was produced by it directly or (with or without human intervention) by means of any appropriate equipment."
  },
  {
    "chapter": 5,
    "section": 66,
    "section_title": "Rules as to notice to produce",
    "section_desc": "Secondary evidence of the contents of the documents referred to in section 65, clause (a), shall not be given unless the party proposing to give such secondary evidence has previously given to the party in whose possession or power the document is, or to his attorney or pleader, such notice to produce it as is prescribed by law, and if no notice is prescribed by law, then such notice as the Court considers reasonable under the circumstances of the case;\nProvided that such notice shall not be required in order to render secondary evidence admissible in any of the following cases, or in any other case in which the Court thinks fit to dispense with it—\n\t\n\t\twhen the document to be proved is itself a notice;\n\t\twhen, from the nature of the case, the adverse party must know that he will be required to produce it;\n\t\twhen it appears or is proved that the adverse party has obtained possession of the original by fraud or force;\n\t\twhen the adverse party or his agent has the original in Court;\n\t\twhen the adverse party or his agent has admitted the loss of the document;\n\t\twhen the person in possession of the document is out of reach of, or not subject to, the process of the Court."
  },
  {
    "chapter": 5,
    "section": 67,
    "section_title": "Proof of signature and handwriting of person alleged to have signed or written document produced",
    "section_desc": "If a document is alleged to be signed or to have been written wholly or in part by any person, the signature or the handwriting of so much of the document as is alleged to be in that person’s handwriting must be proved to be in his handwriting."
  },
  {
    "chapter": 5,
    "section": "67A",
    "section_title": "Proof as to digital signature",
    "section_desc": "Except in the case of a secure digital signature, if the digital signature of any subscriber is alleged to have been affixed to an electronic record the fact that such digital signature is the digital signature of the subscriber must be proved."
  },
  {
    "chapter": 5,
    "section": 68,
    "section_title": "Proof of execution of document required by law to be attested",
    "section_desc": "If a document is required by law to be attested, it shall not be used as evidence until one attesting witness at least has been called for the purpose of proving its execution, if there be an attesting witness alive, and subject to the process of the Court and capable of giving evidence;\nProvided that it shall be necessary to call an attesting witness in proof of the execution of any document, not being a Will, which has been registered in accordance with the provisions of the Indian Registration Act, 1908 (16 of 1908), unless its execution by the person by whom it purports to have been executed is specifically denied."
  },
  {
    "chapter": 5,
    "section": 69,
    "section_title": "Proof where no attesting witness found",
    "section_desc": "If no such attesting witness can be found, or if the document purports to have been executed in the United Kingdom, it must be proved that the attestation of one attesting witness at least is in his handwriting, and that the signature of the person executing the documents is in the handwriting of that person."
  },
  {
    "chapter": 5,
    "section": 70,
    "section_title": "Admission of execution by party to attested document",
    "section_desc": "The admission of a party to an attested document of its execution by himself shall be sufficient proof of its execution as against him, though it be a document required by law to be attested."
  },
  {
    "chapter": 5,
    "section": 71,
    "section_title": "Proof when attesting witness denies the execution",
    "section_desc": "If the attesting witness denies or does not recollect the execution of the document, its execution may be proved by other evidence"
  },
  {
    "chapter": 5,
    "section": 72,
    "section_title": "Proof of document not required by law to be attested",
    "section_desc": "An attesting document not required by law to be attested may be proved as if it was unattested."
  },
  {
    "chapter": 5,
    "section": 73,
    "section_title": "Comparison of signature, writing or seal with others admitted or proved",
    "section_desc": "In order to ascertain whether a signature, writing, or seal is that of the person by whom it purports to have been written or made, any signature, writing, or seal admitted or proved to the satisfaction of the Court to have been written or made by that person may be compared with the one which is to be proved, although that signature, writing, or seal has not been produced or proved for any other purpose.\nThe Court may direct any person present in court to write any words or figures for the purpose of enabling the Court to compare the words or figures so written with any words or figures alleged to have been written by such person.\nThis section applies also, with any necessary modifications, to finger-impressions."
  },
  {
    "chapter": 5,
    "section": "73A",
    "section_title": "Proof as to verification of digital signature",
    "section_desc": "In order to ascertain whether a digital signature is that of the person by whom it purports to have been affixed, the Court may direct—\n\t\n\t\tthat person or the Controller or the Certifying Authority to produce the Digital Signature Certificate;\n\t\tany other person to apply the public key listed in the Digital Signature Certificate and verify the digital signature purported to have been affixed by that person."
  },
  {
    "chapter": 5,
    "section": 74,
    "section_title": "Public documents",
    "section_desc": "The following documents are public documents—\n\t\n\t\tDocuments forming the acts, or records of the acts—\n\t\t\n\t\t\tof the sovereign authority,\n\t\t\tof official bodies and tribunals, and\n\t\t\tof public officers, legislative, judicial and executive, of any part of India or of the Commonwealth, or of a foreign country;\n\t\t\n\t\tPublic records kept in any State of private documents."
  },
  {
    "chapter": 5,
    "section": 75,
    "section_title": "Private documents",
    "section_desc": "All other documents are private."
  },
  {
    "chapter": 5,
    "section": 76,
    "section_title": "Certified copies of public documents",
    "section_desc": "Every public officer having the custody of a public document, which any person has a right to inspect, shall give that person on demand a copy of it on payment of the legal fees therefore, together with a certificate written at the foot of such copy that it is true copy of such document or part thereof, as the case may be and such certificate shall be dated and subscribed by such officer with his name and his official title, and shall be sealed, whenever such officer is authorised by law to make use of a seal;\nand such copies so certified shall be called certified copies."
  },
  {
    "chapter": 5,
    "section": 77,
    "section_title": "Proof of documents by production of certified copies",
    "section_desc": "Such certified copies may be produced in proof of the contents of the public documents or parts of the public documents of which they purport to be copies."
  },
  {
    "chapter": 5,
    "section": 78,
    "section_title": "Proof of other official documents",
    "section_desc": "The following public documents may be proved as follows:-\n\t\n\t\tActs, orders or notifications of the Central Government in any of its departments, or of the Crown Representative or of any State Government or any department of any State Government—\nby the records of the departments, certified by the head of those departments respectively, or by any document purporting to be printed by order of any such Government or as the case may be, of the Crown Representative;\n\t\tThe proceedings of the Legislatures—\nby the journals of those bodies respectively, or by published Acts or abstracts, or by copies purporting to be printed by order of the Government concerned;\n\t\tProclamations, orders or regulations issued by Her Majesty or by the Privy Council, or by any department of Her Majesty’s Government—\nby copies or extracts contained in the London Gazette, or purporting to be printed by the Queen’s printer;\n\t\tthe acts of the Executive or the proceedings of the Legislature of a foreign country—\nby journals published by their authority, or commonly received in that country as such, or by a copy certified under the seal of the country or sovereign, or by a recognition thereof in some Central Act;\n\t\tThe proceedings of a municipal body in a State—\nby a copy of such proceedings, certified by the legal keeper thereof, or by a printed book purporting to be published by the authority of such body;\n\t\tPublic documents of any other class in a foreign country—\nby the original, or by a copy certified by the legal keeper thereof, with a certificate under the seal of a Notary Public, or of an Indian Consul or diplomatic agent that the copy is duly certified by the officer having the legal custody of the original, and upon proof of the character of the document according to the law of the foreign country."
  },
  {
    "chapter": 5,
    "section": 79,
    "section_title": "Presumption as to genuineness of certified copies",
    "section_desc": "The Court shall presume to be genuine every document purporting to be a certificate, certified copy, or other document, which is by law declared to be admissible as evidence of any particular fact and which purports to be duly certified by an officer of the Central Government or of a State Government, or by any officer in the Slate of Jammu and Kashmir who is duly authorized thereto by the Central Government;\nProvided that such document is substantially in the form and purports to be executed in the manner directed by law in that behalf.\nThe Court shall also presume that any officer by whom any such document purports to be signed or certified held when he signed it, the official character which he claims in such paper."
  },
  {
    "chapter": 5,
    "section": 80,
    "section_title": "Presumption as to documents produced as record of evidence",
    "section_desc": "Whenever any document is produced before any Court, purporting to be a record or memorandum of the evidence, or of any part of the evidence, given by a witness in a judicial proceedings or before any officer authorised by law to take such evidence or to be a statement or confession by any prisoner or accused person, taken in accordance with law, and purporting to be signed by any judge or Magistrate or by any such officer as aforesaid the Court shall presume—\nthat the document is genuine; that any statements as to the circumstances under which it was taken, purporting to be made by the person signing it, are true, and that such evidence, statement or confession was duly taken."
  },
  {
    "chapter": 5,
    "section": 81,
    "section_title": "Presumption as to Gazettes, newspapers, private Acts of Parliament and other documents",
    "section_desc": "The Court shall presume the genuineness of every document purporting to be the London Gazette or any Official Gazette, or the Government Gazette of any colony, dependency of possession of the British Crown, or to be a newspaper or journal, or to be a copy of a private Act of Parliament of the United Kingdom printed by the Queen’s Printer and of every document purporting to be a document directed by any law to be kept by any person, if such document is kept substantially in the form required by law and is produced from proper custody."
  },
  {
    "chapter": 5,
    "section": "81A",
    "section_title": "Presumption as to Gazettes in electronic forms",
    "section_desc": "The Court shall presume the genuineness of every electronic record purporting to be the Official Gazette or purporting to be electronic record directed by any law to be kept by any person, if such electronic record is kept substantially in the form required by law and is produced from proper custody."
  },
  {
    "chapter": 5,
    "section": 82,
    "section_title": "Presumption as to document admissible in England without proof of seal or signature",
    "section_desc": "When any document is produced before any Court, purporting to be a document which, by the law in force for the time being in England or Ireland, would be admissible in proof of any particular in any Court of justice in England or Ireland, without proof of the seal or stamp or signature authenticating it, or of the judicial or official character claimed by the person by whom it purports to be signed, the Court shall presume that such seal, stamp or signature is genuine, and mat me person signing it held, at the lime when he signed it, the judicial or official character which he claims, and the document shall be admissible for the same purpose for which it would be admissible in England or Ireland."
  },
  {
    "chapter": 5,
    "section": 83,
    "section_title": "Presumption as to maps or plans made by authority of Government",
    "section_desc": "The Court shall presume that maps or plans purporting to be made by the authority of the Central Government or any State Government were so made, and are accurate; but maps or plans made for the purposes of any cause must be proved to be accurate."
  },
  {
    "chapter": 5,
    "section": 84,
    "section_title": "Presumption as to collections of laws and reports of decisions",
    "section_desc": "The Court shall presume the genuineness of every book purporting to be printed or published under the authority of the Government of any country, and to contain any of the laws of that country,\nand of every book purporting to contain reports of decisions of the Courts of such country."
  },
  {
    "chapter": 5,
    "section": 85,
    "section_title": "Presumption as to power-of-attorney",
    "section_desc": "The Court shall presume that every document purporting to be a power-of-attorney, and to have been executed before, and authenticated by, a Notary Public, or any court, Judge, Magistrate, Indian Consul or Vice-Consul, or representative  of the Central Government, was so executed and authenticated."
  },
  {
    "chapter": 5,
    "section": "85A",
    "section_title": "Presumption as to electronic agreements",
    "section_desc": "The Court shall presume that every electronic record purporting to be an agreement containing the digital signatuers of the parties was so concluded by affixing the digital signature of the parties."
  },
  {
    "chapter": 5,
    "section": "85B",
    "section_title": "Presumption as to electronic records and digital signatures",
    "section_desc": "In any proceedings, involving a secure electronic record, the Court shall presume unless contrary is proved, that the secure electronic record has not been altered since the specific point of time to which the secure status relates.\n\t\tIn any proceedings, involving secure digital signature, the Court shall presume unless the contrary is proved that—\n\t\t\n\t\t\tthe secure digital signature is affixed by subscriber with the intention of signing or approving the electronic record;\n\t\t\texcept in the case of a secure electronic record or a secure digital signature, nothing in this section shall cerate any presumption, relating to authenticity and integrity of the electronic record or any digital signature."
  },
  {
    "chapter": 5,
    "section": "85C",
    "section_title": "Presumption as to Digital Signature Certificates",
    "section_desc": "The Court shall presume, unless contrary is proved, that the information listed in a Digital Signature Certificate is correct, except for information specified as subscriber information which has not been verfied, if the certificate was accepted by the subscriber."
  },
  {
    "chapter": 5,
    "section": 86,
    "section_title": "Presumption as to certified copies of foreign judicial records",
    "section_desc": "The Court may presume that any document purporting to be a certified copy of any judicial record of any country not forming part of India or of Her Majesty’s dominions is genuine and accurate, if the document purports to be certified in any manner which is certified by any representative of the Central Government in or for such country to be the manner commonly in use in that country for the certification of copies of judicial records.\nAn officer who, with respect to any territory or place not forming part of India or Her Majesty’s dominions, is a Political Agent therefore, as defined in section 3, clause (43), of the General Clauses Act, 1897 (10 of 1897), shall, for the purposes of this section, be deemed to be a representative of the Central Government in and for the country comprising that territory or place."
  },
  {
    "chapter": 5,
    "section": 87,
    "section_title": "Presumption as to books, maps and charts",
    "section_desc": "The Court may presume that any book to which it may refer for information on matters of public or general interest, and that any published map or chart, the statements of which are relevant facts and which is produced for its inspection, was written and published by the person and at the time and place, by whom or at which it purports to have been written or published."
  },
  {
    "chapter": 5,
    "section": 88,
    "section_title": "Presumption as to telegraphic messages",
    "section_desc": "The Court may presume that a message, forwarded from a telegraph office to the person to whom such message purports to be addressed, corresponds with a message delivered for transmission at the office from which the message purports to be sent; but the Court shall not make any presumption as to the person by whom such message was delivered for transmission."
  },
  {
    "chapter": 5,
    "section": "88A",
    "section_title": "Presumption as to electronic messages",
    "section_desc": "The Court may presume that an electronic message, forwarded by the originator through an electronic mail server to the addressee to whom the message purports to be addressed corresponds with the message as fed into his computer for transmission; but the Court shall not make any presumption as to the person by whom such message was sent."
  },
  {
    "chapter": 5,
    "section": 89,
    "section_title": "Presumption as to due execution, etc. of documents not produced",
    "section_desc": "The Court shall presume that every document, called for and not produced after notice to produce, was attested, stamped and executed in the manner required by law."
  },
  {
    "chapter": 5,
    "section": 90,
    "section_title": "Presumption as to documents thirty years old",
    "section_desc": "Where any document, purporting or proved to be thirty years old, is produced from any custody which the Court in the particular case considers proper, the Court may presume that the signature and every other part of such document, which purports to be in the handwriting of any particular person, is in that person’s handwriting, and, in the case of a document executed or attested, that it was duly executed and attested by the persons by whom it purports to be executed and attested."
  },
  {
    "chapter": 5,
    "section": "90A",
    "section_title": "Presumption as to electronic records five years old",
    "section_desc": "Where any electronic record, purporting or proved to be five years old, is produced from any custody which the Court in the particular case considers proper, the Court may presume that the digital signature which purports to be the digital signature of any particular person was so affixed by him or any person authorised by him in this behalf."
  },
  {
    "chapter": 6,
    "section": 91,
    "section_title": "Evidence of terms of contracts, grants and other dispositions of property reduced to form of document",
    "section_desc": "When the terms of a contract, or of a grant, or of any other disposition of property, have been reduced to the form of a document, and in all cases in which any matter is required by law to be reduced to the form of a document, no evidence1 shall be given in proof of the terms of such contract, grant or other disposition of property, or of such matter, except the document itself, or secondary evidence of its contents in cases in which secondary evidence is admissible under the provisions herein-before contained."
  },
  {
    "chapter": 6,
    "section": 92,
    "section_title": "Exclusion of evidence of oral agreement",
    "section_desc": "When the terms of any such contract, grant or other disposition of property, or any matter required by law to be reduced to the form of a document have been proved according to the last section, no evidence of any oral agreement or statement shall be admitted, as between the parties to any such instrument or their representatives in interest, for the purpose of contradicting, varying, adding to, or subtracting from, its terms;\nProviso (1): Any fact may be proved which would invalidate any document, or which would entitle any person to any decree or order relating thereto; such as fraud, intimidation, illegality, want of due execution, want of capacity in any contracting party want or failure of consideration, or mistake in fact or law:\nProviso (2): The existence of any separate oral agreement as to any matter on which a document is silent, and which is not inconsistent with its terms, may be proved. In considering whether or not this proviso applies, the Court shall have regard to the degree of formality of the document:\nProviso (3): The existence of any separate oral agreement, constituting a condition precedent to the attaching of any obligation under any such contract, grant or disposition of property, may be proved.\nProviso (4): The existence of any distinct subsequent oral agreement to rescind or modify any such contract, grant or disposition of property, may be proved, except in cases in which such contract, grant or disposition of property is by law required to be in writing, or has been registered according to the law in force for the time being as to the registration of documents.\nProviso (5): Any usage or custom by which incidents not expressly mentioned in any contract are usually annexed to contracts of that description, may be proved;\nProvided that the annexing of such incident would not be repugnant to, or inconsistent with the express terms of the contract:\nProviso (6): Any fact may be proved which shows in what manner the language of a document is related to existing facts."
  },
  {
    "chapter": 6,
    "section": 93,
    "section_title": "Exclusion of evidence to explain or amend ambiguous document",
    "section_desc": "When the language used in a document is, on its face, ambiguous or defective, evidence may not be given of facts which would show its meaning or supply its defects."
  },
  {
    "chapter": 6,
    "section": 94,
    "section_title": "Exclusion of evidence against application of document to existing facts",
    "section_desc": "When language used in a document is plain in itself, and when it applies accurately to existing facts, evidence may not be given to show that it was not meant to apply to such facts."
  },
  {
    "chapter": 6,
    "section": 95,
    "section_title": "Evidence as to document unmeaning in reference to existing facts",
    "section_desc": "When language used in a document is plain in itself, but is unmeaning in reference to existing facts, evidence may be given to show that it was used in a peculiar sense."
  },
  {
    "chapter": 6,
    "section": 96,
    "section_title": "Evidence as to application of language which can apply to one only of several persons",
    "section_desc": "When the facts are such that the language used might have been meant to apply to any one, and could not have been meant to apply to more than one, of several persons or things, evidence may be given of facts which show which of those persons or things it was intended to apply to."
  },
  {
    "chapter": 6,
    "section": 97,
    "section_title": "Evidence as to application of language to one of two sets of facts, to neither of which the whole correctly applies",
    "section_desc": "When the language used applies partly to one set existing facts, and partly to another set of existing facts, but the whole of it does not apply correctly to either, evidence may be given to show to which of the two it was meant to apply."
  },
  {
    "chapter": 6,
    "section": 98,
    "section_title": "Evidence as to meaning of illegible characters, etc",
    "section_desc": "Evidence may be given to show the meaning of illegible or not commonly intelligible characters, of foreign, obsolete, technical, local and provincial expressions, of abbreviations and of words used in a peculiar sense."
  },
  {
    "chapter": 6,
    "section": 99,
    "section_title": "Who may give evidence of agreement varying term of document",
    "section_desc": "Persons who are not parties to a document, or their representatives in interest, may give evidence of any facts tending to show a contemporaneous agreement varying the terms of the document."
  },
  {
    "chapter": 6,
    "section": 100,
    "section_title": "Saving of provisions of Indian Succession Act relating to wills",
    "section_desc": "Nothing in this Chapter contained shall be taken to affect any of the provisions of the Indian Succession Act (10 of 1865)1 as to the construction of wills."
  },
  {
    "chapter": 7,
    "section": 101,
    "section_title": "Burden of proof",
    "section_desc": "Whoever desires any Court to give judgment as to any legal right or liability dependent on the existence of facts which he asserts, must prove that those facts exist.\nWhen a person is bound to prove the existence of any fact, it is said that the burden of proof lies on that person."
  },
  {
    "chapter": 7,
    "section": 102,
    "section_title": "On whom burden of proof lies",
    "section_desc": "The burden of proof in a suit or proceeding lies on that person who would fail if no evidence at all were given on either side."
  },
  {
    "chapter": 7,
    "section": 103,
    "section_title": "Burden of proof as to particular fact",
    "section_desc": "The burden of proof as to any particular fact lies on that person who wishes the Court to believe in its existence, unless it is provided by any law that the proof of that fact shall lie on any particular person."
  },
  {
    "chapter": 7,
    "section": 104,
    "section_title": "Burden of proving fact to be proved to make evidence admissible",
    "section_desc": "The burden of proving any fact necessary to be proved in order to enable any person to give evidence of any other fact is on the person who wishes to give such evidence."
  },
  {
    "chapter": 7,
    "section": 105,
    "section_title": "Burden of proving that case of accused comes within exceptions",
    "section_desc": "When a person is accused of any offence, the burden of proving the existence of circumstances bringing the case within any of the General Exceptions in the Indian Penal Code, (45 of 1860) or within any special exception or proviso contained in any other part of the same Code, or in any law defining the offence, is upon him, and the Court shall presume the absence of such circumstances."
  },
  {
    "chapter": 7,
    "section": 106,
    "section_title": "Burden of proving fact especially within knowledge",
    "section_desc": "When any fact is especially within the knowledge of any person, the burden of proving that fact is upon him."
  },
  {
    "chapter": 7,
    "section": 107,
    "section_title": "Burden of proving death of person known to have been alive within thirty years",
    "section_desc": "When the question is whether a man is alive or dead, and it is shown that he was alive within thirty years, the burden of proving that he is dead is on the person who affirms it."
  },
  {
    "chapter": 7,
    "section": 108,
    "section_title": "Burden of proving that person is alive who has not been heard of for seven years",
    "section_desc": "Provided that when the question is whether a man is alive or dead, and it is proved that he has not been heard of for seven years by those who would naturally have heard of him if he had been alive, the burden of proving that he is alive is shifted to the person who affirms it."
  },
  {
    "chapter": 7,
    "section": 109,
    "section_title": "Burden of proof as to relationship in the cases of partners, landlord and tenant, principal and agent",
    "section_desc": "When the question is whether persons are partners, landlord and tenant, or principal and agent, and it has been shown that they have been acting as such, the burden of proving that they do not stand, or have ceased to stand, to each other in those relationships respectively, is on the person who affirms it."
  },
  {
    "chapter": 7,
    "section": 110,
    "section_title": "Burden of proof as to ownership",
    "section_desc": "When the question is whether any person is owner of anything of which he is shown to be in possession, the burden of proving that he is not the owner is on the person who affirms that he is not the owner."
  },
  {
    "chapter": 7,
    "section": 111,
    "section_title": "Proof of good faith in transactions where one party is in relation of active confidence",
    "section_desc": "Where there is a question as to the good faith of a transaction between parties, one of whom stands to the other in a position of active confidence, the burden of proving the good faith of the transaction is on the party who is in a position of active confidence."
  },
  {
    "chapter": 7,
    "section": "111A",
    "section_title": "Presumption as to certain offences",
    "section_desc": "Where a person is accused of having committed any offence specified in sub-section (2), in—\n\t\t\n\t\t\tany area declared to be a disturbed areas under any enactment, for the time being in force, making provision for the suppression of disorder and restoration and maintenance of public order; or\n\t\t\tany area in which there has been, over a period of more than one month, extensive disturbance of the public peace,\nand it is shown that such person had been at a place in such area at a time when firearms or explosives were used at or from that place to attack or resist the members of any armed forces or the forces charged with the maintenance of public order acting in the discharge of their duties, it shall be presumed, unless the contrary is shown, that such person had committed such offence.\n\t\t\n\t\tThe offences referred to in sub-section (1) are the following, namely—\n\t\t\n\t\t\tan offence under section 121, section 121A section 122 or section 123 of the Indian Penal Code (45 of 1860);\n\t\t\tcriminal conspiracy or attempt to commit, or abatement of, an offence under section 122 or section 123 of the Indian Penal Code (45 of 1860)."
  },
  {
    "chapter": 7,
    "section": 112,
    "section_title": "Birth during marriage, conclusive proof of legitimacy",
    "section_desc": "The fact that any person was born during the continuance of a valid marriage between his mother and any man, or within two hundred and eighty days after its dissolution, the mother remaining unmarried, shall be conclusive proof that he is the legitimate son of that man, unless it can be shown that the parties to the marriage had no access to each other at any time when he could have been begotten."
  },
  {
    "chapter": 7,
    "section": 113,
    "section_title": "Proof of cession of territory",
    "section_desc": "A notification in the Official Gazette that any portion of British territory has before the commencement of Part III of the Government of India Act, 1935 (26 Geo. 5, ch. 2) been ceded to any Native State, Prince or Ruler, shall be conclusive proof that a valid cession of such territory took place at the dale mentioned in such notification"
  },
  {
    "chapter": 7,
    "section": "113A",
    "section_title": "Presumption as to abetment of suicide by a married woman",
    "section_desc": "When the question is whether the commission of suicide by a woman had been abetted by her husband or any relative of her husband and it is shown that she had committed suicide within a period of seven years from the date of her marriage and that her husband or such relative of her husband had subjected her to cruelty, the Court may presume, having regard to all the other circumstances of the case, that such suicide had been abetted by her husband or by such relative of her husband."
  },
  {
    "chapter": 7,
    "section": "113B",
    "section_title": "Presumption as to dowry death",
    "section_desc": "When the question is whether a person has committed the dowry death of a woman and it is shown that soon before her death such woman has been subjected by such person to cruelty or harassment for, or in connection with, any demand for dowry, the Court shall presume that such person had caused the dowry death."
  },
  {
    "chapter": 7,
    "section": 114,
    "section_title": "Court may presume existence of certain facts",
    "section_desc": "The Court may presume the existence of any fact which it thinks likely to have happened, regard being had to the common course of natural events, human conduct and public and private business, in their relation to the facts of the particular case."
  },
  {
    "chapter": 7,
    "section": "114A",
    "section_title": "Presumption as to absence of consent in certain prosecution for rape",
    "section_desc": "In a prosecution for rape under clause (a), clause (b), clause ( c), clause (d), clause (e), clause (f), clause (g), clause (h), clause (i), clause (j), clause (k), clause (l), clause (m) or clause (n) of sub-section (2) of section 376 of the Indian Penal Code (45 of 1860), where sexual intercourse by the accused is proved and the question is whether it was without the consent of the woman alleged to have been raped and such woman states in her evidence before the court that she did not consent, the court shall presume that she did not consent.\n\nExplanations In this section, “sexual intercourse” shall mean any of the acts mentioned in clauses (a) to (d) of section 375 of the Indian Penal Code (45 of 1860)."
  },
  {
    "chapter": 8,
    "section": 115,
    "section_title": "Estoppel",
    "section_desc": "When one person has, by his declaration, act or omission, intentionally caused or permitted another person to believe a thing to be true and to act upon such belief, neither he nor his representative shall be allowed, in any suit or proceeding between himself and such person or his representative, to deny the truth of that thing."
  },
  {
    "chapter": 8,
    "section": 116,
    "section_title": "Estoppel of tenant; and of licensee of person in possession",
    "section_desc": "No tenant of immovable property, or person claiming through such tenant, shall, during the continuance of the tenancy, be permitted to deny that the landlord of such tenant had, at the beginning of the tenancy, a title to such immovable property; and no person who came upon any immovable property by the license of the person in possession thereof, shall be permitted to deny that such person had a title to such possession at the time when such license was given."
  },
  {
    "chapter": 8,
    "section": 117,
    "section_title": "Estoppel of acceptor of bill of exchange, bailee or licensee",
    "section_desc": "No acceptor of a bill of exchange shall be permitted to deny that the drawer had authority to draw such bill or to endorse it; nor shall any bailee or licensee be permitted to deny that his bailor or licensor had, at the time when the bailment or licence commenced, authority to make such bailment or grant such licence."
  },
  {
    "chapter": 9,
    "section": 118,
    "section_title": "Who may testify",
    "section_desc": "All persons shall be competent to testify unless the Court considers that they are prevented from understanding the question put to them, or from giving rational answers to those questions, by tender years, extreme old age, disease, whether of body or mind, or any other cause of the same kind."
  },
  {
    "chapter": 9,
    "section": 119,
    "section_title": "Witness unable to communicate verbally",
    "section_desc": "A witness who is unable to speak may give his evidence in any other manner in which he can make it intelligible, as by writing or by signs; but such writing must be written and the signs made in open Court, evidence so given shall be deemed to be oral evidence;\nProvided that if the witness is unable to communicate verbally, the Court shall take the assistance of an interpreter or a special educator in recording the statement, and such statement shall be videographed."
  },
  {
    "chapter": 9,
    "section": 120,
    "section_title": "Parties to civil suit, and their wives or husbands. Husband or wife of person under criminal trial",
    "section_desc": "In all civil proceedings the parties to the suit, and the husband or wife of any party to the suit, shall be competent witnesses. In criminal proceedings against any person, the husband or wife of such person, respectively, shall be a competent witness."
  },
  {
    "chapter": 9,
    "section": 121,
    "section_title": "Judges and Magistrates",
    "section_desc": "No Judge or Magistrate shall, except upon the special order of some Court to which he is subordinate, be compelled to answer any question as to his own conduct in Court as such Judge or Magistrate, or as to anything which came to his knowledge in Court as such Judge or Magistrate; but he may be examined as to other matters which occurred in his presence whilst he was so acting."
  },
  {
    "chapter": 9,
    "section": 122,
    "section_title": "Communications during marriage",
    "section_desc": "No person who is or has been married, shall be compelled to disclose any communication made to him during marriage by any person to whom he is or has been married; nor shall he be permitted to disclose any such communication, unless the person who made it, or his representative in interest, consents, except in suits between married persons, or proceedings in which one married person is prosecuted for any crime committed against the other."
  },
  {
    "chapter": 9,
    "section": 123,
    "section_title": "Evidence as to affairs of State",
    "section_desc": "No one shall be permitted to give any evidence derived from unpublished official records relating to any affairs of State, except with the permission of the officer at the head of the department concerned, who shall give or withhold such permission as he thinks fit."
  },
  {
    "chapter": 9,
    "section": 124,
    "section_title": "Official communications",
    "section_desc": "No public officer shall be compelled to disclose communications made to him in official confidence, when he considers that the public interest would suffer by the disclosure."
  },
  {
    "chapter": 9,
    "section": 125,
    "section_title": "Information as to commission of offences",
    "section_desc": "No Magistrate or police officer shall be compelled to say whence he got any information as to the commission of any offence, and no Revenue officer shall be compelled to say whence he got any information as to the commission of any offence against the public revenue."
  },
  {
    "chapter": 9,
    "section": 126,
    "section_title": "Professional communications",
    "section_desc": "No barrister, attorney, pleader or vakil shall at any time be permitted, unless with his client’s express consent, to disclose any communication made to him in the course and for the purpose of his employment as such barrister, pleader, attorney or vakil, by or on behalf of his client, or to state the contents or condition of any document with which he has become acquainted in the course and for the purpose of his professional employment, or to disclose any advice given by him to his client in the course and for the purpose of such employment;\nProvided that nothing in this section shall protect from disclosure—\n\t\n\t\tAny such communication made in furtherance of any illegal purpose;\n\t\tAny fact observed by any barrister, pleader, attorney or vakil, in the course of his employment as such, showing that any crime or fraud has been committed since the commencement of his employment.\nIt is immaterial whether the attention of such barrister, pleader, attorney or vakil was or was not directed to such fact by or no behalf of his client."
  },
  {
    "chapter": 9,
    "section": 127,
    "section_title": "126 to apply to interpreters, etc",
    "section_desc": "The provision of section 126 shall apply to interpreters, and the clerks or servants of barristers, pleaders, attorneys, and vakils."
  },
  {
    "chapter": 9,
    "section": 128,
    "section_title": "Privilege not waived by volunteering evidence",
    "section_desc": "If any party to a suit gives evidence therein at his own instance or otherwise, he shall not be deemed to have consented thereby to such disclosure as is mentioned in section 126; and if any party to a suit or proceeding calls any such barrister, pleader, attorney or vakil as a witness, he shall be deemed to have consented to such disclosure only if he questions such barrister, attorney or vakil on matters which, but for such question, he would not be at liberty to disclose."
  },
  {
    "chapter": 9,
    "section": 129,
    "section_title": "Confidential communications with legal advisers",
    "section_desc": "No one shall be compelled to disclose to the Court any confidential communication which has taken place between him and his legal professional adviser, unless he offers himself as a witness, in which case he may be compelled to disclose any such communications as may appear to the Court necessary to be known in order to explain any evidence which he has given, but no others."
  },
  {
    "chapter": 9,
    "section": 130,
    "section_title": "Production of title-deeds of witness not a party",
    "section_desc": "No witness who is not a party to a suit shall be compelled to produce his title-deeds to any property, or any document by virtue of which he holds a property as pledgee or mortgagee or any document the production of which might tend to criminate him, unless he has agreed in writing to produce them with the person seeking the production of such deeds or some person through whom he claims."
  },
  {
    "chapter": 9,
    "section": 131,
    "section_title": "Production of documents or electronic records which another person, having possession, could refuse to produce",
    "section_desc": "No one shall be compelled to produce documents in his possession or electronic records under his control, which any other person would be entitled to refuse to produce if they were in his possession or control, unless such last-mentioned person consents to their production."
  },
  {
    "chapter": 9,
    "section": 132,
    "section_title": "Witness not excused from answering on ground that answer will criminate",
    "section_desc": "A witness shall not be excused from answering any question as to any matter relevant to the matter in issue in any suit or in any civil or criminal proceeding, upon the ground that the answer to such question will criminate, or may lend directly or indirectly to criminate, such witness, or that it will expose, or tend directly or indirectly to expose, such witness to a penalty or forfeiture of any kind;\nProvided that no such answer, which a witness shall be compelled to give, shall subject him to any arrest or prosecution, or be proved against him in any criminal proceeding, except a prosecution for giving false evidence by such answer."
  },
  {
    "chapter": 9,
    "section": 133,
    "section_title": "Accomplice",
    "section_desc": "An accomplice shall be a competent witness against an accused person; and a conviction is not illegal merely because it proceeds upon the uncorroborated testimony of an accomplice."
  },
  {
    "chapter": 9,
    "section": 134,
    "section_title": "Number of witnesses",
    "section_desc": "No particular number of witnesses shall in any case be required for the proof of any fact."
  },
  {
    "chapter": 10,
    "section": 135,
    "section_title": "Order of production and examination of witnesses",
    "section_desc": "The order in which the witnesses are produced and examined shall be regulated by the law and practice for the time being relating to civil and criminal procedure respectively, and in the absence of any such law, by the discretion of the Court."
  },
  {
    "chapter": 10,
    "section": 136,
    "section_title": "Judge to decide as to admissibility of evidence",
    "section_desc": "When either party proposes to give evidence of any fact, the Judge may ask the party proposing to give the evidence in what manner the alleged fact, if proved, would be relevant; and the Judge shall admit the evidence if he thinks that the fact, if proved, would be relevant, and not otherwise.\nIf the fact proposed to be proved is one of which evidence is admissible only upon proof of some other fact, such last-mentioned fact must be proved before evidence is given of the fact first mentioned, unless the party undertakes to give proof of such fact, and the Court is satisfied with such undertaking.\nIf the relevancy of one alleged fact depends upon another alleged fact being first proved, the Judge may, in his discretion, either permit evidence of the first fact to be given before the second fact is proved, or require evidence to be given of the second fact before evidence is given of the first fact."
  },
  {
    "chapter": 10,
    "section": 137,
    "section_title": "Examination-in-chief",
    "section_desc": "The examination of a witness by the party who calls him shall be called his examination-in-chief.\nCross-examination: The examination of a witness by the adverse party shall be called his cross-examination.\nRe-examination: The examination of a witness, subsequent to the cross-examination by the party who called him, shall be called his re-examination."
  },
  {
    "chapter": 10,
    "section": 138,
    "section_title": "Order of examinations",
    "section_desc": "Witnesses shall be first examined-in-chief, then (if the adverse party so desires) cross-examined, then (if the party calling him so desires) re-examined.\nThe examination and cross-examination must relate to relevant facts but the cross-examination need not be confined to the facts to which the witness testified on his examination-in-chief\nDirection of re-examination: The re-examination shall be directed to the explanation of matters referred to in cross-examination; and, if new matter is, by permission of the Court, introduced in re-examination, the adverse party may further cross-examine upon that matter."
  },
  {
    "chapter": 10,
    "section": 139,
    "section_title": "Cross-examination of person called to produce a document",
    "section_desc": "A person summoned to produce a document does not become a witness by the mere fact that he produces it, and cannot be cross-examined unless and until he is called as a witness."
  },
  {
    "chapter": 10,
    "section": 140,
    "section_title": "Witnesses to character",
    "section_desc": "Witnesses to character may be cross-examined and re-examined."
  },
  {
    "chapter": 10,
    "section": 141,
    "section_title": "Leading questions",
    "section_desc": "Any question suggesting the answer which the person pulling it wishes or expects to receive, is called a leading question."
  },
  {
    "chapter": 10,
    "section": 142,
    "section_title": "When they must not be asked",
    "section_desc": "Leading questions must not, if objected to by the adverse party, be asked in an examination-in-chief, or in a re-examination, except with the permission of the Court.\nThe Court shall permit leading questions as to matters which are introductory or undisputed, or which have, in its opinion, been already sufficiently proved."
  },
  {
    "chapter": 10,
    "section": 143,
    "section_title": "When they may be asked",
    "section_desc": "Leading questions may be asked in cross-examination."
  },
  {
    "chapter": 10,
    "section": 144,
    "section_title": "Evidence as to matters in writing",
    "section_desc": "Any witness may be asked, whilst under examination whether any contract, grant or other disposition of property, as to which he is giving evidence, was not contained in a document, and if he says that it was, or if he is about to make any statement as to the contents of any document, which in the opinion of the Court, ought to be produced, the adverse party may object to such evidence being given until such document is produced, or until facts have been proved which entitle the party who called the witness to give secondary evidence of it."
  },
  {
    "chapter": 10,
    "section": 145,
    "section_title": "Cross-examination as to previous statements in writing",
    "section_desc": "A witness may be cross-examined as to previous statements made by him in writing or reduced into writing, and relevant to matters in question, without such writing being shown to him, or being proved; but, if it is intended to contradict him by the writing, his attention must, before the writing can be proved, be called to those parts of it which are to be used for the purpose of contradicting him."
  },
  {
    "chapter": 10,
    "section": 146,
    "section_title": "Questions lawful in cross-examination",
    "section_desc": "When a witness is cross-examined, he may, in addition to the questions herein-before referred to, be asked any questions which tend—\n\t\n\t\tto lest his veracity.\n\t\tto discover who he is and what is his position in life, or\n\t\tto shake his credit, by injuring his character, although the answer to such questions might tend directly or indirectly to criminate him or might expose or tend directly or indirectly to expose him to a penalty or forfeiture;\n\t\nProvided that in a prosecution for an offence under section 376, section 376A, section1 376AB,\nsection 376B, section 376C, section 376D, section 376DA, section 376DB or section 376E of the Indian Penal Code (45 of 1860) or for attempt to commit any such offence, where the question of consent is an issue, it shall not be permissible to adduce evidence or to put questions in the cross-examination of the victim as to the general immoral character, or previous sexual experience, of such victim with any person for proving such consent or the quality of consent.\n\n1 Criminal Law (Amendment) Act, 2018"
  },
  {
    "chapter": 10,
    "section": 147,
    "section_title": "When witness to be compelled to answer",
    "section_desc": "If any such question relates to a matter relevant to the suit or proceeding, the provisions of section 132 shall apply thereto."
  },
  {
    "chapter": 10,
    "section": 148,
    "section_title": "Court to decide when question shall be asked and when witness compelled to answer",
    "section_desc": "If any such question relates to a matter not relevant to the suit or proceeding, except in so far as it affect the credit of the witness by injuring his character, the Court shall decide whether or not the witness shall be compelled to answer it, and may, if it thinks fit, warn the witness that he is not obliged to answer it. In exercising its discretion, the Court shall have regard to the following considerations—\n\t\n\t\tSuch questions are proper it they are of such a nature that the truth of the imputation conveyed by them would seriously affect the opinion of the Courts as to the credibility of the witness on the matter to which testifies;\n\t\tSuch questions are improper if the imputation which they convey relates to matters so remote in time, or of such a character, that the truth of the imputation would not affect, or would effect in a slight degree, the opinion of the Court as to the credibility of the witness on the matter to which he testifies;\n\t\tSuch questions are improper if there is a great disproportion between the importance of the imputation made against the witness’s character and the importance of his evidence;\n\t\tThe Court may, if it sees fit, draw, from the witness’s refusal to answer, the inference that the answer if given would be unfavourable."
  },
  {
    "chapter": 10,
    "section": 149,
    "section_title": "Question not to be asked without reasonable grounds",
    "section_desc": "No such question as is referred to in section 148 ought to be asked, unless the person asking it has reasonable grounds for thinking that the imputation which it conveys is well-founded."
  },
  {
    "chapter": 10,
    "section": 150,
    "section_title": "Procedure of Court in case of question being asked without reasonable grounds",
    "section_desc": "If the Court is of opinion that any such question was asked without reasonable grounds, it may, if it was asked by any barrister, pleader, vakil or attorney, report the circumstances of the case to the High Court or other authority to which such barrister, pleader, vakil or attorney is the subject in the exercise of his profession."
  },
  {
    "chapter": 10,
    "section": 151,
    "section_title": "Indecent and scandalous questions",
    "section_desc": "The Court may forbid any questions or inquiries which it regards as indecent or scandalous, although such questions or inquiries may have some bearing on the questions before the Court, unless they relate to facts in issue, or to matters necessary to be known in order to determine whether or not the facts in issue existed."
  },
  {
    "chapter": 10,
    "section": 152,
    "section_title": "Questions intended to insult or annoy",
    "section_desc": "The Court shall forbid any question which appears to it to be intended to insult or annoy, or which, though proper in itself, appears to the Court needlessly offensive in form."
  },
  {
    "chapter": 10,
    "section": 153,
    "section_title": "Exclusion of evidence to contradict answers to questions testing veracity",
    "section_desc": "When a witness has been asked and has answered any question which is relevant to the inquiry only in so far as it tends to shake his credit by injuring his character, no evidence shall be given to contradict him; but, if he answers falsely, he may afterwards be charged with giving false evidence."
  },
  {
    "chapter": 10,
    "section": 154,
    "section_title": "Question by party to his own witness",
    "section_desc": "The Court may, in its discretion, permit the person who calls a witness to put any question to him which might be put in cross-examination by the adverse party\n\t\tNothing in this section shall dis entitle the person so permitted under subsection (1) to rely on any part of the evidence of such witness."
  },
  {
    "chapter": 10,
    "section": 155,
    "section_title": "Impeaching credit of witness",
    "section_desc": "The credit of a witness may be impeached in the following ways by the adverse party, or with the consent of the Court, by the party who calls him—\n\t\n\t\tBy the evidence of persons who testify that they, from their knowledge of the witness believe him to be unworthy of credit;\n\t\tBy proof that the witness has been bribed, or has accepted the offer of a bribe, or has received any other corrupt inducement to give his evidence;\n\t\tBy proof of former statements inconsistent with any part of his evidence which is liable to be contradicted;"
  },
  {
    "chapter": 10,
    "section": 156,
    "section_title": "Question tending to corroborate evidence of relevant fact, admissible",
    "section_desc": "When a witness whom it is intended to corroborate gives evidence of any relevant fact, he may be questioned as to any other circumstances which he observed at or near to the time or place at which such relevant fact occurred, if the Court is of opinion that such circumstances, if proved, would corroborate testimony of the witness as to the relevant fact which he testifies."
  },
  {
    "chapter": 10,
    "section": 157,
    "section_title": "Former statements of witness may be proved to corroborate later testimony as to same fact",
    "section_desc": "In order to corroborate the testimony of a witness, any former statement made by such witness relating to the same fact at or about the lime when the fact took place, or before any authority legally competent to investigate the fact, may be proved."
  },
  {
    "chapter": 10,
    "section": 158,
    "section_title": "What matters may be proved in connection with proved statement relevant under section 32 or 33",
    "section_desc": "Whenever any statement, relevant under section 32 or 33, is proved, all matters may be proved either in order to contradict or to corroborate it, or in order to impeach or confirm the credit of the person by whom it was made, which might have been proved if that person had been called as a witness and had denied upon cross-examination of the truth the matter suggested."
  },
  {
    "chapter": 10,
    "section": 159,
    "section_title": "Refreshing memory",
    "section_desc": "A witness may, while under examination, refresh his memory by referring to any writing made by himself at the time of the transaction concerning which he is questioned, or so soon afterwards that the Court considers it likely that the transaction was at that time fresh in his memory.\nThe witness may also refer to any such writing made by any other person, and read by the witness within the time aforesaid, if when he read it he knew it to be correct.\nWhen witness may use copy of document to refresh memory— Whenever a witness may refresh his memory by reference to any document, he may, with the permission of the Court, refer to a copy of such document;\nProvided the Court be satisfied that there is sufficient reason for the non-production of the original.\nAn expert may refresh his memory by reference to professional treatises."
  },
  {
    "chapter": 10,
    "section": 160,
    "section_title": "Testimony to facts stated in document mentioned in section 159",
    "section_desc": "A witness may also testify to facts mentioned in any such document as is mentioned in section 159, although he has no specific recollection of the facts themselves, if he is sure that the facts were correctly recorded in the document."
  },
  {
    "chapter": 10,
    "section": 161,
    "section_title": "Right of adverse party as to writing used to refresh memory",
    "section_desc": "Any writing referred to under the provisions of the two last preceding sections must be produced and shown to the adverse party if he requires it; such party may, if he pleases, cross-examine the witness thereupon."
  },
  {
    "chapter": 10,
    "section": 162,
    "section_title": "Production of documents",
    "section_desc": "A witness summoned to produce a document shall, if it is in his possession or power, bring it to Court, notwithstanding any objection which there may be to its production or to its admissibility. The validity of any such objection shall be decided on by the Court.\nThe Court, if it sees, fit, may inspect the document, unless it refers to matters of state, or take other evidence to enable it to determine on its admissibility.\nTranslation of documents: If for such a purpose it is necessary to cause any document to be translated, the Court may, if it thinks fit, direct the translator to keep the contents secret, unless the document is to be given in evidence; and, if the interpreter disobeys such direction, he shall be held to have committed an offence under section 166 of the Indian Penal Code (45 of 1860)."
  },
  {
    "chapter": 10,
    "section": 163,
    "section_title": "Giving, as evidence, of document called for and produced on notice",
    "section_desc": "When a party calls for a document which he has given the other party notice to produce, and such document is produced and inspected by the party calling for its production, he is bound to give it as evidence if the party producing it requires him to do so."
  },
  {
    "chapter": 10,
    "section": 164,
    "section_title": "Using, as evidence, of document production of which was refused on notice",
    "section_desc": "When a party refuses to produce a document which he has had notice to produce, he cannot afterwards use the document as evidence without the consent of the other party or the order of the Court."
  },
  {
    "chapter": 10,
    "section": 165,
    "section_title": "Judge's power to put questions or order production",
    "section_desc": "The Judge may, in order to discover or to obtain proper proof of relevant facts, ask any question he pleases, in any form, at any time, of any witness, or of the parties about any fact relevant or irrelevant; and may order the production of any document or thing; and neither the parties nor their agents shall be entitled to make any objection to any such question or order, nor, without the leave of the Court, to cross-examine any witness upon any answer given in reply to any such question;\nProvided that the Judgment must be based upon facts declared by this Act to be relevant, and duly proved;\nProvided also that this section shall not authorize any Judge to compel any witness to answer any question or to produce any document which such witness would be entitled to refuse to answer or produce under sections 121 to 131, both inclusive, if the questions were asked or the documents were called for by the adverse party; nor shall the Judge ask any question which it would be improper for any other person to ask under section 148 or 149; nor shall he dispense with primary evidence of any document, except in the cases herein-before excepted."
  },
  {
    "chapter": 10,
    "section": 166,
    "section_title": "Power of jury or assessors to put questions",
    "section_desc": "In cases tried by jury or with assessors, the jury or assessors may put any question to the witnesses, through or by leave of the Judge, which the Judge himself might put and which he considers proper."
  },
  {
    "chapter": 11,
    "section": 167,
    "section_title": "No new trial for improper admission or rejection of evidence",
    "section_desc": "The improper admission or rejection of evidence shall not be ground of itself for a new trial or reversal of any decision in any case, if it shall appear to the Court before which such objection is raised that, independently of the evidence objected to and admitted, there was sufficient evidence to justify the decision, or that, if the rejected evidence had been received it ought not to have varied the decision."
  }
]